{"title": "Two stock options at the races: Black-Scholes forecasts", "abstract": "Suppose one buys two very similar stocks and is curious about how much, after some time T, one of them will contribute to the overall asset, expecting, of course, that it should be around 1/2 of the sum. Here we examine this question within the classical Black and Scholes (BS) model, focusing on the evolution of the probability density function P(w) of a random variable w = a_T^{(1)}/(a_T^{(1)} + a_T^{(2)}) where a_T^{(1)} and a_T^{(2)} are the values of two (either European- or the Asian-style) options produced by two absolutely identical BS stochastic equations. We show that within the realm of the BS model the behavior of P(w) is surprisingly different from common-sense-based expectations. For the European-style options P(w) always undergoes a transition, (when T approaches a certain threshold value), from a unimodal to a bimodal form with the most probable values being close to 0 and 1, and, strikingly, w =1/2 being the least probable value. This signifies that the symmetry between two options spontaneously breaks and just one of them completely dominates the sum. For path-dependent Asian-style options we observe the same anomalous behavior, but only for a certain range of parameters. Outside of this range, P(w) is always a bell-shaped function with a maximum at w = 1/2.", "published": "2010-05-11 08:51:57", "link": "http://arxiv.org/abs/1005.1760v2", "categories": ["q-fin.ST", "math.PR", "q-fin.GN", "q-fin.PR"], "primary_category": "q-fin.ST"}
{"title": "Insuring against loss of evidence in game-theoretic probability", "abstract": "We consider the game-theoretic scenario of testing the performance of Forecaster by Sceptic who gambles against the forecasts. Sceptic's current capital is interpreted as the amount of evidence he has found against Forecaster. Reporting the maximum of Sceptic's capital so far exaggerates the evidence. We characterize the set of all increasing functions that remove the exaggeration. This result can be used for insuring against loss of evidence.", "published": "2010-05-11 12:12:48", "link": "http://arxiv.org/abs/1005.1811v2", "categories": ["math.ST", "math.PR", "q-fin.TR"], "primary_category": "math.ST"}
