{"title": "Says who? Automatic Text-Based Content Analysis of Television News", "abstract": "We perform an automatic analysis of television news programs, based on the\nclosed captions that accompany them. Specifically, we collect all the news\nbroadcasted in over 140 television channels in the US during a period of six\nmonths. We start by segmenting, processing, and annotating the closed captions\nautomatically. Next, we focus on the analysis of their linguistic style and on\nmentions of people using NLP methods. We present a series of key insights about\nnews providers, people in the news, and we discuss the biases that can be\nuncovered by automatic means. These insights are contrasted by looking at the\ndata from multiple points of view, including qualitative assessment.", "published": "2013-07-18 09:37:45", "link": "http://arxiv.org/abs/1307.4879v2", "categories": ["cs.CL", "cs.IR"], "primary_category": "cs.CL"}
{"title": "Graphical law beneath each written natural language", "abstract": "We study twenty four written natural languages. We draw in the log scale,\nnumber of words starting with a letter vs rank of the letter, both normalised.\nWe find that all the graphs are of the similar type. The graphs are\ntantalisingly closer to the curves of reduced magnetisation vs reduced\ntemperature for magnetic materials. We make a weak conjecture that a curve of\nmagnetisation underlies a written natural language.", "published": "2013-07-18 11:03:14", "link": "http://arxiv.org/abs/1307.6235v5", "categories": ["physics.gen-ph", "cs.CL"], "primary_category": "physics.gen-ph"}
{"title": "On the Necessity of Mixed Models: Dynamical Frustrations in the Mind", "abstract": "In the present work we will present and analyze some basic processes at the\nlocal and global level in linguistic derivations that seem to go beyond the\nlimits of Markovian or Turing-like computation, and require, in our opinion, a\nquantum processor. We will first present briefly the working hypothesis and\nthen focus on the empirical domain. At the same time, we will argue that a\nmodel appealing to only one kind of computation (be it quantum or not) is\nnecessarily insufficient, and thus both linear and non-linear formal models are\nto be invoked in order to pursue a fuller understanding of mental computations\nwithin a unified framework.", "published": "2013-07-18 15:44:31", "link": "http://arxiv.org/abs/1307.4986v2", "categories": ["nlin.CD", "cs.CL", "math.DS"], "primary_category": "nlin.CD"}
