{"title": "Automatic Labeling for Entity Extraction in Cyber Security", "abstract": "Timely analysis of cyber-security information necessitates automated\ninformation extraction from unstructured text. While state-of-the-art\nextraction methods produce extremely accurate results, they require ample\ntraining data, which is generally unavailable for specialized applications,\nsuch as detecting security related entities; moreover, manual annotation of\ncorpora is very costly and often not a viable solution. In response, we develop\na very precise method to automatically label text from several data sources by\nleveraging related, domain-specific, structured data and provide public access\nto a corpus annotated with cyber-security entities. Next, we implement a\nMaximum Entropy Model trained with the average perceptron on a portion of our\ncorpus ($\\sim$750,000 words) and achieve near perfect precision, recall, and\naccuracy, with training times under 17 seconds.", "published": "2013-08-22 18:23:25", "link": "http://arxiv.org/abs/1308.4941v3", "categories": ["cs.IR", "cs.CL"], "primary_category": "cs.IR"}
{"title": "Sentiment in New York City: A High Resolution Spatial and Temporal View", "abstract": "Measuring public sentiment is a key task for researchers and policymakers\nalike. The explosion of available social media data allows for a more\ntime-sensitive and geographically specific analysis than ever before. In this\npaper we analyze data from the micro-blogging site Twitter and generate a\nsentiment map of New York City. We develop a classifier specifically tuned for\n140-character Twitter messages, or tweets, using key words, phrases and\nemoticons to determine the mood of each tweet. This method, combined with\ngeotagging provided by users, enables us to gauge public sentiment on extremely\nfine-grained spatial and temporal scales. We find that public mood is generally\nhighest in public parks and lowest at transportation hubs, and locate other\nareas of strong sentiment such as cemeteries, medical centers, a jail, and a\nsewage facility. Sentiment progressively improves with proximity to Times\nSquare. Periodic patterns of sentiment fluctuate on both a daily and a weekly\nscale: more positive tweets are posted on weekends than on weekdays, with a\ndaily peak in sentiment around midnight and a nadir between 9:00 a.m. and noon.", "published": "2013-08-22 22:14:25", "link": "http://arxiv.org/abs/1308.5010v1", "categories": ["physics.soc-ph", "cs.CL", "cs.CY"], "primary_category": "physics.soc-ph"}
