{"title": "TimeML-strict: clarifying temporal annotation", "abstract": "TimeML is an XML-based schema for annotating temporal information over\ndiscourse. The standard has been used to annotate a variety of resources and is\nfollowed by a number of tools, the creation of which constitute hundreds of\nthousands of man-hours of research work. However, the current state of\nresources is such that many are not valid, or do not produce valid output, or\ncontain ambiguous or custom additions and removals. Difficulties arising from\nthese variances were highlighted in the TempEval-3 exercise, which included its\nown extra stipulations over conventional TimeML as a response.\n  To unify the state of current resources, and to make progress toward easy\nadoption of its current incarnation ISO-TimeML, this paper introduces\nTimeML-strict: a valid, unambiguous, and easy-to-process subset of TimeML. We\nalso introduce three resources -- a schema for TimeML-strict; a validator tool\nfor TimeML-strict, so that one may ensure documents are in the correct form;\nand a repair tool that corrects common invalidating errors and adds\ndisambiguating markup in order to convert documents from the laxer TimeML\nstandard to TimeML-strict.", "published": "2013-04-26 21:31:08", "link": "http://arxiv.org/abs/1304.7289v1", "categories": ["cs.CL", "I.2.7"], "primary_category": "cs.CL"}
{"title": "Question Answering Against Very-Large Text Collections", "abstract": "Question answering involves developing methods to extract useful information\nfrom large collections of documents. This is done with specialised search\nengines such as Answer Finder. The aim of Answer Finder is to provide an answer\nto a question rather than a page listing related documents that may contain the\ncorrect answer. So, a question such as \"How tall is the Eiffel Tower\" would\nsimply return \"325m\" or \"1,063ft\". Our task was to build on the current version\nof Answer Finder by improving information retrieval, and also improving the\npre-processing involved in question series analysis.", "published": "2013-04-26 13:27:19", "link": "http://arxiv.org/abs/1304.7157v1", "categories": ["cs.CL", "cs.IR"], "primary_category": "cs.CL"}
