{"title": "Category-Theoretic Quantitative Compositional Distributional Models of\n  Natural Language Semantics", "abstract": "This thesis is about the problem of compositionality in distributional\nsemantics. Distributional semantics presupposes that the meanings of words are\na function of their occurrences in textual contexts. It models words as\ndistributions over these contexts and represents them as vectors in high\ndimensional spaces. The problem of compositionality for such models concerns\nitself with how to produce representations for larger units of text by\ncomposing the representations of smaller units of text.\n  This thesis focuses on a particular approach to this compositionality\nproblem, namely using the categorical framework developed by Coecke, Sadrzadeh,\nand Clark, which combines syntactic analysis formalisms with distributional\nsemantic representations of meaning to produce syntactically motivated\ncomposition operations. This thesis shows how this approach can be\ntheoretically extended and practically implemented to produce concrete\ncompositional distributional models of natural language semantics. It\nfurthermore demonstrates that such models can perform on par with, or better\nthan, other competing approaches in the field of natural language processing.\n  There are three principal contributions to computational linguistics in this\nthesis. The first is to extend the DisCoCat framework on the syntactic front\nand semantic front, incorporating a number of syntactic analysis formalisms and\nproviding learning procedures allowing for the generation of concrete\ncompositional distributional models. The second contribution is to evaluate the\nmodels developed from the procedures presented here, showing that they\noutperform other compositional distributional models present in the literature.\nThe third contribution is to show how using category theory to solve linguistic\nproblems forms a sound basis for research, illustrated by examples of work on\nthis topic, that also suggest directions for future research.", "published": "2013-11-06 22:06:15", "link": "http://arxiv.org/abs/1311.1539v1", "categories": ["cs.CL", "cs.LG", "math.CT", "math.LO", "68T50 (primary) 03B65, 18C50 (secondary)", "I.2.7"], "primary_category": "cs.CL"}
