{"title": "Build Electronic Arabic Lexicon", "abstract": "There are many known Arabic lexicons organized on different ways, each of\nthem has a different number of Arabic words according to its organization way.\nThis paper has used mathematical relations to count a number of Arabic words,\nwhich proofs the number of Arabic words presented by Al Farahidy. The paper\nalso presents new way to build an electronic Arabic lexicon by using a hash\nfunction that converts each word (as input) to correspond a unique integer\nnumber (as output), these integer numbers will be used as an index to a lexicon\nentry.", "published": "2013-11-23 20:10:24", "link": "http://arxiv.org/abs/1311.6045v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "NILE: Fast Natural Language Processing for Electronic Health Records", "abstract": "Objective: Narrative text in Electronic health records (EHR) contain rich\ninformation for medical and data science studies. This paper introduces the\ndesign and performance of Narrative Information Linear Extraction (NILE), a\nnatural language processing (NLP) package for EHR analysis that we share with\nthe medical informatics community. Methods: NILE uses a modified prefix-tree\nsearch algorithm for named entity recognition, which can detect prefix and\nsuffix sharing. The semantic analyses are implemented as rule-based finite\nstate machines. Analyses include negation, location, modification, family\nhistory, and ignoring. Result: The processing speed of NILE is hundreds to\nthousands times faster than existing NLP software for medical text. The\naccuracy of presence analysis of NILE is on par with the best performing models\non the 2010 i2b2/VA NLP challenge data. Conclusion: The speed, accuracy, and\nbeing able to operate via API make NILE a valuable addition to the NLP software\nfor medical informatics and data science.", "published": "2013-11-23 22:39:52", "link": "http://arxiv.org/abs/1311.6063v5", "categories": ["cs.CL"], "primary_category": "cs.CL"}
