{"title": "Sockpuppet Detection in Wikipedia: A Corpus of Real-World Deceptive\n  Writing for Linking Identities", "abstract": "This paper describes the corpus of sockpuppet cases we gathered from\nWikipedia. A sockpuppet is an online user account created with a fake identity\nfor the purpose of covering abusive behavior and/or subverting the editing\nregulation process. We used a semi-automated method for crawling and curating a\ndataset of real sockpuppet investigation cases. To the best of our knowledge,\nthis is the first corpus available on real-world deceptive writing. We describe\nthe process for crawling the data and some preliminary results that can be used\nas baseline for benchmarking research. The dataset will be released under a\nCreative Commons license from our project website: http://docsig.cis.uab.edu.", "published": "2013-10-24 20:59:27", "link": "http://arxiv.org/abs/1310.6772v1", "categories": ["cs.CL", "cs.CR", "cs.CY"], "primary_category": "cs.CL"}
{"title": "Durkheim Project Data Analysis Report", "abstract": "This report describes the suicidality prediction models created under the\nDARPA DCAPS program in association with the Durkheim Project\n[http://durkheimproject.org/]. The models were built primarily from\nunstructured text (free-format clinician notes) for several hundred patient\nrecords obtained from the Veterans Health Administration (VHA). The models were\nconstructed using a genetic programming algorithm applied to bag-of-words and\nbag-of-phrases datasets. The influence of additional structured data was\nexplored but was found to be minor. Given the small dataset size,\nclassification between cohorts was high fidelity (98%). Cross-validation\nsuggests these models are reasonably predictive, with an accuracy of 50% to 69%\non five rotating folds, with ensemble averages of 58% to 67%. One particularly\nnoteworthy result is that word-pairs can dramatically improve classification\naccuracy; but this is the case only when one of the words in the pair is\nalready known to have a high predictive value. By contrast, the set of all\npossible word-pairs does not improve on a simple bag-of-words model.", "published": "2013-10-24 21:10:53", "link": "http://arxiv.org/abs/1310.6775v1", "categories": ["cs.AI", "cs.CL", "cs.LG", "I.2.1; I.2.2; I.2.7; J.4"], "primary_category": "cs.AI"}
