{"title": "Japanese-Spanish Thesaurus Construction Using English as a Pivot", "abstract": "We present the results of research with the goal of automatically creating a\nmultilingual thesaurus based on the freely available resources of Wikipedia and\nWordNet. Our goal is to increase resources for natural language processing\ntasks such as machine translation targeting the Japanese-Spanish language pair.\nGiven the scarcity of resources, we use existing English resources as a pivot\nfor creating a trilingual Japanese-Spanish-English thesaurus. Our approach\nconsists of extracting the translation tuples from Wikipedia, disambiguating\nthem by mapping them to WordNet word senses. We present results comparing two\nmethods of disambiguation, the first using VSM on Wikipedia article texts and\nWordNet definitions, and the second using categorical information extracted\nfrom Wikipedia, We find that mixing the two methods produces favorable results.\nUsing the proposed method, we have constructed a multilingual\nSpanish-Japanese-English thesaurus consisting of 25,375 entries. The same\nmethod can be applied to any pair of languages that are linked to English in\nWikipedia.", "published": "2013-03-06 01:30:58", "link": "http://arxiv.org/abs/1303.1232v1", "categories": ["cs.CL", "cs.AI"], "primary_category": "cs.CL"}
{"title": "A Hybrid Approach to Extract Keyphrases from Medical Documents", "abstract": "Keyphrases are the phrases, consisting of one or more words, representing the\nimportant concepts in the articles. Keyphrases are useful for a variety of\ntasks such as text summarization, automatic indexing,\nclustering/classification, text mining etc. This paper presents a hybrid\napproach to keyphrase extraction from medical documents. The keyphrase\nextraction approach presented in this paper is an amalgamation of two methods:\nthe first one assigns weights to candidate keyphrases based on an effective\ncombination of features such as position, term frequency, inverse document\nfrequency and the second one assign weights to candidate keyphrases using some\nknowledge about their similarities to the structure and characteristics of\nkeyphrases available in the memory (stored list of keyphrases). An efficient\ncandidate keyphrase identification method as the first component of the\nproposed keyphrase extraction system has also been introduced in this paper.\nThe experimental results show that the proposed hybrid approach performs better\nthan some state-of-the art keyphrase extraction approaches.", "published": "2013-03-06 20:09:05", "link": "http://arxiv.org/abs/1303.1441v2", "categories": ["cs.IR", "cs.CL"], "primary_category": "cs.IR"}
