{"title": "Clinical Relationships Extraction Techniques from Patient Narratives", "abstract": "The Clinical E-Science Framework (CLEF) project was used to extract important\ninformation from medical texts by building a system for the purpose of clinical\nresearch, evidence-based healthcare and genotype-meets-phenotype informatics.\nThe system is divided into two parts, one part concerns with the identification\nof relationships between clinically important entities in the text. The full\nparses and domain-specific grammars had been used to apply many approaches to\nextract the relationship. In the second part of the system, statistical machine\nlearning (ML) approaches are applied to extract relationship. A corpus of\noncology narratives that hand annotated with clinical relationships can be used\nto train and test a system that has been designed and implemented by supervised\nmachine learning (ML) approaches. Many features can be extracted from these\ntexts that are used to build a model by the classifier. Multiple supervised\nmachine learning algorithms can be applied for relationship extraction. Effects\nof adding the features, changing the size of the corpus, and changing the type\nof the algorithm on relationship extraction are examined. Keywords: Text\nmining; information extraction; NLP; entities; and relations.", "published": "2013-06-21 15:30:09", "link": "http://arxiv.org/abs/1306.5170v1", "categories": ["cs.IR", "cs.CL"], "primary_category": "cs.IR"}
{"title": "Discriminative Training: Learning to Describe Video with Sentences, from\n  Video Described with Sentences", "abstract": "We present a method for learning word meanings from complex and realistic\nvideo clips by discriminatively training (DT) positive sentential labels\nagainst negative ones, and then use the trained word models to generate\nsentential descriptions for new video. This new work is inspired by recent work\nwhich adopts a maximum likelihood (ML) framework to address the same problem\nusing only positive sentential labels. The new method, like the ML-based one,\nis able to automatically determine which words in the sentence correspond to\nwhich concepts in the video (i.e., ground words to meanings) in a weakly\nsupervised fashion. While both DT and ML yield comparable results with\nsufficient training data, DT outperforms ML significantly with smaller training\nsets because it can exploit negative training labels to better constrain the\nlearning problem.", "published": "2013-06-21 22:09:36", "link": "http://arxiv.org/abs/1306.5263v1", "categories": ["cs.CV", "cs.CL"], "primary_category": "cs.CV"}
