{"title": "LDC Arabic Treebanks and Associated Corpora: Data Divisions Manual", "abstract": "The Linguistic Data Consortium (LDC) has developed hundreds of data corpora\nfor natural language processing (NLP) research. Among these are a number of\nannotated treebank corpora for Arabic. Typically, these corpora consist of a\nsingle collection of annotated documents. NLP research, however, usually\nrequires multiple data sets for the purposes of training models, developing\ntechniques, and final evaluation. Therefore it becomes necessary to divide the\ncorpora used into the required data sets (divisions). This document details a\nset of rules that have been defined to enable consistent divisions for old and\nnew Arabic treebanks (ATB) and related corpora.", "published": "2013-09-22 21:09:07", "link": "http://arxiv.org/abs/1309.5652v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "A Hybrid Algorithm for Matching Arabic Names", "abstract": "In this paper, a new hybrid algorithm which combines both of token-based and\ncharacter-based approaches is presented. The basic Levenshtein approach has\nbeen extended to token-based distance metric. The distance metric is enhanced\nto set the proper granularity level behavior of the algorithm. It smoothly maps\na threshold of misspellings differences at the character level, and the\nimportance of token level errors in terms of token's position and frequency.\nUsing a large Arabic dataset, the experimental results show that the proposed\nalgorithm overcomes successfully many types of errors such as: typographical\nerrors, omission or insertion of middle name components, omission of\nnon-significant popular name components, and different writing styles character\nvariations. When compared the results with other classical algorithms, using\nthe same dataset, the proposed algorithm was found to increase the minimum\nsuccess level of best tested algorithms, while achieving higher upper limits .", "published": "2013-09-22 22:06:26", "link": "http://arxiv.org/abs/1309.5657v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
