{"title": "Supervised Topical Key Phrase Extraction of News Stories using\n  Crowdsourcing, Light Filtering and Co-reference Normalization", "abstract": "Fast and effective automated indexing is critical for search and personalized\nservices. Key phrases that consist of one or more words and represent the main\nconcepts of the document are often used for the purpose of indexing. In this\npaper, we investigate the use of additional semantic features and\npre-processing steps to improve automatic key phrase extraction. These features\ninclude the use of signal words and freebase categories. Some of these features\nlead to significant improvements in the accuracy of the results. We also\nexperimented with 2 forms of document pre-processing that we call light\nfiltering and co-reference normalization. Light filtering removes sentences\nfrom the document, which are judged peripheral to its main content.\nCo-reference normalization unifies several written forms of the same named\nentity into a unique form. We also needed a \"Gold Standard\" - a set of labeled\ndocuments for training and evaluation. While the subjective nature of key\nphrase selection precludes a true \"Gold Standard\", we used Amazon's Mechanical\nTurk service to obtain a useful approximation. Our data indicates that the\nbiggest improvements in performance were due to shallow semantic features, news\ncategories, and rhetorical signals (nDCG 78.47% vs. 68.93%). The inclusion of\ndeeper semantic features such as Freebase sub-categories was not beneficial by\nitself, but in combination with pre-processing, did cause slight improvements\nin the nDCG scores.", "published": "2013-06-20 14:22:00", "link": "http://arxiv.org/abs/1306.4886v1", "categories": ["cs.CL", "cs.IR"], "primary_category": "cs.CL"}
{"title": "Key Phrase Extraction of Lightly Filtered Broadcast News", "abstract": "This paper explores the impact of light filtering on automatic key phrase\nextraction (AKE) applied to Broadcast News (BN). Key phrases are words and\nexpressions that best characterize the content of a document. Key phrases are\noften used to index the document or as features in further processing. This\nmakes improvements in AKE accuracy particularly important. We hypothesized that\nfiltering out marginally relevant sentences from a document would improve AKE\naccuracy. Our experiments confirmed this hypothesis. Elimination of as little\nas 10% of the document sentences lead to a 2% improvement in AKE precision and\nrecall. AKE is built over MAUI toolkit that follows a supervised learning\napproach. We trained and tested our AKE method on a gold standard made of 8 BN\nprograms containing 110 manually annotated news stories. The experiments were\nconducted within a Multimedia Monitoring Solution (MMS) system for TV and radio\nnews/programs, running daily, and monitoring 12 TV and 4 radio channels.", "published": "2013-06-20 14:35:22", "link": "http://arxiv.org/abs/1306.4890v1", "categories": ["cs.CL", "cs.IR"], "primary_category": "cs.CL"}
{"title": "Recognition of Named-Event Passages in News Articles", "abstract": "We extend the concept of Named Entities to Named Events - commonly occurring\nevents such as battles and earthquakes. We propose a method for finding\nspecific passages in news articles that contain information about such events\nand report our preliminary evaluation results. Collecting \"Gold Standard\" data\npresents many problems, both practical and conceptual. We present a method for\nobtaining such data using the Amazon Mechanical Turk service.", "published": "2013-06-20 15:22:21", "link": "http://arxiv.org/abs/1306.4908v1", "categories": ["cs.CL", "cs.IR"], "primary_category": "cs.CL"}
