{"title": "Imprecise Meanings as a Cause of Uncertainty in Medical Knowledge-Based\n  Systems", "abstract": "There has been a considerable amount of work on uncertainty in\nknowledge-based systems. This work has generally been concerned with\nuncertainty arising from the strength of inferences and the weight of evidence.\nIn this paper we discuss another type of uncertainty: that which is due to\nimprecision in the underlying primitives used to represent the knowledge of the\nsystem. In particular, a given word may denote many similar but not identical\nentities. Such words are said to be lexically imprecise. Lexical imprecision\nhas caused widespread problems in many areas. Unless this phenomenon is\nrecognized and appropriately handled, it can degrade the performance of\nknowledge-based systems. In particular, it can lead to difficulties with the\nuser interface, and with the inferencing processes of these systems. Some\ntechniques are suggested for coping with this phenomenon.", "published": "2013-03-27 19:52:35", "link": "http://arxiv.org/abs/1304.3092v1", "categories": ["cs.AI", "cs.CL"], "primary_category": "cs.AI"}
{"title": "Machine Learning, Clustering, and Polymorphy", "abstract": "This paper describes a machine induction program (WITT) that attempts to\nmodel human categorization. Properties of categories to which human subjects\nare sensitive includes best or prototypical members, relative contrasts between\nputative categories, and polymorphy (neither necessary or sufficient features).\nThis approach represents an alternative to usual Artificial Intelligence\napproaches to generalization and conceptual clustering which tend to focus on\nnecessary and sufficient feature rules, equivalence classes, and simple search\nand match schemes. WITT is shown to be more consistent with human\ncategorization while potentially including results produced by more traditional\nclustering schemes. Applications of this approach in the domains of expert\nsystems and information retrieval are also discussed.", "published": "2013-03-27 19:56:55", "link": "http://arxiv.org/abs/1304.3432v1", "categories": ["cs.AI", "cs.CL", "cs.LG"], "primary_category": "cs.AI"}
