{"title": "Improving the methods of email classification based on words ontology", "abstract": "The Internet has dramatically changed the relationship among people and their\nrelationships with others people and made the valuable information available\nfor the users. Email is the service, which the Internet provides today for its\nown users; this service has attracted most of the users' attention due to the\nlow cost. Along with the numerous benefits of Email, one of the weaknesses of\nthis service is that the number of received emails is continually being\nenhanced, thus the ways are needed to automatically filter these disturbing\nletters. Most of these filters utilize a combination of several techniques such\nas the Black or white List, using the keywords and so on in order to identify\nthe spam more accurately In this paper, we introduce a new method to classify\nthe spam. We are seeking to increase the accuracy of Email classification by\ncombining the output of several decision trees and the concept of ontology.", "published": "2013-10-22 15:35:46", "link": "http://arxiv.org/abs/1310.5963v1", "categories": ["cs.IR", "cs.CL"], "primary_category": "cs.IR"}
{"title": "The optimality of attaching unlinked labels to unlinked meanings", "abstract": "Vocabulary learning by children can be characterized by many biases. When\nencountering a new word, children as well as adults, are biased towards\nassuming that it means something totally different from the words that they\nalready know. To the best of our knowledge, the 1st mathematical proof of the\noptimality of this bias is presented here. First, it is shown that this bias is\na particular case of the maximization of mutual information between words and\nmeanings. Second, the optimality is proven within a more general information\ntheoretic framework where mutual information maximization competes with other\ninformation theoretic principles. The bias is a prediction from modern\ninformation theory. The relationship between information theoretic principles\nand the principles of contrast and mutual exclusivity is also shown.", "published": "2013-10-22 11:37:36", "link": "http://arxiv.org/abs/1310.5884v3", "categories": ["cs.CL", "physics.data-an", "physics.soc-ph"], "primary_category": "cs.CL"}
