{"title": "Domain-Specific Sentiment Word Extraction by Seed Expansion and Pattern\n  Generation", "abstract": "This paper focuses on the automatic extraction of domain-specific sentiment\nword (DSSW), which is a fundamental subtask of sentiment analysis. Most\nprevious work utilizes manual patterns for this task. However, the performance\nof those methods highly relies on the labelled patterns or selected seeds. In\norder to overcome the above problem, this paper presents an automatic framework\nto detect large-scale domain-specific patterns for DSSW extraction. To this\nend, sentiment seeds are extracted from massive dataset of user comments.\nSubsequently, these sentiment seeds are expanded by synonyms using a\nbootstrapping mechanism. Simultaneously, a synonymy graph is built and the\ngraph propagation algorithm is applied on the built synonymy graph. Afterwards,\nsyntactic and sequential relations between target words and high-ranked\nsentiment words are extracted automatically to construct large-scale patterns,\nwhich are further used to extracte DSSWs. The experimental results in three\ndomains reveal the effectiveness of our method.", "published": "2013-09-26 05:18:12", "link": "http://arxiv.org/abs/1309.6722v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Integrating Document Clustering and Topic Modeling", "abstract": "Document clustering and topic modeling are two closely related tasks which\ncan mutually benefit each other. Topic modeling can project documents into a\ntopic space which facilitates effective document clustering. Cluster labels\ndiscovered by document clustering can be incorporated into topic models to\nextract local topics specific to each cluster and global topics shared by all\nclusters. In this paper, we propose a multi-grain clustering topic model\n(MGCTM) which integrates document clustering and topic modeling into a unified\nframework and jointly performs the two tasks to achieve the overall best\nperformance. Our model tightly couples two components: a mixture component used\nfor discovering latent groups in document collection and a topic model\ncomponent used for mining multi-grain topics including local topics specific to\neach cluster and global topics shared across clusters.We employ variational\ninference to approximate the posterior of hidden variables and learn model\nparameters. Experiments on two datasets demonstrate the effectiveness of our\nmodel.", "published": "2013-09-26 12:54:02", "link": "http://arxiv.org/abs/1309.6874v1", "categories": ["cs.LG", "cs.CL", "cs.IR", "stat.ML"], "primary_category": "cs.LG"}
