{"title": "Semantic Measures for the Comparison of Units of Language, Concepts or\n  Instances from Text and Knowledge Base Analysis", "abstract": "Semantic measures are widely used today to estimate the strength of the\nsemantic relationship between elements of various types: units of language\n(e.g., words, sentences, documents), concepts or even instances semantically\ncharacterized (e.g., diseases, genes, geographical locations). Semantic\nmeasures play an important role to compare such elements according to semantic\nproxies: texts and knowledge representations, which support their meaning or\ndescribe their nature. Semantic measures are therefore essential for designing\nintelligent agents which will for example take advantage of semantic analysis\nto mimic human ability to compare abstract or concrete objects. This paper\nproposes a comprehensive survey of the broad notion of semantic measure for the\ncomparison of units of language, concepts or instances based on semantic proxy\nanalyses. Semantic measures generalize the well-known notions of semantic\nsimilarity, semantic relatedness and semantic distance, which have been\nextensively studied by various communities over the last decades (e.g.,\nCognitive Sciences, Linguistics, and Artificial Intelligence to mention a few).", "published": "2013-10-04 14:21:42", "link": "http://arxiv.org/abs/1310.1285v3", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Reading Stockholm Riots 2013 in social media by text-mining", "abstract": "The riots in Stockholm in May 2013 were an event that reverberated in the\nworld media for its dimension of violence that had spread through the Swedish\ncapital. In this study we have investigated the role of social media in\ncreating media phenomena via text mining and natural language processing. We\nhave focused on two channels of communication for our analysis: Twitter and\nPoloniainfo.se (Forum of Polish community in Sweden). Our preliminary results\nshow some hot topics driving discussion related mostly to Swedish Police and\nSwedish Politics by counting word usage. Typical features for media\nintervention are presented. We have built networks of most popular phrases,\nclustered by categories (geography, media institution, etc.). Sentiment\nanalysis shows negative connotation with Police. The aim of this preliminary\nexploratory quantitative study was to generate questions and hypotheses, which\nwe could carefully follow by deeper more qualitative methods.", "published": "2013-10-04 13:04:45", "link": "http://arxiv.org/abs/1310.1249v1", "categories": ["cs.SI", "cs.CL", "physics.soc-ph", "stat.AP"], "primary_category": "cs.SI"}
