{"title": "System and Methods for Converting Speech to SQL", "abstract": "This paper concerns with the conversion of a Spoken English Language Query\ninto SQL for retrieving data from RDBMS. A User submits a query as speech\nsignal through the user interface and gets the result of the query in the text\nformat. We have developed the acoustic and language models using which a speech\nutterance can be converted into English text query and thus natural language\nprocessing techniques can be applied on this English text query to generate an\nequivalent SQL query. For conversion of speech into English text HTK and Julius\ntools have been used and for conversion of English text query into SQL query we\nhave implemented a System which uses rule based translation to translate\nEnglish Language Query into SQL Query. The translation uses lexical analyzer,\nparser and syntax directed translation techniques like in compilers. JFLex and\nBYACC tools have been used to build lexical analyzer and parser respectively.\nSystem is domain independent i.e. system can run on different database as it\ngenerates lex files from the underlying database.", "published": "2013-08-14 12:54:31", "link": "http://arxiv.org/abs/1308.3106v1", "categories": ["cs.CL", "cs.DB"], "primary_category": "cs.CL"}
{"title": "Arabic Text Recognition in Video Sequences", "abstract": "In this paper, we propose a robust approach for text extraction and\nrecognition from Arabic news video sequence. The text included in video\nsequences is an important needful for indexing and searching system. However,\nthis text is difficult to detect and recognize because of the variability of\nits size, their low resolution characters and the complexity of the\nbackgrounds. To solve these problems, we propose a system performing in two\nmain tasks: extraction and recognition of text. Our system is tested on a\nvaried database composed of different Arabic news programs and the obtained\nresults are encouraging and show the merits of our approach.", "published": "2013-08-14 20:15:44", "link": "http://arxiv.org/abs/1308.3243v1", "categories": ["cs.MM", "cs.CL", "cs.CV"], "primary_category": "cs.MM"}
