{"title": "JRC EuroVoc Indexer JEX - A freely available multi-label categorisation\n  tool", "abstract": "EuroVoc (2012) is a highly multilingual thesaurus consisting of over 6,700\nhierarchically organised subject domains used by European Institutions and many\nauthorities in Member States of the European Union (EU) for the classification\nand retrieval of official documents. JEX is JRC-developed multi-label\nclassification software that learns from manually labelled data to\nautomatically assign EuroVoc descriptors to new documents in a profile-based\ncategory-ranking task. The JEX release consists of trained classifiers for 22\nofficial EU languages, of parallel training data in the same languages, of an\ninterface that allows viewing and amending the assignment results, and of a\nmodule that allows users to re-train the tool on their own document\ncollections. JEX allows advanced users to change the document representation so\nas to possibly improve the categorisation result through linguistic\npre-processing. JEX can be used as a tool for interactive EuroVoc descriptor\nassignment to increase speed and consistency of the human categorisation\nprocess, or it can be used fully automatically. The output of JEX is a\nlanguage-independent EuroVoc feature vector lending itself also as input to\nvarious other Language Technology tasks, including cross-lingual clustering and\nclassification, cross-lingual plagiarism detection, sentence selection and\nranking, and more.", "published": "2013-09-20 09:51:59", "link": "http://arxiv.org/abs/1309.5223v1", "categories": ["cs.CL", "H.3.1; H.3.6"], "primary_category": "cs.CL"}
{"title": "DGT-TM: A freely Available Translation Memory in 22 Languages", "abstract": "The European Commission's (EC) Directorate General for Translation, together\nwith the EC's Joint Research Centre, is making available a large translation\nmemory (TM; i.e. sentences and their professionally produced translations)\ncovering twenty-two official European Union (EU) languages and their 231\nlanguage pairs. Such a resource is typically used by translation professionals\nin combination with TM software to improve speed and consistency of their\ntranslations. However, this resource has also many uses for translation studies\nand for language technology applications, including Statistical Machine\nTranslation (SMT), terminology extraction, Named Entity Recognition (NER),\nmultilingual classification and clustering, and many more. In this reference\npaper for DGT-TM, we introduce this new resource, provide statistics regarding\nits size, and explain how it was produced and how to use it.", "published": "2013-09-20 10:02:58", "link": "http://arxiv.org/abs/1309.5226v1", "categories": ["cs.CL", "I.2.7"], "primary_category": "cs.CL"}
{"title": "An introduction to the Europe Media Monitor family of applications", "abstract": "Most large organizations have dedicated departments that monitor the media to\nkeep up-to-date with relevant developments and to keep an eye on how they are\nrepresented in the news. Part of this media monitoring work can be automated.\nIn the European Union with its 23 official languages, it is particularly\nimportant to cover media reports in many languages in order to capture the\ncomplementary news content published in the different countries. It is also\nimportant to be able to access the news content across languages and to merge\nthe extracted information. We present here the four publicly accessible systems\nof the Europe Media Monitor (EMM) family of applications, which cover between\n19 and 50 languages (see http://press.jrc.it/overview.html). We give an\noverview of their functionality and discuss some of the implications of the\nfact that they cover quite so many languages. We discuss design issues\nnecessary to be able to achieve this high multilinguality, as well as the\nbenefits of this multilinguality.", "published": "2013-09-20 15:03:58", "link": "http://arxiv.org/abs/1309.5290v1", "categories": ["cs.CL", "H.3.1; H.3.3; I.2.7"], "primary_category": "cs.CL"}
{"title": "Even the Abstract have Colour: Consensus in Word-Colour Associations", "abstract": "Colour is a key component in the successful dissemination of information.\nSince many real-world concepts are associated with colour, for example danger\nwith red, linguistic information is often complemented with the use of\nappropriate colours in information visualization and product marketing. Yet,\nthere is no comprehensive resource that captures concept-colour associations.\nWe present a method to create a large word-colour association lexicon by\ncrowdsourcing. A word-choice question was used to obtain sense-level\nannotations and to ensure data quality. We focus especially on abstract\nconcepts and emotions to show that even they tend to have strong colour\nassociations. Thus, using the right colours can not only improve semantic\ncoherence, but also inspire the desired emotional response.", "published": "2013-09-20 21:06:46", "link": "http://arxiv.org/abs/1309.5391v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Colourful Language: Measuring Word-Colour Associations", "abstract": "Since many real-world concepts are associated with colour, for example danger\nwith red, linguistic information is often complimented with the use of\nappropriate colours in information visualization and product marketing. Yet,\nthere is no comprehensive resource that captures concept-colour associations.\nWe present a method to create a large word-colour association lexicon by\ncrowdsourcing. We focus especially on abstract concepts and emotions to show\nthat even though they cannot be physically visualized, they too tend to have\nstrong colour associations. Finally, we show how word-colour associations\nmanifest themselves in language, and quantify usefulness of co-occurrence and\npolarity cues in automatically detecting colour associations.", "published": "2013-09-20 21:10:56", "link": "http://arxiv.org/abs/1309.5942v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Saying What You're Looking For: Linguistics Meets Video Search", "abstract": "We present an approach to searching large video corpora for video clips which\ndepict a natural-language query in the form of a sentence. This approach uses\ncompositional semantics to encode subtle meaning that is lost in other systems,\nsuch as the difference between two sentences which have identical words but\nentirely different meaning: \"The person rode the horse} vs. \\emph{The horse\nrode the person\". Given a video-sentence pair and a natural-language parser,\nalong with a grammar that describes the space of sentential queries, we produce\na score which indicates how well the video depicts the sentence. We produce\nsuch a score for each video clip in a corpus and return a ranked list of clips.\nFurthermore, this approach addresses two fundamental problems simultaneously:\ndetecting and tracking objects, and recognizing whether those tracks depict the\nquery. Because both tracking and object detection are unreliable, this uses\nknowledge about the intended sentential query to focus the tracker on the\nrelevant participants and ensures that the resulting tracks are described by\nthe sentential query. While earlier work was limited to single-word queries\nwhich correspond to either verbs or nouns, we show how one can search for\ncomplex queries which contain multiple phrases, such as prepositional phrases,\nand modifiers, such as adverbs. We demonstrate this approach by searching for\n141 queries involving people and horses interacting with each other in 10\nfull-length Hollywood movies.", "published": "2013-09-20 05:07:29", "link": "http://arxiv.org/abs/1309.5174v1", "categories": ["cs.CV", "cs.CL", "cs.IR"], "primary_category": "cs.CV"}
{"title": "Recognizing Speech in a Novel Accent: The Motor Theory of Speech\n  Perception Reframed", "abstract": "The motor theory of speech perception holds that we perceive the speech of\nanother in terms of a motor representation of that speech. However, when we\nhave learned to recognize a foreign accent, it seems plausible that recognition\nof a word rarely involves reconstruction of the speech gestures of the speaker\nrather than the listener. To better assess the motor theory and this\nobservation, we proceed in three stages. Part 1 places the motor theory of\nspeech perception in a larger framework based on our earlier models of the\nadaptive formation of mirror neurons for grasping, and for viewing extensions\nof that mirror system as part of a larger system for neuro-linguistic\nprocessing, augmented by the present consideration of recognizing speech in a\nnovel accent. Part 2 then offers a novel computational model of how a listener\ncomes to understand the speech of someone speaking the listener's native\nlanguage with a foreign accent. The core tenet of the model is that the\nlistener uses hypotheses about the word the speaker is currently uttering to\nupdate probabilities linking the sound produced by the speaker to phonemes in\nthe native language repertoire of the listener. This, on average, improves the\nrecognition of later words. This model is neutral regarding the nature of the\nrepresentations it uses (motor vs. auditory). It serve as a reference point for\nthe discussion in Part 3, which proposes a dual-stream neuro-linguistic\narchitecture to revisits claims for and against the motor theory of speech\nperception and the relevance of mirror neurons, and extracts some implications\nfor the reframing of the motor theory.", "published": "2013-09-20 16:47:48", "link": "http://arxiv.org/abs/1309.5319v1", "categories": ["cs.CL", "cs.LG", "q-bio.NC"], "primary_category": "cs.CL"}
