{"title": "A probabilistic framework for analysing the compositionality of\n  conceptual combinations", "abstract": "Conceptual combination performs a fundamental role in creating the broad\nrange of compound phrases utilized in everyday language. This article provides\na novel probabilistic framework for assessing whether the semantics of\nconceptual combinations are compositional, and so can be considered as a\nfunction of the semantics of the constituent concepts, or not. While the\nsystematicity and productivity of language provide a strong argument in favor\nof assuming compositionality, this very assumption is still regularly\nquestioned in both cognitive science and philosophy. Additionally, the\nprinciple of semantic compositionality is underspecified, which means that\nnotions of both \"strong\" and \"weak\" compositionality appear in the literature.\nRather than adjudicating between different grades of compositionality, the\nframework presented here contributes formal methods for determining a clear\ndividing line between compositional and non-compositional semantics. In\naddition, we suggest that the distinction between these is contextually\nsensitive. Utilizing formal frameworks developed for analyzing composite\nsystems in quantum theory, we present two methods that allow the semantics of\nconceptual combinations to be classified as \"compositional\" or\n\"non-compositional\". Compositionality is first formalised by factorising the\njoint probability distribution modeling the combination, where the terms in the\nfactorisation correspond to individual concepts. This leads to the necessary\nand sufficient condition for the joint probability distribution to exist. A\nfailure to meet this condition implies that the underlying concepts cannot be\nmodeled in a single probability space when considering their combination, and\nthe combination is thus deemed \"non-compositional\". The formal analysis methods\nare demonstrated by applying them to an empirical study of twenty-four\nnon-lexicalised conceptual combinations.", "published": "2013-05-23 03:14:50", "link": "http://arxiv.org/abs/1305.5753v3", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "The most controversial topics in Wikipedia: A multilingual and\n  geographical analysis", "abstract": "We present, visualize and analyse the similarities and differences between\nthe controversial topics related to \"edit wars\" identified in 10 different\nlanguage versions of Wikipedia. After a brief review of the related work we\ndescribe the methods developed to locate, measure, and categorize the\ncontroversial topics in the different languages. Visualizations of the degree\nof overlap between the top 100 lists of most controversial articles in\ndifferent languages and the content related to geographical locations will be\npresented. We discuss what the presented analysis and visualizations can tell\nus about the multicultural aspects of Wikipedia and practices of\npeer-production. Our results indicate that Wikipedia is more than just an\nencyclopaedia; it is also a window into convergent and divergent social-spatial\npriorities, interests and preferences.", "published": "2013-05-23 21:09:51", "link": "http://arxiv.org/abs/1305.5566v2", "categories": ["physics.soc-ph", "cs.CL", "cs.DL", "cs.SI", "physics.data-an"], "primary_category": "physics.soc-ph"}
