{"title": "Extracting Connected Concepts from Biomedical Texts using Fog Index", "abstract": "In this paper, we establish Fog Index (FI) as a text filter to locate the\nsentences in texts that contain connected biomedical concepts of interest. To\ndo so, we have used 24 random papers each containing four pairs of connected\nconcepts. For each pair, we categorize sentences based on whether they contain\nboth, any or none of the concepts. We then use FI to measure difficulty of the\nsentences of each category and find that sentences containing both of the\nconcepts have low readability. We rank sentences of a text according to their\nFI and select 30 percent of the most difficult sentences. We use an association\nmatrix to track the most frequent pairs of concepts in them. This matrix\nreports that the first filter produces some pairs that hold almost no\nconnections. To remove these unwanted pairs, we use the Equally Weighted\nHarmonic Mean of their Positive Predictive Value (PPV) and Sensitivity as a\nsecond filter. Experimental results demonstrate the effectiveness of our\nmethod.", "published": "2013-07-30 17:27:29", "link": "http://arxiv.org/abs/1307.8057v1", "categories": ["cs.CL", "cs.IR"], "primary_category": "cs.CL"}
{"title": "Extracting Information-rich Part of Texts using Text Denoising", "abstract": "The aim of this paper is to report on a novel text reduction technique,\ncalled Text Denoising, that highlights information-rich content when processing\na large volume of text data, especially from the biomedical domain. The core\nfeature of the technique, the text readability index, embodies the hypothesis\nthat complex text is more information-rich than the rest. When applied on tasks\nlike biomedical relation bearing text extraction, keyphrase indexing and\nextracting sentences describing protein interactions, it is evident that the\nreduced set of text produced by text denoising is more information-rich than\nthe rest.", "published": "2013-07-30 17:36:53", "link": "http://arxiv.org/abs/1307.8060v1", "categories": ["cs.IR", "cs.CL"], "primary_category": "cs.IR"}
{"title": "Connecting Language and Knowledge Bases with Embedding Models for\n  Relation Extraction", "abstract": "This paper proposes a novel approach for relation extraction from free text\nwhich is trained to jointly use information from the text and from existing\nknowledge. Our model is based on two scoring functions that operate by learning\nlow-dimensional embeddings of words and of entities and relationships from a\nknowledge base. We empirically show on New York Times articles aligned with\nFreebase relations that our approach is able to efficiently use the extra\ninformation provided by a large subset of Freebase data (4M entities, 23k\nrelationships) to improve over existing methods that rely on text features\nalone.", "published": "2013-07-30 13:37:09", "link": "http://arxiv.org/abs/1307.7973v1", "categories": ["cs.CL", "cs.IR", "cs.LG"], "primary_category": "cs.CL"}
