{"title": "Development and Transcription of Assamese Speech Corpus", "abstract": "A balanced speech corpus is the basic need for any speech processing task. In\nthis report we describe our effort on development of Assamese speech corpus. We\nmainly focused on some issues and challenges faced during development of the\ncorpus. Being a less computationally aware language, this is the first effort\nto develop speech corpus for Assamese. As corpus development is an ongoing\nprocess, in this paper we report only the initial task.", "published": "2013-09-27 17:54:14", "link": "http://arxiv.org/abs/1309.7312v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Evaluating the Usefulness of Sentiment Information for Focused Crawlers", "abstract": "Despite the prevalence of sentiment-related content on the Web, there has\nbeen limited work on focused crawlers capable of effectively collecting such\ncontent. In this study, we evaluated the efficacy of using sentiment-related\ninformation for enhanced focused crawling of opinion-rich web content regarding\na particular topic. We also assessed the impact of using sentiment-labeled web\ngraphs to further improve collection accuracy. Experimental results on a large\ntest bed encompassing over half a million web pages revealed that focused\ncrawlers utilizing sentiment information as well as sentiment-labeled web\ngraphs are capable of gathering more holistic collections of opinion-related\ncontent regarding a particular topic. The results have important implications\nfor business and marketing intelligence gathering efforts in the Web 2.0 era.", "published": "2013-09-27 15:14:34", "link": "http://arxiv.org/abs/1309.7270v1", "categories": ["cs.IR", "cs.CL"], "primary_category": "cs.IR"}
{"title": "Early Stage Influenza Detection from Twitter", "abstract": "Influenza is an acute respiratory illness that occurs virtually every year\nand results in substantial disease, death and expense. Detection of Influenza\nin its earliest stage would facilitate timely action that could reduce the\nspread of the illness. Existing systems such as CDC and EISS which try to\ncollect diagnosis data, are almost entirely manual, resulting in about two-week\ndelays for clinical data acquisition. Twitter, a popular microblogging service,\nprovides us with a perfect source for early-stage flu detection due to its\nreal- time nature. For example, when a flu breaks out, people that get the flu\nmay post related tweets which enables the detection of the flu breakout\npromptly. In this paper, we investigate the real-time flu detection problem on\nTwitter data by proposing Flu Markov Network (Flu-MN): a spatio-temporal\nunsupervised Bayesian algorithm based on a 4 phase Markov Network, trying to\nidentify the flu breakout at the earliest stage. We test our model on real\nTwitter datasets from the United States along with baselines in multiple\napplications, such as real-time flu breakout detection, future epidemic phase\nprediction, or Influenza-like illness (ILI) physician visits. Experimental\nresults show the robustness and effectiveness of our approach. We build up a\nreal time flu reporting system based on the proposed approach, and we are\nhopeful that it would help government or health organizations in identifying\nflu outbreaks and facilitating timely actions to decrease unnecessary\nmortality.", "published": "2013-09-27 19:47:11", "link": "http://arxiv.org/abs/1309.7340v3", "categories": ["cs.SI", "cs.CL"], "primary_category": "cs.SI"}
