{"title": "Towards Structural Natural Language Formalization: Mapping Discourse to\n  Controlled Natural Language", "abstract": "The author describes a conceptual study towards mapping grounded natural\nlanguage discourse representation structures to instances of controlled\nlanguage statements. This can be achieved via a pipeline of preexisting state\nof the art technologies, namely natural language syntax to semantic discourse\nmapping, and a reduction of the latter to controlled language discourse, given\na set of previously learnt reduction rules. Concludingly a description on\nevaluation, potential and limitations for ontology-based reasoning is\npresented.", "published": "2013-12-07 11:19:20", "link": "http://arxiv.org/abs/1312.2087v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "End-to-end Phoneme Sequence Recognition using Convolutional Neural\n  Networks", "abstract": "Most phoneme recognition state-of-the-art systems rely on a classical neural\nnetwork classifiers, fed with highly tuned features, such as MFCC or PLP\nfeatures. Recent advances in ``deep learning'' approaches questioned such\nsystems, but while some attempts were made with simpler features such as\nspectrograms, state-of-the-art systems still rely on MFCCs. This might be\nviewed as a kind of failure from deep learning approaches, which are often\nclaimed to have the ability to train with raw signals, alleviating the need of\nhand-crafted features. In this paper, we investigate a convolutional neural\nnetwork approach for raw speech signals. While convolutional architectures got\ntremendous success in computer vision or text processing, they seem to have\nbeen let down in the past recent years in the speech processing field. We show\nthat it is possible to learn an end-to-end phoneme sequence classifier system\ndirectly from raw signal, with similar performance on the TIMIT and WSJ\ndatasets than existing systems based on MFCC, questioning the need of complex\nhand-crafted features on large datasets.", "published": "2013-12-07 19:55:02", "link": "http://arxiv.org/abs/1312.2137v1", "categories": ["cs.LG", "cs.CL", "cs.NE"], "primary_category": "cs.LG"}
