{"title": "Building of Networks of Natural Hierarchies of Terms Based on Analysis\n  of Texts Corpora", "abstract": "The technique of building of networks of hierarchies of terms based on the\nanalysis of chosen text corpora is offered. The technique is based on the\nmethodology of horizontal visibility graphs. Constructed and investigated\nlanguage network, formed on the basis of electronic preprints arXiv on topics\nof information retrieval.", "published": "2014-05-23 14:05:45", "link": "http://arxiv.org/abs/1405.6068v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Evaluating the fully automatic multi-language translation of the Swiss\n  avalanche bulletin", "abstract": "The Swiss avalanche bulletin is produced twice a day in four languages. Due\nto the lack of time available for manual translation, a fully automated\ntranslation system is employed, based on a catalogue of predefined phrases and\npredetermined rules of how these phrases can be combined to produce sentences.\nThe system is able to automatically translate such sentences from German into\nthe target languages French, Italian and English without subsequent\nproofreading or correction. Our catalogue of phrases is limited to a small\nsublanguage. The reduction of daily translation costs is expected to offset the\ninitial development costs within a few years. After being operational for two\nwinter seasons, we assess here the quality of the produced texts based on an\nevaluation where participants rate real danger descriptions from both origins,\nthe catalogue of phrases versus the manually written and translated texts. With\na mean recognition rate of 55%, users can hardly distinguish between the two\ntypes of texts, and give similar ratings with respect to their language\nquality. Overall, the output from the catalogue system can be considered\nvirtually equivalent to a text written by avalanche forecasters and then\nmanually translated by professional translators. Furthermore, forecasters\ndeclared that all relevant situations were captured by the system with\nsufficient accuracy and within the limited time available.", "published": "2014-05-23 15:51:10", "link": "http://arxiv.org/abs/1405.6103v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
