{"title": "An Expert System for Automatic Reading of A Text Written in Standard\n  Arabic", "abstract": "In this work we present our expert system of Automatic reading or speech\nsynthesis based on a text written in Standard Arabic, our work is carried out\nin two great stages: the creation of the sound data base, and the\ntransformation of the written text into speech (Text To Speech TTS). This\ntransformation is done firstly by a Phonetic Orthographical Transcription (POT)\nof any written Standard Arabic text with the aim of transforming it into his\ncorresponding phonetics sequence, and secondly by the generation of the voice\nsignal which corresponds to the chain transcribed. We spread out the different\nof conception of the system, as well as the results obtained compared to others\nworks studied to realize TTS based on Standard Arabic.", "published": "2014-05-08 13:47:36", "link": "http://arxiv.org/abs/1405.1924v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Initial Comparison of Linguistic Networks Measures for Parallel Texts", "abstract": "This paper presents preliminary results of Croatian syllable networks\nanalysis. Syllable network is a network in which nodes are syllables and links\nbetween them are constructed according to their connections within words. In\nthis paper we analyze networks of syllables generated from texts collected from\nthe Croatian Wikipedia and Blogs. As a main tool we use complex network\nanalysis methods which provide mechanisms that can reveal new patterns in a\nlanguage structure. We aim to show that syllable networks have much higher\nclustering coefficient in comparison to Erd\\\"os-Renyi random networks. The\nresults indicate that Croatian syllable networks exhibit certain properties of\na small world networks. Furthermore, we compared Croatian syllable networks\nwith Portuguese and Chinese syllable networks and we showed that they have\nsimilar properties.", "published": "2014-05-08 11:47:03", "link": "http://arxiv.org/abs/1405.1893v2", "categories": ["cs.CL", "cs.SI", "physics.soc-ph"], "primary_category": "cs.CL"}
