{"title": "It's distributions all the way down!: Second order changes in\n  statistical distributions also occur", "abstract": "The textual, big-data literature misses Bentley, OBrien, & Brocks (Bentley et\nals) message on distributions; it largely examines the first-order effects of\nhow a single, signature distribution can predict population behaviour,\nneglecting second-order effects involving distributional shifts, either between\nsignature distributions or within a given signature distribution. Indeed,\nBentley et al. themselves under-emphasise the potential richness of the latter,\nwithin-distribution effects.", "published": "2014-02-27 12:12:11", "link": "http://arxiv.org/abs/1402.6880v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "A method to identify potential ambiguous Malay words through Ambiguity\n  Attributes mapping: An exploratory Study", "abstract": "We describe here a methodology to identify a list of ambiguous Malay words\nthat are commonly being used in Malay documentations such as Requirement\nSpecification. We compiled several relevant and appropriate requirement quality\nattributes and sentence rules from previous literatures and adopt it to come\nout with a set of ambiguity attributes that most suit Malay words. The\nextracted Malay ambiguous words (potential) are then being mapped onto the\nconstructed ambiguity attributes to confirm their vagueness. The list is then\nverified by Malay linguist experts. This paper aims to identify a list of\npotential ambiguous words in Malay as an attempt to assist writers to avoid\nusing the vague words while documenting Malay Requirement Specification as well\nas to any other related Malay documentation. The result of this study is a list\nof 120 potential ambiguous Malay words that could act as guidelines in writing\nMalay sentences", "published": "2014-02-27 01:47:46", "link": "http://arxiv.org/abs/1402.6764v1", "categories": ["cs.SE", "cs.CL"], "primary_category": "cs.SE"}
{"title": "Information Evolution in Social Networks", "abstract": "Social networks readily transmit information, albeit with less than perfect\nfidelity. We present a large-scale measurement of this imperfect information\ncopying mechanism by examining the dissemination and evolution of thousands of\nmemes, collectively replicated hundreds of millions of times in the online\nsocial network Facebook. The information undergoes an evolutionary process that\nexhibits several regularities. A meme's mutation rate characterizes the\npopulation distribution of its variants, in accordance with the Yule process.\nVariants further apart in the diffusion cascade have greater edit distance, as\nwould be expected in an iterative, imperfect replication process. Some text\nsequences can confer a replicative advantage; these sequences are abundant and\ntransfer \"laterally\" between different memes. Subpopulations of the social\nnetwork can preferentially transmit a specific variant of a meme if the variant\nmatches their beliefs or culture. Understanding the mechanism driving change in\ndiffusing information has important implications for how we interpret and\nharness the information that reaches us through our social networks.", "published": "2014-02-27 05:16:27", "link": "http://arxiv.org/abs/1402.6792v1", "categories": ["cs.SI", "cs.CL", "physics.soc-ph"], "primary_category": "cs.SI"}
