{"title": "Detecting Structural Irregularity in Electronic Dictionaries Using\n  Language Modeling", "abstract": "Dictionaries are often developed using tools that save to Extensible Markup\nLanguage (XML)-based standards. These standards often allow high-level\nrepeating elements to represent lexical entries, and utilize descendants of\nthese repeating elements to represent the structure within each lexical entry,\nin the form of an XML tree. In many cases, dictionaries are published that have\nerrors and inconsistencies that are expensive to find manually. This paper\ndiscusses a method for dictionary writers to quickly audit structural\nregularity across entries in a dictionary by using statistical language\nmodeling. The approach learns the patterns of XML nodes that could occur within\nan XML tree, and then calculates the probability of each XML tree in the\ndictionary against these patterns to look for entries that diverge from the\nnorm.", "published": "2014-10-29 20:07:21", "link": "http://arxiv.org/abs/1410.8149v1", "categories": ["cs.CL", "cs.LG", "I.2.7; I.2.6; I.5.1; I.5.4"], "primary_category": "cs.CL"}
{"title": "A Semantic Web of Know-How: Linked Data for Community-Centric Tasks", "abstract": "This paper proposes a novel framework for representing community know-how on\nthe Semantic Web. Procedural knowledge generated by web communities typically\ntakes the form of natural language instructions or videos and is largely\nunstructured. The absence of semantic structure impedes the deployment of many\nuseful applications, in particular the ability to discover and integrate\nknow-how automatically. We discuss the characteristics of community know-how\nand argue that existing knowledge representation frameworks fail to represent\nit adequately. We present a novel framework for representing the semantic\nstructure of community know-how and demonstrate the feasibility of our approach\nby providing a concrete implementation which includes a method for\nautomatically acquiring procedural knowledge for real-world tasks.", "published": "2014-10-29 15:48:40", "link": "http://arxiv.org/abs/1410.8808v1", "categories": ["cs.AI", "cs.CL"], "primary_category": "cs.AI"}
{"title": "Towards a Visual Turing Challenge", "abstract": "As language and visual understanding by machines progresses rapidly, we are\nobserving an increasing interest in holistic architectures that tightly\ninterlink both modalities in a joint learning and inference process. This trend\nhas allowed the community to progress towards more challenging and open tasks\nand refueled the hope at achieving the old AI dream of building machines that\ncould pass a turing test in open domains. In order to steadily make progress\ntowards this goal, we realize that quantifying performance becomes increasingly\ndifficult. Therefore we ask how we can precisely define such challenges and how\nwe can evaluate different algorithms on this open tasks? In this paper, we\nsummarize and discuss such challenges as well as try to give answers where\nappropriate options are available in the literature. We exemplify some of the\nsolutions on a recently presented dataset of question-answering task based on\nreal-world indoor images that establishes a visual turing challenge. Finally,\nwe argue despite the success of unique ground-truth annotation, we likely have\nto step away from carefully curated dataset and rather rely on 'social\nconsensus' as the main driving force to create suitable benchmarks. Providing\ncoverage in this inherently ambiguous output space is an emerging challenge\nthat we face in order to make quantifiable progress in this area.", "published": "2014-10-29 15:38:29", "link": "http://arxiv.org/abs/1410.8027v3", "categories": ["cs.AI", "cs.CL", "cs.CV", "cs.LG"], "primary_category": "cs.AI"}
