{"title": "Analyzing the Language of Food on Social Media", "abstract": "We investigate the predictive power behind the language of food on social\nmedia. We collect a corpus of over three million food-related posts from\nTwitter and demonstrate that many latent population characteristics can be\ndirectly predicted from this data: overweight rate, diabetes rate, political\nleaning, and home geographical location of authors. For all tasks, our\nlanguage-based models significantly outperform the majority-class baselines.\nPerformance is further improved with more complex natural language processing,\nsuch as topic modeling. We analyze which textual features have most predictive\npower for these datasets, providing insight into the connections between the\nlanguage of food, geographic locale, and community characteristics. Lastly, we\ndesign and implement an online system for real-time query and visualization of\nthe dataset. Visualization tools, such as geo-referenced heatmaps,\nsemantics-preserving wordclouds and temporal histograms, allow us to discover\nmore complex, global patterns mirrored in the language of food.", "published": "2014-09-08 03:07:54", "link": "http://arxiv.org/abs/1409.2195v2", "categories": ["cs.CL", "cs.CY", "cs.SI"], "primary_category": "cs.CL"}
{"title": "Approximating solution structure of the Weighted Sentence Alignment\n  problem", "abstract": "We study the complexity of approximating solution structure of the bijective\nweighted sentence alignment problem of DeNero and Klein (2008). In particular,\nwe consider the complexity of finding an alignment that has a significant\noverlap with an optimal alignment. We discuss ways of representing the solution\nfor the general weighted sentence alignment as well as phrases-to-words\nalignment problem, and show that computing a string which agrees with the\noptimal sentence partition on more than half (plus an arbitrarily small\npolynomial fraction) positions for the phrases-to-words alignment is NP-hard.\nFor the general weighted sentence alignment we obtain such bound from the\nagreement on a little over 2/3 of the bits. Additionally, we generalize the\nHamming distance approximation of a solution structure to approximating it with\nrespect to the edit distance metric, obtaining similar lower bounds.", "published": "2014-09-08 17:19:11", "link": "http://arxiv.org/abs/1409.2433v1", "categories": ["cs.CL", "cs.CC", "cs.DS"], "primary_category": "cs.CL"}
{"title": "Exploiting Social Network Structure for Person-to-Person Sentiment\n  Analysis", "abstract": "Person-to-person evaluations are prevalent in all kinds of discourse and\nimportant for establishing reputations, building social bonds, and shaping\npublic opinion. Such evaluations can be analyzed separately using signed social\nnetworks and textual sentiment analysis, but this misses the rich interactions\nbetween language and social context. To capture such interactions, we develop a\nmodel that predicts individual A's opinion of individual B by synthesizing\ninformation from the signed social network in which A and B are embedded with\nsentiment analysis of the evaluative texts relating A to B. We prove that this\nproblem is NP-hard but can be relaxed to an efficiently solvable hinge-loss\nMarkov random field, and we show that this implementation outperforms text-only\nand network-only versions in two very different datasets involving\ncommunity-level decision-making: the Wikipedia Requests for Adminship corpus\nand the Convote U.S. Congressional speech corpus.", "published": "2014-09-08 18:14:16", "link": "http://arxiv.org/abs/1409.2450v1", "categories": ["cs.SI", "cs.CL", "physics.soc-ph"], "primary_category": "cs.SI"}
