{"title": "word2vec Parameter Learning Explained", "abstract": "The word2vec model and application by Mikolov et al. have attracted a great\namount of attention in recent two years. The vector representations of words\nlearned by word2vec models have been shown to carry semantic meanings and are\nuseful in various NLP tasks. As an increasing number of researchers would like\nto experiment with word2vec or similar techniques, I notice that there lacks a\nmaterial that comprehensively explains the parameter learning process of word\nembedding models in details, thus preventing researchers that are non-experts\nin neural networks from understanding the working mechanism of such models.\n  This note provides detailed derivations and explanations of the parameter\nupdate equations of the word2vec models, including the original continuous\nbag-of-word (CBOW) and skip-gram (SG) models, as well as advanced optimization\ntechniques, including hierarchical softmax and negative sampling. Intuitive\ninterpretations of the gradient equations are also provided alongside\nmathematical derivations.\n  In the appendix, a review on the basics of neuron networks and\nbackpropagation is provided. I also created an interactive demo, wevi, to\nfacilitate the intuitive understanding of the model.", "published": "2014-11-11 09:24:00", "link": "http://arxiv.org/abs/1411.2738v4", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "The Bayesian Echo Chamber: Modeling Social Influence via Linguistic\n  Accommodation", "abstract": "We present the Bayesian Echo Chamber, a new Bayesian generative model for\nsocial interaction data. By modeling the evolution of people's language usage\nover time, this model discovers latent influence relationships between them.\nUnlike previous work on inferring influence, which has primarily focused on\nsimple temporal dynamics evidenced via turn-taking behavior, our model captures\nmore nuanced influence relationships, evidenced via linguistic accommodation\npatterns in interaction content. The model, which is based on a discrete analog\nof the multivariate Hawkes process, permits a fully Bayesian inference\nalgorithm. We validate our model's ability to discover latent influence\npatterns using transcripts of arguments heard by the US Supreme Court and the\nmovie \"12 Angry Men.\" We showcase our model's capabilities by using it to infer\nlatent influence patterns from Federal Open Market Committee meeting\ntranscripts, demonstrating state-of-the-art performance at uncovering social\ndynamics in group discussions.", "published": "2014-11-11 01:02:20", "link": "http://arxiv.org/abs/1411.2674v3", "categories": ["stat.ML", "cs.CL", "cs.LG", "cs.SI"], "primary_category": "stat.ML"}
{"title": "Inferring User Preferences by Probabilistic Logical Reasoning over\n  Social Networks", "abstract": "We propose a framework for inferring the latent attitudes or preferences of\nusers by performing probabilistic first-order logical reasoning over the social\nnetwork graph. Our method answers questions about Twitter users like {\\em Does\nthis user like sushi?} or {\\em Is this user a New York Knicks fan?} by building\na probabilistic model that reasons over user attributes (the user's location or\ngender) and the social network (the user's friends and spouse), via inferences\nlike homophily (I am more likely to like sushi if spouse or friends like sushi,\nI am more likely to like the Knicks if I live in New York). The algorithm uses\ndistant supervision, semi-supervised data harvesting and vector space models to\nextract user attributes (e.g. spouse, education, location) and preferences\n(likes and dislikes) from text. The extracted propositions are then fed into a\nprobabilistic reasoner (we investigate both Markov Logic and Probabilistic Soft\nLogic). Our experiments show that probabilistic logical reasoning significantly\nimproves the performance on attribute and relation extraction, and also\nachieves an F-score of 0.791 at predicting a users likes or dislikes,\nsignificantly better than two strong baselines.", "published": "2014-11-11 01:53:21", "link": "http://arxiv.org/abs/1411.2679v1", "categories": ["cs.SI", "cs.AI", "cs.CL", "cs.LG"], "primary_category": "cs.SI"}
