{"title": "Jabalin: a Comprehensive Computational Model of Modern Standard Arabic\n  Verbal Morphology Based on Traditional Arabic Prosody", "abstract": "The computational handling of Modern Standard Arabic is a challenge in the\nfield of natural language processing due to its highly rich morphology.\nHowever, several authors have pointed out that the Arabic morphological system\nis in fact extremely regular. The existing Arabic morphological analyzers have\nexploited this regularity to variable extent, yet we believe there is still\nsome scope for improvement. Taking inspiration in traditional Arabic prosody,\nwe have designed and implemented a compact and simple morphological system\nwhich in our opinion takes further advantage of the regularities encountered in\nthe Arabic morphological system. The output of the system is a large-scale\nlexicon of inflected forms that has subsequently been used to create an Online\nInterface for a morphological analyzer of Arabic verbs. The Jabalin Online\nInterface is available at http://elvira.lllf.uam.es/jabalin/, hosted at the\nLLI-UAM lab. The generation system is also available under a GNU GPL 3 license.", "published": "2014-06-29 10:08:54", "link": "http://arxiv.org/abs/1406.7483v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Human Communication Systems Evolve by Cultural Selection", "abstract": "Human communication systems, such as language, evolve culturally; their\ncomponents undergo reproduction and variation. However, a role for selection in\ncultural evolutionary dynamics is less clear. Often neutral evolution (also\nknown as 'drift') models, are used to explain the evolution of human\ncommunication systems, and cultural evolution more generally. Under this\naccount, cultural change is unbiased: for instance, vocabulary, baby names and\npottery designs have been found to spread through random copying.\n  While drift is the null hypothesis for models of cultural evolution it does\nnot always adequately explain empirical results. Alternative models include\ncultural selection, which assumes variant adoption is biased. Theoretical\nmodels of human communication argue that during conversation interlocutors are\nbiased to adopt the same labels and other aspects of linguistic representation\n(including prosody and syntax). This basic alignment mechanism has been\nextended by computer simulation to account for the emergence of linguistic\nconventions. When agents are biased to match the linguistic behavior of their\ninterlocutor, a single variant can propagate across an entire population of\ninteracting computer agents. This behavior-matching account operates at the\nlevel of the individual. We call it the Conformity-biased model. Under a\ndifferent selection account, called content-biased selection, functional\nselection or replicator selection, variant adoption depends upon the intrinsic\nvalue of the particular variant (e.g., ease of learning or use). This second\nalternative account operates at the level of the cultural variant. Following\nBoyd and Richerson we call it the Content-biased model. The present paper tests\nthe drift model and the two biased selection models' ability to explain the\nspread of communicative signal variants in an experimental micro-society.", "published": "2014-06-29 20:16:55", "link": "http://arxiv.org/abs/1406.7558v1", "categories": ["cs.SI", "cs.CL", "physics.soc-ph"], "primary_category": "cs.SI"}
