{"title": "Lexical Normalisation of Twitter Data", "abstract": "Twitter with over 500 million users globally, generates over 100,000 tweets\nper minute . The 140 character limit per tweet, perhaps unintentionally,\nencourages users to use shorthand notations and to strip spellings to their\nbare minimum \"syllables\" or elisions e.g. \"srsly\". The analysis of twitter\nmessages which typically contain misspellings, elisions, and grammatical\nerrors, poses a challenge to established Natural Language Processing (NLP)\ntools which are generally designed with the assumption that the data conforms\nto the basic grammatical structure commonly used in English language. In order\nto make sense of Twitter messages it is necessary to first transform them into\na canonical form, consistent with the dictionary or grammar. This process,\nperformed at the level of individual tokens (\"words\"), is called lexical\nnormalisation. This paper investigates various techniques for lexical\nnormalisation of Twitter data and presents the findings as the techniques are\napplied to process raw data from Twitter.", "published": "2014-09-16 12:59:07", "link": "http://arxiv.org/abs/1409.4614v4", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Voting for Deceptive Opinion Spam Detection", "abstract": "Consumers' purchase decisions are increasingly influenced by user-generated\nonline reviews. Accordingly, there has been growing concern about the potential\nfor posting deceptive opinion spam fictitious reviews that have been\ndeliberately written to sound authentic, to deceive the readers. Existing\napproaches mainly focus on developing automatic supervised learning based\nmethods to help users identify deceptive opinion spams.\n  This work, we used the LSI and Sprinkled LSI technique to reduce the\ndimension for deception detection. We make our contribution to demonstrate what\nLSI is capturing in latent semantic space and reveal how deceptive opinions can\nbe recognized automatically from truthful opinions. Finally, we proposed a\nvoting scheme which integrates different approaches to further improve the\nclassification performance.", "published": "2014-09-16 05:12:50", "link": "http://arxiv.org/abs/1409.4504v1", "categories": ["cs.CL", "cs.SI"], "primary_category": "cs.CL"}
{"title": "Modeling the average shortest path length in growth of word-adjacency\n  networks", "abstract": "We investigate properties of evolving linguistic networks defined by the\nword-adjacency relation. Such networks belong to the category of networks with\naccelerated growth but their shortest path length appears to reveal the network\nsize dependence of different functional form than the ones known so far. We\nthus compare the networks created from literary texts with their artificial\nsubstitutes based on different variants of the Dorogovtsev-Mendes model and\nobserve that none of them is able to properly simulate the novel asymptotics of\nthe shortest path length. Then, we identify the local chain-like linear growth\ninduced by grammar and style as a missing element in this model and extend it\nby incorporating such effects. It is in this way that a satisfactory agreement\nwith the empirical result is obtained.", "published": "2014-09-16 17:49:31", "link": "http://arxiv.org/abs/1409.4714v2", "categories": ["cs.CL", "physics.soc-ph"], "primary_category": "cs.CL"}
{"title": "The Role of Emotions in Propagating Brands in Social Networks", "abstract": "A key aspect of word of mouth marketing are emotions. Emotions in texts help\npropagating messages in conventional advertising. In word of mouth scenarios,\nemotions help to engage consumers and incite to propagate the message further.\nWhile the function of emotions in offline marketing in general and word of\nmouth marketing in particular is rather well understood, online marketing can\nonly offer a limited view on the function of emotions. In this contribution we\nseek to close this gap. We therefore investigate how emotions function in\nsocial media. To do so, we collected more than 30,000 brand marketing messages\nfrom the Google+ social networking site. Using state of the art computational\nlinguistics classifiers, we compute the sentiment of these messages. Starting\nout with Poisson regression-based baseline models, we seek to replicate earlier\nfindings using this large data set. We extend upon earlier research by\ncomputing multi-level mixed effects models that compare the function of\nemotions across different industries. We find that while the well known notion\nof activating emotions propagating messages holds in general for our data as\nwell. But there are significant differences between the observed industries.", "published": "2014-09-16 13:03:51", "link": "http://arxiv.org/abs/1409.4617v1", "categories": ["cs.SI", "cs.CL", "stat.ML"], "primary_category": "cs.SI"}
