{"title": "Ensemble Detection of Single & Multiple Events at Sentence-Level", "abstract": "Event classification at sentence level is an important Information Extraction\ntask with applications in several NLP, IR, and personalization systems.\nMulti-label binary relevance (BR) are the state-of-art methods. In this work,\nwe explored new multi-label methods known for capturing relations between event\ntypes. These new methods, such as the ensemble Chain of Classifiers, improve\nthe F1 on average across the 6 labels by 2.8% over the Binary Relevance. The\nlow occurrence of multi-label sentences motivated the reduction of the hard\nimbalanced multi-label classification problem with low number of occurrences of\nmultiple labels per instance to an more tractable imbalanced multiclass problem\nwith better results (+ 4.6%). We report the results of adding new features,\nsuch as sentiment strength, rhetorical signals, domain-id (source-id and date),\nand key-phrases in both single-label and multi-label event classification\nscenarios.", "published": "2014-03-24 16:21:04", "link": "http://arxiv.org/abs/1403.6023v1", "categories": ["cs.CL", "cs.LG"], "primary_category": "cs.CL"}
{"title": "Coherent Multi-Sentence Video Description with Variable Level of Detail", "abstract": "Humans can easily describe what they see in a coherent way and at varying\nlevel of detail. However, existing approaches for automatic video description\nare mainly focused on single sentence generation and produce descriptions at a\nfixed level of detail. In this paper, we address both of these limitations: for\na variable level of detail we produce coherent multi-sentence descriptions of\ncomplex videos. We follow a two-step approach where we first learn to predict a\nsemantic representation (SR) from video and then generate natural language\ndescriptions from the SR. To produce consistent multi-sentence descriptions, we\nmodel across-sentence consistency at the level of the SR by enforcing a\nconsistent topic. We also contribute both to the visual recognition of objects\nproposing a hand-centric approach as well as to the robust generation of\nsentences using a word lattice. Human judges rate our multi-sentence\ndescriptions as more readable, correct, and relevant than related work. To\nunderstand the difference between more detailed and shorter descriptions, we\ncollect and analyze a video description corpus of three levels of detail.", "published": "2014-03-24 22:28:38", "link": "http://arxiv.org/abs/1403.6173v1", "categories": ["cs.CV", "cs.CL"], "primary_category": "cs.CV"}
