{"title": "Implementation of an Automatic Sign Language Lexical Annotation\n  Framework based on Propositional Dynamic Logic", "abstract": "In this paper, we present the implementation of an automatic Sign Language\n(SL) sign annotation framework based on a formal logic, the Propositional\nDynamic Logic (PDL). Our system relies heavily on the use of a specific variant\nof PDL, the Propositional Dynamic Logic for Sign Language (PDLSL), which lets\nus describe SL signs as formulae and corpora videos as labeled transition\nsystems (LTSs). Here, we intend to show how a generic annotation system can be\nconstructed upon these underlying theoretical principles, regardless of the\ntracking technologies available or the input format of corpora. With this in\nmind, we generated a development framework that adapts the system to specific\nuse cases. Furthermore, we present some results obtained by our application\nwhen adapted to one distinct case, 2D corpora analysis with pre-processed\ntracking information. We also present some insights on how such a technology\ncan be used to analyze 3D real-time data, captured with a depth device.", "published": "2014-03-25 15:36:36", "link": "http://arxiv.org/abs/1403.6392v2", "categories": ["cs.CL", "I.2.7"], "primary_category": "cs.CL"}
{"title": "Evaluating topic coherence measures", "abstract": "Topic models extract representative word sets - called topics - from word\ncounts in documents without requiring any semantic annotations. Topics are not\nguaranteed to be well interpretable, therefore, coherence measures have been\nproposed to distinguish between good and bad topics. Studies of topic coherence\nso far are limited to measures that score pairs of individual words. For the\nfirst time, we include coherence measures from scientific philosophy that score\npairs of more complex word subsets and apply them to topic scoring.", "published": "2014-03-25 15:44:14", "link": "http://arxiv.org/abs/1403.6397v1", "categories": ["cs.LG", "cs.CL", "cs.IR"], "primary_category": "cs.LG"}
