{"title": "Étude cognitive des processus de construction d'une requête dans un\n  système de gestion de connaissances médicales", "abstract": "This article presents the Cogni-CISMeF project, which aims at improving\nmedical information search in the CISMeF system (Catalog and Index of\nFrench-language health resources) by including a conversational agent to\ninteract with the user in natural language. To study the cognitive processes\ninvolved during the information search, a bottom-up methodology was adopted.\nExperimentation has been set up to obtain human dialogs between a user (playing\nthe role of patient) dealing with medical information search and a CISMeF\nexpert refining the request. The analysis of these dialogs underlined the use\nof discursive evidence: vocabulary, reformulation, implicit or explicit\nexpression of user intentions, conversational sequences, etc. A model of\nartificial agent is proposed. It leads the user in its information search by\nproposing to him examples, assistance and choices. This model was implemented\nand integrated in the CISMeF system. ---- Cet article d\\'ecrit le projet\nCogni-CISMeF qui propose un module de dialogue Homme-Machine \\`a int\\'egrer\ndans le syst\\`eme d'indexation de connaissances m\\'edicales CISMeF (Catalogue\net Index des Sites M\\'edicaux Francophones). Nous avons adopt\\'e une d\\'emarche\nde mod\\'elisation cognitive en proc\\'edant \\`a un recueil de corpus de\ndialogues entre un utilisateur (jouant le r\\^ole d'un patient) d\\'esirant une\ninformation m\\'edicale et un expert CISMeF af inant cette demande pour\nconstruire la requ\\^ete. Nous avons analys\\'e la structure des dialogues ainsi\nobtenus et avons \\'etudi\\'e un certain nombre d'indices discursifs :\nvocabulaire employ\\'e, marques de reformulation, commentaires m\\'eta et\n\\'epilinguistiques, expression implicite ou explicite des intentions de\nl'utilisateur, encha\\^inement conversationnel, etc. De cette analyse, nous\navons construit un mod\\`ele d'agent artificiel dot\\'e de capacit\\'es cognitives\ncapables d'aider l'utilisateur dans sa t\\^ache de recherche d'information. Ce\nmod\\`ele a \\'et\\'e impl\\'ement\\'e et int\\'egr\\'e dans le syst\\`eme CISMeF.", "published": "2014-02-10 20:46:24", "link": "http://arxiv.org/abs/1402.2562v1", "categories": ["cs.IR", "cs.CL"], "primary_category": "cs.IR"}
