{"title": "Crowdsourcing Dialect Characterization through Twitter", "abstract": "We perform a large-scale analysis of language diatopic variation using\ngeotagged microblogging datasets. By collecting all Twitter messages written in\nSpanish over more than two years, we build a corpus from which a carefully\nselected list of concepts allows us to characterize Spanish varieties on a\nglobal scale. A cluster analysis proves the existence of well defined\nmacroregions sharing common lexical properties. Remarkably enough, we find that\nSpanish language is split into two superdialects, namely, an urban speech used\nacross major American and Spanish citites and a diverse form that encompasses\nrural areas and small towns. The latter can be further clustered into smaller\nvarieties with a stronger regional character.", "published": "2014-07-26 04:16:31", "link": "http://arxiv.org/abs/1407.7094v1", "categories": ["physics.soc-ph", "cs.CL", "cs.SI", "stat.ML"], "primary_category": "physics.soc-ph"}
{"title": "Principles and Parameters: a coding theory perspective", "abstract": "We propose an approach to Longobardi's parametric comparison method (PCM) via\nthe theory of error-correcting codes. One associates to a collection of\nlanguages to be analyzed with the PCM a binary (or ternary) code with one code\nwords for each language in the family and each word consisting of the binary\nvalues of the syntactic parameters of the language, with the ternary case\nallowing for an additional parameter state that takes into account phenomena of\nentailment of parameters. The code parameters of the resulting code can be\ncompared with some classical bounds in coding theory: the asymptotic bound, the\nGilbert-Varshamov bound, etc. The position of the code parameters with respect\nto some of these bounds provides quantitative information on the variability of\nsyntactic parameters within and across historical-linguistic families. While\ncomputations carried out for languages belonging to the same family yield codes\nbelow the GV curve, comparisons across different historical families can give\nexamples of isolated codes lying above the asymptotic bound.", "published": "2014-07-26 23:48:32", "link": "http://arxiv.org/abs/1407.7169v1", "categories": ["cs.CL", "cs.IT", "math.IT", "91F20, 68P30"], "primary_category": "cs.CL"}
