{"title": "Maximum Entropy, Word-Frequency, Chinese Characters, and Multiple\n  Meanings", "abstract": "The word-frequency distribution of a text written by an author is well\naccounted for by a maximum entropy distribution, the RGF (random group\nformation)-prediction. The RGF-distribution is completely determined by the a\npriori values of the total number of words in the text (M), the number of\ndistinct words (N) and the number of repetitions of the most common word\n(k_max). It is here shown that this maximum entropy prediction also describes a\ntext written in Chinese characters. In particular it is shown that although the\nsame Chinese text written in words and Chinese characters have quite\ndifferently shaped distributions, they are nevertheless both well predicted by\ntheir respective three a priori characteristic values. It is pointed out that\nthis is analogous to the change in the shape of the distribution when\ntranslating a given text to another language. Another consequence of the\nRGF-prediction is that taking a part of a long text will change the input\nparameters (M, N, k_max) and consequently also the shape of the frequency\ndistribution. This is explicitly confirmed for texts written in Chinese\ncharacters. Since the RGF-prediction has no system-specific information beyond\nthe three a priori values (M, N, k_max), any specific language characteristic\nhas to be sought in systematic deviations from the RGF-prediction and the\nmeasured frequencies. One such systematic deviation is identified and, through\na statistical information theoretical argument and an extended RGF-model, it is\nproposed that this deviation is caused by multiple meanings of Chinese\ncharacters. The effect is stronger for Chinese characters than for Chinese\nwords. The relation between Zipf's law, the Simon-model for texts and the\npresent results are discussed.", "published": "2014-02-09 11:47:15", "link": "http://arxiv.org/abs/1402.1939v2", "categories": ["physics.soc-ph", "cs.CL"], "primary_category": "physics.soc-ph"}
