{"title": "We Tweet Like We Talk and Other Interesting Observations: An Analysis of\n  English Communication Modalities", "abstract": "Modalities of communication for human beings are gradually increasing in\nnumber with the advent of new forms of technology. Many human beings can\nreadily transition between these different forms of communication with little\nor no effort, which brings about the question: How similar are these different\ncommunication modalities? To understand technology$\\text{'}$s influence on\nEnglish communication, four different corpora were analyzed and compared:\nWriting from Books using the 1-grams database from the Google Books project,\nTwitter, IRC Chat, and transcribed Talking. Multi-word confusion matrices\nrevealed that Talking has the most similarity when compared to the other modes\nof communication, while 1-grams were the least similar form of communication\nanalyzed. Based on the analysis of word usage, word usage frequency\ndistributions, and word class usage, among other things, Talking is also the\nmost similar to Twitter and IRC Chat. This suggests that communicating using\nTwitter and IRC Chat evolved from Talking rather than Writing. When we\ncommunicate online, even though we are writing, we do not Tweet or Chat how we\nwrite books; we Tweet and Chat how we Speak. Nonfiction and Fiction writing\nwere clearly differentiable from our analysis with Twitter and Chat being much\nmore similar to Fiction than Nonfiction writing. These hypotheses were then\ntested using author and journalists Cory Doctorow. Mr. Doctorow$\\text{'}$s\nWriting, Twitter usage, and Talking were all found to have very similar\nvocabulary usage patterns as the amalgamized populations, as long as the\nwriting was Fiction. However, Mr. Doctorow$\\text{'}$s Nonfiction writing is\ndifferent from 1-grams and other collected Nonfiction writings. This data could\nperhaps be used to create more entertaining works of Nonfiction.", "published": "2014-03-03 19:27:23", "link": "http://arxiv.org/abs/1403.0531v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Representing, reasoning and answering questions about biological\n  pathways - various applications", "abstract": "Biological organisms are composed of numerous interconnected biochemical\nprocesses. Diseases occur when normal functionality of these processes is\ndisrupted. Thus, understanding these biochemical processes and their\ninterrelationships is a primary task in biomedical research and a prerequisite\nfor diagnosing diseases, and drug development. Scientists studying these\nprocesses have identified various pathways responsible for drug metabolism, and\nsignal transduction, etc.\n  Newer techniques and speed improvements have resulted in deeper knowledge\nabout these pathways, resulting in refined models that tend to be large and\ncomplex, making it difficult for a person to remember all aspects of it. Thus,\ncomputer models are needed to analyze them. We want to build such a system that\nallows modeling of biological systems and pathways in such a way that we can\nanswer questions about them.\n  Many existing models focus on structural and/or factoid questions, using\nsurface-level knowledge that does not require understanding the underlying\nmodel. We believe these are not the kind of questions that a biologist may ask\nsomeone to test their understanding of the biological processes. We want our\nsystem to answer the kind of questions a biologist may ask. Such questions\nappear in early college level text books.\n  Thus the main goal of our thesis is to develop a system that allows us to\nencode knowledge about biological pathways and answer such questions about them\ndemonstrating understanding of the pathway. To that end, we develop a language\nthat will allow posing such questions and illustrate the utility of our\nframework with various applications in the biological domain. We use some\nexisting tools with modifications to accomplish our goal.\n  Finally, we apply our system to real world applications by extracting pathway\nknowledge from text and answering questions related to drug development.", "published": "2014-03-03 19:45:41", "link": "http://arxiv.org/abs/1403.0541v1", "categories": ["cs.AI", "cs.CE", "cs.CL"], "primary_category": "cs.AI"}
