{"title": "Mapping the Economic Crisis: Some Preliminary Investigations", "abstract": "In this paper we describe our contribution to the PoliInformatics 2014\nChallenge on the 2007-2008 financial crisis. We propose a state of the art\ntechnique to extract information from texts and provide different\nrepresentations, giving first a static overview of the domain and then a\ndynamic representation of its main evolutions. We show that this strategy\nprovides a practical solution to some recent theories in social sciences that\nare facing a lack of methods and tools to automatically extract information\nfrom natural language texts.", "published": "2014-06-17 01:34:22", "link": "http://arxiv.org/abs/1406.4211v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Scaling laws and fluctuations in the statistics of word frequencies", "abstract": "In this paper we combine statistical analysis of large text databases and\nsimple stochastic models to explain the appearance of scaling laws in the\nstatistics of word frequencies. Besides the sublinear scaling of the vocabulary\nsize with database size (Heaps' law), here we report a new scaling of the\nfluctuations around this average (fluctuation scaling analysis). We explain\nboth scaling laws by modeling the usage of words by simple stochastic processes\nin which the overall distribution of word-frequencies is fat tailed (Zipf's\nlaw) and the frequency of a single word is subject to fluctuations across\ndocuments (as in topic models). In this framework, the mean and the variance of\nthe vocabulary size can be expressed as quenched averages, implying that: i)\nthe inhomogeneous dissemination of words cause a reduction of the average\nvocabulary size in comparison to the homogeneous case, and ii) correlations in\nthe co-occurrence of words lead to an increase in the variance and the\nvocabulary size becomes a non-self-averaging quantity. We address the\nimplications of these observations to the measurement of lexical richness. We\ntest our results in three large text databases (Google-ngram, Enlgish\nWikipedia, and a collection of scientific articles).", "published": "2014-06-17 17:29:39", "link": "http://arxiv.org/abs/1406.4441v2", "categories": ["physics.soc-ph", "cs.CL", "physics.data-an"], "primary_category": "physics.soc-ph"}
{"title": "Authorship Attribution through Function Word Adjacency Networks", "abstract": "A method for authorship attribution based on function word adjacency networks\n(WANs) is introduced. Function words are parts of speech that express\ngrammatical relationships between other words but do not carry lexical meaning\non their own. In the WANs in this paper, nodes are function words and directed\nedges stand in for the likelihood of finding the sink word in the ordered\nvicinity of the source word. WANs of different authors can be interpreted as\ntransition probabilities of a Markov chain and are therefore compared in terms\nof their relative entropies. Optimal selection of WAN parameters is studied and\nattribution accuracy is benchmarked across a diverse pool of authors and\nvarying text lengths. This analysis shows that, since function words are\nindependent of content, their use tends to be specific to an author and that\nthe relational data captured by function WANs is a good summary of stylometric\nfingerprints. Attribution accuracy is observed to exceed the one achieved by\nmethods that rely on word frequencies alone. Further combining WANs with\nmethods that rely on word frequencies alone, results in larger attribution\naccuracy, indicating that both sources of information encode different aspects\nof authorial styles.", "published": "2014-06-17 18:32:18", "link": "http://arxiv.org/abs/1406.4469v1", "categories": ["cs.CL", "cs.LG", "stat.ML"], "primary_category": "cs.CL"}
{"title": "Extracting information from S-curves of language change", "abstract": "It is well accepted that adoption of innovations are described by S-curves\n(slow start, accelerating period, and slow end). In this paper, we analyze how\nmuch information on the dynamics of innovation spreading can be obtained from a\nquantitative description of S-curves. We focus on the adoption of linguistic\ninnovations for which detailed databases of written texts from the last 200\nyears allow for an unprecedented statistical precision. Combining data analysis\nwith simulations of simple models (e.g., the Bass dynamics on complex networks)\nwe identify signatures of endogenous and exogenous factors in the S-curves of\nadoption. We propose a measure to quantify the strength of these factors and\nthree different methods to estimate it from S-curves. We obtain cases in which\nthe exogenous factors are dominant (in the adoption of German orthographic\nreforms and of one irregular verb) and cases in which endogenous factors are\ndominant (in the adoption of conventions for romanization of Russian names and\nin the regularization of most studied verbs). These results show that the shape\nof S-curve is not universal and contains information on the adoption mechanism.\n(published at \"J. R. Soc. Interface, vol. 11, no. 101, (2014) 1044\"; DOI:\nhttp://dx.doi.org/10.1098/rsif.2014.1044)", "published": "2014-06-17 19:49:03", "link": "http://arxiv.org/abs/1406.4498v2", "categories": ["physics.soc-ph", "cs.CL", "physics.data-an"], "primary_category": "physics.soc-ph"}
