{"title": "Modelling the Lexicon in Unsupervised Part of Speech Induction", "abstract": "Automatically inducing the syntactic part-of-speech categories for words in\ntext is a fundamental task in Computational Linguistics. While the performance\nof unsupervised tagging models has been slowly improving, current\nstate-of-the-art systems make the obviously incorrect assumption that all\ntokens of a given word type must share a single part-of-speech tag. This\none-tag-per-type heuristic counters the tendency of Hidden Markov Model based\ntaggers to over generate tags for a given word type. However, it is clearly\nincompatible with basic syntactic theory. In this paper we extend a\nstate-of-the-art Pitman-Yor Hidden Markov Model tagger with an explicit model\nof the lexicon. In doing so we are able to incorporate a soft bias towards\ninducing few tags per type. We develop a particle filter for drawing samples\nfrom the posterior of our model and present empirical results that show that\nour model is competitive with and faster than the state-of-the-art without\nmaking any unrealistic restrictions.", "published": "2014-02-26 12:37:04", "link": "http://arxiv.org/abs/1402.6516v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Why Are You More Engaged? Predicting Social Engagement from Word Use", "abstract": "We present a study to analyze how word use can predict social engagement\nbehaviors such as replies and retweets in Twitter. We compute psycholinguistic\ncategory scores from word usage, and investigate how people with different\nscores exhibited different reply and retweet behaviors on Twitter. We also\nfound psycholinguistic categories that show significant correlations with such\nsocial engagement behaviors. In addition, we have built predictive models of\nreplies and retweets from such psycholinguistic category based features. Our\nexperiments using a real world dataset collected from Twitter validates that\nsuch predictions can be done with reasonable accuracy.", "published": "2014-02-26 20:58:00", "link": "http://arxiv.org/abs/1402.6690v1", "categories": ["cs.SI", "cs.CL", "cs.CY"], "primary_category": "cs.SI"}
