{"title": "Network Motifs Analysis of Croatian Literature", "abstract": "In this paper we analyse network motifs in the co-occurrence directed\nnetworks constructed from five different texts (four books and one portal) in\nthe Croatian language. After preparing the data and network construction, we\nperform the network motif analysis. We analyse the motif frequencies and\nZ-scores in the five networks. We present the triad significance profile for\nfive datasets. Furthermore, we compare our results with the existing results\nfor the linguistic networks. Firstly, we show that the triad significance\nprofile for the Croatian language is very similar with the other languages and\nall the networks belong to the same family of networks. However, there are\ncertain differences between the Croatian language and other analysed languages.\nWe conclude that this is due to the free word-order of the Croatian language.", "published": "2014-11-18 18:46:36", "link": "http://arxiv.org/abs/1411.4960v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Cognitive Systems and Question Answering", "abstract": "This paper briefly characterizes the field of cognitive computing. As an\nexemplification, the field of natural language question answering is introduced\ntogether with its specific challenges. A possibility to master these challenges\nis illustrated by a detailed presentation of the LogAnswer system, which is a\nsuccessful representative of the field of natural language question answering.", "published": "2014-11-18 12:37:00", "link": "http://arxiv.org/abs/1411.4825v1", "categories": ["cs.AI", "cs.CL"], "primary_category": "cs.AI"}
{"title": "Linguistic Descriptions for Automatic Generation of Textual Short-Term\n  Weather Forecasts on Real Prediction Data", "abstract": "We present in this paper an application which automatically generates textual\nshort-term weather forecasts for every municipality in Galicia (NW Spain),\nusing the real data provided by the Galician Meteorology Agency (MeteoGalicia).\nThis solution combines in an innovative way computing with perceptions\ntechniques and strategies for linguistic description of data together with a\nnatural language generation (NLG) system. The application, named GALiWeather,\nextracts relevant information from weather forecast input data and encodes it\ninto intermediate descriptions using linguistic variables and temporal\nreferences. These descriptions are later translated into natural language texts\nby the natural language generation system. The obtained forecast results have\nbeen thoroughly validated by an expert meteorologist from MeteoGalicia using a\nquality assessment methodology which covers two key dimensions of a text: the\naccuracy of its content and the correctness of its form. Following this\nvalidation GALiWeather will be released as a real service offering custom\nforecasts for a wide public.", "published": "2014-11-18 17:35:59", "link": "http://arxiv.org/abs/1411.4925v1", "categories": ["cs.AI", "cs.CL"], "primary_category": "cs.AI"}
{"title": "From Captions to Visual Concepts and Back", "abstract": "This paper presents a novel approach for automatically generating image\ndescriptions: visual detectors, language models, and multimodal similarity\nmodels learnt directly from a dataset of image captions. We use multiple\ninstance learning to train visual detectors for words that commonly occur in\ncaptions, including many different parts of speech such as nouns, verbs, and\nadjectives. The word detector outputs serve as conditional inputs to a\nmaximum-entropy language model. The language model learns from a set of over\n400,000 image descriptions to capture the statistics of word usage. We capture\nglobal semantics by re-ranking caption candidates using sentence-level features\nand a deep multimodal similarity model. Our system is state-of-the-art on the\nofficial Microsoft COCO benchmark, producing a BLEU-4 score of 29.1%. When\nhuman judges compare the system captions to ones written by other people on our\nheld-out test set, the system captions have equal or better quality 34% of the\ntime.", "published": "2014-11-18 18:23:45", "link": "http://arxiv.org/abs/1411.4952v3", "categories": ["cs.CV", "cs.CL"], "primary_category": "cs.CV"}
