{"title": "On the Use of Different Feature Extraction Methods for Linear and Non\n  Linear kernels", "abstract": "The speech feature extraction has been a key focus in robust speech\nrecognition research; it significantly affects the recognition performance. In\nthis paper, we first study a set of different features extraction methods such\nas linear predictive coding (LPC), mel frequency cepstral coefficient (MFCC)\nand perceptual linear prediction (PLP) with several features normalization\ntechniques like rasta filtering and cepstral mean subtraction (CMS). Based on\nthis, a comparative evaluation of these features is performed on the task of\ntext independent speaker identification using a combination between gaussian\nmixture models (GMM) and linear and non-linear kernels based on support vector\nmachine (SVM).", "published": "2014-06-27 20:56:00", "link": "http://arxiv.org/abs/1406.7314v1", "categories": ["cs.CL", "cs.LG"], "primary_category": "cs.CL"}
{"title": "Architecture of a Web-based Predictive Editor for Controlled Natural\n  Language Processing", "abstract": "In this paper, we describe the architecture of a web-based predictive text\neditor being developed for the controlled natural language PENG$^{ASP)$. This\ncontrolled language can be used to write non-monotonic specifications that have\nthe same expressive power as Answer Set Programs. In order to support the\nwriting process of these specifications, the predictive text editor\ncommunicates asynchronously with the controlled natural language processor that\ngenerates lookahead categories and additional auxiliary information for the\nauthor of a specification text. The text editor can display multiple sets of\nlookahead categories simultaneously for different possible sentence\ncompletions, anaphoric expressions, and supports the addition of new content\nwords to the lexicon.", "published": "2014-06-27 01:00:59", "link": "http://arxiv.org/abs/1408.0016v1", "categories": ["cs.CL", "cs.AI"], "primary_category": "cs.CL"}
