{"title": "Automatic Method Of Domain Ontology Construction based on\n  Characteristics of Corpora POS-Analysis", "abstract": "It is now widely recognized that ontologies, are one of the fundamental\ncornerstones of knowledge-based systems. What is lacking, however, is a\ncurrently accepted strategy of how to build ontology; what kinds of the\nresources and techniques are indispensables to optimize the expenses and the\ntime on the one hand and the amplitude, the completeness, the robustness of en\nontology on the other hand. The paper offers a semi-automatic ontology\nconstruction method from text corpora in the domain of radiological protection.\nThis method is composed from next steps: 1) text annotation with part-of-speech\ntags; 2) revelation of the significant linguistic structures and forming the\ntemplates; 3) search of text fragments corresponding to these templates; 4)\nbasic ontology instantiation process", "published": "2014-05-06 16:28:16", "link": "http://arxiv.org/abs/1405.1346v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Latent semantics of action verbs reflect phonetic parameters of\n  intensity and emotional content", "abstract": "Conjuring up our thoughts, language reflects statistical patterns of word\nco-occurrences which in turn come to describe how we perceive the world.\nWhether counting how frequently nouns and verbs combine in Google search\nqueries, or extracting eigenvectors from term document matrices made up of\nWikipedia lines and Shakespeare plots, the resulting latent semantics capture\nnot only the associative links which form concepts, but also spatial dimensions\nembedded within the surface structure of language. As both the shape and\nmovements of objects have been found to be associated with phonetic contrasts\nalready in toddlers, this study explores whether articulatory and acoustic\nparameters may likewise differentiate the latent semantics of action verbs.\nSelecting 3 x 20 emotion, face, and hand related verbs known to activate\npremotor areas in the brain, their mutual cosine similarities were computed\nusing latent semantic analysis LSA, and the resulting adjacency matrices were\ncompared based on two different large scale text corpora; HAWIK and TASA.\nApplying hierarchical clustering to identify common structures across the two\ntext corpora, the verbs largely divide into combined mouth and hand movements\nversus emotional expressions. Transforming the verbs into their constituent\nphonemes, the clustered small and large size movements appear differentiated by\nfront versus back vowels corresponding to increasing levels of arousal. Whereas\nthe clustered emotional verbs seem characterized by sequences of close versus\nopen jaw produced phonemes, generating up- or downwards shifts in formant\nfrequencies that may influence their perceived valence. Suggesting, that the\nlatent semantics of action verbs reflect parameters of intensity and emotional\npolarity that appear correlated with the articulatory contrasts and acoustic\ncharacteristics of phonemes", "published": "2014-05-06 16:52:34", "link": "http://arxiv.org/abs/1405.1359v3", "categories": ["cs.CL", "68T50", "I.2.4; I.2.7"], "primary_category": "cs.CL"}
{"title": "D-Bees: A Novel Method Inspired by Bee Colony Optimization for Solving\n  Word Sense Disambiguation", "abstract": "Word sense disambiguation (WSD) is a problem in the field of computational\nlinguistics given as finding the intended sense of a word (or a set of words)\nwhen it is activated within a certain context. WSD was recently addressed as a\ncombinatorial optimization problem in which the goal is to find a sequence of\nsenses that maximize the semantic relatedness among the target words. In this\narticle, a novel algorithm for solving the WSD problem called D-Bees is\nproposed which is inspired by bee colony optimization (BCO)where artificial bee\nagents collaborate to solve the problem. The D-Bees algorithm is evaluated on a\nstandard dataset (SemEval 2007 coarse-grained English all-words task corpus)and\nis compared to simulated annealing, genetic algorithms, and two ant colony\noptimization techniques (ACO). It will be observed that the BCO and ACO\napproaches are on par.", "published": "2014-05-06 19:26:35", "link": "http://arxiv.org/abs/1405.1406v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "A Corpus of Sentence-level Revisions in Academic Writing: A Step towards\n  Understanding Statement Strength in Communication", "abstract": "The strength with which a statement is made can have a significant impact on\nthe audience. For example, international relations can be strained by how the\nmedia in one country describes an event in another; and papers can be rejected\nbecause they overstate or understate their findings. It is thus important to\nunderstand the effects of statement strength. A first step is to be able to\ndistinguish between strong and weak statements. However, even this problem is\nunderstudied, partly due to a lack of data. Since strength is inherently\nrelative, revisions of texts that make claims are a natural source of data on\nstrength differences. In this paper, we introduce a corpus of sentence-level\nrevisions from academic writing. We also describe insights gained from our\nannotation efforts for this task.", "published": "2014-05-06 20:05:23", "link": "http://arxiv.org/abs/1405.1439v2", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "The effect of wording on message propagation: Topic- and\n  author-controlled natural experiments on Twitter", "abstract": "Consider a person trying to spread an important message on a social network.\nHe/she can spend hours trying to craft the message. Does it actually matter?\nWhile there has been extensive prior work looking into predicting popularity of\nsocial-media content, the effect of wording per se has rarely been studied\nsince it is often confounded with the popularity of the author and the topic.\nTo control for these confounding factors, we take advantage of the surprising\nfact that there are many pairs of tweets containing the same url and written by\nthe same user but employing different wording. Given such pairs, we ask: which\nversion attracts more retweets? This turns out to be a more difficult task than\npredicting popular topics. Still, humans can answer this question better than\nchance (but far from perfectly), and the computational methods we develop can\ndo better than both an average human and a strong competing method trained on\nnon-controlled data.", "published": "2014-05-06 20:04:44", "link": "http://arxiv.org/abs/1405.1438v1", "categories": ["cs.SI", "cs.CL", "physics.soc-ph"], "primary_category": "cs.SI"}
