{"title": "The Frobenius anatomy of word meanings II: possessive relative pronouns", "abstract": "Within the categorical compositional distributional model of meaning, we\nprovide semantic interpretations for the subject and object roles of the\npossessive relative pronoun `whose'. This is done in terms of Frobenius\nalgebras over compact closed categories. These algebras and their diagrammatic\nlanguage expose how meanings of words in relative clauses interact with each\nother. We show how our interpretation is related to Montague-style semantics\nand provide a truth-theoretic interpretation. We also show how vector spaces\nprovide a concrete interpretation and provide preliminary corpus-based\nexperimental evidence. In a prequel to this paper, we used similar methods and\ndealt with the case of subject and object relative pronouns.", "published": "2014-06-18 11:54:13", "link": "http://arxiv.org/abs/1406.4690v1", "categories": ["cs.CL", "math.CT", "18Dxx, 18Axx", "I.2.7; F.4.1"], "primary_category": "cs.CL"}
{"title": "Typed Hilbert Epsilon Operators and the Semantics of Determiner Phrases\n  (Invited Lecture)", "abstract": "The semantics of determiner phrases, be they definite de- scriptions,\nindefinite descriptions or quantified noun phrases, is often as- sumed to be a\nfully solved question: common nouns are properties, and determiners are\ngeneralised quantifiers that apply to two predicates: the property\ncorresponding to the common noun and the one corresponding to the verb phrase.\nWe first present a criticism of this standard view. Firstly, the semantics of\ndeterminers does not follow the syntactical structure of the sentence. Secondly\nthe standard interpretation of the indefinite article cannot ac- count for\nnominal sentences. Thirdly, the standard view misses the linguis- tic asymmetry\nbetween the two properties of a generalised quantifier. In the sequel, we\npropose a treatment of determiners and quantifiers as Hilbert terms in a richly\ntyped system that we initially developed for lexical semantics, using a many\nsorted logic for semantical representations. We present this semantical\nframework called the Montagovian generative lexicon and show how these terms\nbetter match the syntactical structure and avoid the aforementioned problems of\nthe standard approach. Hilbert terms rather differ from choice functions in\nthat there is one polymorphic operator and not one operator per formula. They\nalso open an intriguing connection between the logic for meaning assembly, the\ntyped lambda calculus handling compositionality and the many-sorted logic for\nsemantical representations. Furthermore epsilon terms naturally introduce\ntype-judgements and confirm the claim that type judgment are a form of\npresupposition.", "published": "2014-06-18 13:32:55", "link": "http://arxiv.org/abs/1406.4710v1", "categories": ["cs.CL", "cs.AI", "cs.LO", "math.LO", "03B65, 03B15, 03B40, 68T50, 68N18"], "primary_category": "cs.CL"}
