{"title": "A survey of methods to ease the development of highly multilingual text\n  mining applications", "abstract": "Multilingual text processing is useful because the information content found\nin different languages is complementary, both regarding facts and opinions.\nWhile Information Extraction and other text mining software can, in principle,\nbe developed for many languages, most text analysis tools have only been\napplied to small sets of languages because the development effort per language\nis large. Self-training tools obviously alleviate the problem, but even the\neffort of providing training data and of manually tuning the results is usually\nconsiderable. In this paper, we gather insights by various multilingual system\ndevelopers on how to minimise the effort of developing natural language\nprocessing applications for many languages. We also explain the main guidelines\nunderlying our own effort to develop complex text mining software for tens of\nlanguages. While these guidelines - most of all: extreme simplicity - can be\nvery restrictive and limiting, we believe to have shown the feasibility of the\napproach through the development of the Europe Media Monitor (EMM) family of\napplications (http://emm.newsbrief.eu/overview.html). EMM is a set of complex\nmedia monitoring tools that process and analyse up to 100,000 online news\narticles per day in between twenty and fifty languages. We will also touch upon\nthe kind of language resources that would make it easier for all to develop\nhighly multilingual text mining applications. We will argue that - to achieve\nthis - the most needed resources would be freely available, simple, parallel\nand uniform multilingual dictionaries, corpora and software tools.", "published": "2014-01-13 18:05:28", "link": "http://arxiv.org/abs/1401.2937v1", "categories": ["cs.CL", "I.2.7; H.3.1; H.3.3; H.3.6"], "primary_category": "cs.CL"}
{"title": "ONTS: \"Optima\" News Translation System", "abstract": "We propose a real-time machine translation system that allows users to select\na news category and to translate the related live news articles from Arabic,\nCzech, Danish, Farsi, French, German, Italian, Polish, Portuguese, Spanish and\nTurkish into English. The Moses-based system was optimised for the news domain\nand differs from other available systems in four ways: (1) News items are\nautomatically categorised on the source side, before translation; (2) Named\nentity translation is optimised by recognising and extracting them on the\nsource side and by re-inserting their translation in the target language,\nmaking use of a separate entity repository; (3) News titles are translated with\na separate translation system which is optimised for the specific style of news\ntitles; (4) The system was optimised for speed in order to cope with the large\nvolume of daily news articles.", "published": "2014-01-13 18:25:10", "link": "http://arxiv.org/abs/1401.2943v1", "categories": ["cs.CL", "I.2.7; H.3.3; H.3.6"], "primary_category": "cs.CL"}
