{"title": "Translation Of Telugu-Marathi and Vice-Versa using Rule Based Machine\n  Translation", "abstract": "In todays digital world automated Machine Translation of one language to\nanother has covered a long way to achieve different kinds of success stories.\nWhereas Babel Fish supports a good number of foreign languages and only Hindi\nfrom Indian languages, the Google Translator takes care of about 10 Indian\nlanguages. Though most of the Automated Machine Translation Systems are doing\nwell but handling Indian languages needs a major care while handling the local\nproverbs/ idioms. Most of the Machine Translation system follows the direct\ntranslation approach while translating one Indian language to other. Our\nresearch at KMIT R&D Lab found that handling the local proverbs/idioms is not\ngiven enough attention by the earlier research work. This paper focuses on two\nof the majorly spoken Indian languages Marathi and Telugu, and translation\nbetween them. Handling proverbs and idioms of both the languages have been\ngiven a special care, and the research outcome shows a significant achievement\nin this direction.", "published": "2014-06-16 10:59:03", "link": "http://arxiv.org/abs/1406.3969v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Handling non-compositionality in multilingual CNLs", "abstract": "In this paper, we describe methods for handling multilingual\nnon-compositional constructions in the framework of GF. We specifically look at\nmethods to detect and extract non-compositional phrases from parallel texts and\npropose methods to handle such constructions in GF grammars. We expect that the\nmethods to handle non-compositional constructions will enrich CNLs by providing\nmore flexibility in the design of controlled languages. We look at two specific\nuse cases of non-compositional constructions: a general-purpose method to\ndetect and extract multilingual multiword expressions and a procedure to\nidentify nominal compounds in German. We evaluate our procedure for multiword\nexpressions by performing a qualitative analysis of the results. For the\nexperiments on nominal compounds, we incorporate the detected compounds in a\nfull SMT pipeline and evaluate the impact of our method in machine translation\nprocess.", "published": "2014-06-16 11:30:51", "link": "http://arxiv.org/abs/1406.3976v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Towards an Error Correction Memory to Enhance Technical Texts Authoring\n  in LELIE", "abstract": "In this paper, we investigate and experiment the notion of error correction\nmemory applied to error correction in technical texts. The main purpose is to\ninduce relatively generic correction patterns associated with more contextual\ncorrection recommendations, based on previously memorized and analyzed\ncorrections. The notion of error correction memory is developed within the\nframework of the LELIE project and illustrated on the case of fuzzy lexical\nitems, which is a major problem in technical texts.", "published": "2014-06-16 12:03:49", "link": "http://arxiv.org/abs/1406.3987v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Embedded Controlled Languages", "abstract": "Inspired by embedded programming languages, an embedded CNL (controlled\nnatural language) is a proper fragment of an entire natural language (its host\nlanguage), but it has a parser that recognizes the entire host language. This\nmakes it possible to process out-of-CNL input and give useful feedback to\nusers, instead of just reporting syntax errors. This extended abstract explains\nthe main concepts of embedded CNL implementation in GF (Grammatical Framework),\nwith examples from machine translation and some other ongoing work.", "published": "2014-06-16 16:11:32", "link": "http://arxiv.org/abs/1406.4057v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "A Bengali HMM Based Speech Synthesis System", "abstract": "The paper presents the capability of an HMM-based TTS system to produce\nBengali speech. In this synthesis method, trajectories of speech parameters are\ngenerated from the trained Hidden Markov Models. A final speech waveform is\nsynthesized from those speech parameters. In our experiments, spectral\nproperties were represented by Mel Cepstrum Coefficients. Both the training and\nsynthesis issues are investigated in this paper using annotated Bengali speech\ndatabase. Experimental evaluation depicts that the developed text-to-speech\nsystem is capable of producing adequately natural speech in terms of\nintelligibility and intonation for Bengali.", "published": "2014-06-16 06:41:54", "link": "http://arxiv.org/abs/1406.3915v1", "categories": ["cs.SD", "cs.CL", "cs.MM"], "primary_category": "cs.SD"}
