{"title": "How Easy is it to Learn a Controlled Natural Language for Building a\n  Knowledge Base?", "abstract": "Recent developments in controlled natural language editors for knowledge\nengineering (KE) have given rise to expectations that they will make KE tasks\nmore accessible and perhaps even enable non-engineers to build knowledge bases.\nThis exploratory research focussed on novices and experts in knowledge\nengineering during their attempts to learn a controlled natural language (CNL)\nknown as OWL Simplified English and use it to build a small knowledge base.\nParticipants' behaviours during the task were observed through eye-tracking and\nscreen recordings. This was an attempt at a more ambitious user study than in\nprevious research because we used a naturally occurring text as the source of\ndomain knowledge, and left them without guidance on which information to\nselect, or how to encode it. We have identified a number of skills\n(competencies) required for this difficult task and key problems that authors\nface.", "published": "2014-06-09 14:54:22", "link": "http://arxiv.org/abs/1406.2204v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "RuleCNL: A Controlled Natural Language for Business Rule Specifications", "abstract": "Business rules represent the primary means by which companies define their\nbusiness, perform their actions in order to reach their objectives. Thus, they\nneed to be expressed unambiguously to avoid inconsistencies between business\nstakeholders and formally in order to be machine-processed. A promising\nsolution is the use of a controlled natural language (CNL) which is a good\nmediator between natural and formal languages. This paper presents RuleCNL,\nwhich is a CNL for defining business rules. Its core feature is the alignment\nof the business rule definition with the business vocabulary which ensures\ntraceability and consistency with the business domain. The RuleCNL tool\nprovides editors that assist end-users in the writing process and automatic\nmappings into the Semantics of Business Vocabulary and Business Rules (SBVR)\nstandard. SBVR is grounded in first order logic and includes constructs called\nsemantic formulations that structure the meaning of rules.", "published": "2014-06-09 07:19:53", "link": "http://arxiv.org/abs/1406.2096v1", "categories": ["cs.SE", "cs.CL"], "primary_category": "cs.SE"}
{"title": "Explaining Violation Traces with Finite State Natural Language\n  Generation Models", "abstract": "An essential element of any verification technique is that of identifying and\ncommunicating to the user, system behaviour which leads to a deviation from the\nexpected behaviour. Such behaviours are typically made available as long traces\nof system actions which would benefit from a natural language explanation of\nthe trace and especially in the context of business logic level specifications.\nIn this paper we present a natural language generation model which can be used\nto explain such traces. A key idea is that the explanation language is a CNL\nthat is, formally speaking, regular language susceptible transformations that\ncan be expressed with finite state machinery. At the same time it admits\nvarious forms of abstraction and simplification which contribute to the\nnaturalness of explanations that are communicated to the user.", "published": "2014-06-09 19:51:10", "link": "http://arxiv.org/abs/1406.2298v1", "categories": ["cs.SE", "cs.CL"], "primary_category": "cs.SE"}
