{"title": "Finding Eyewitness Tweets During Crises", "abstract": "Disaster response agencies have started to incorporate social media as a\nsource of fast-breaking information to understand the needs of people affected\nby the many crises that occur around the world. These agencies look for tweets\nfrom within the region affected by the crisis to get the latest updates of the\nstatus of the affected region. However only 1% of all tweets are geotagged with\nexplicit location information. First responders lose valuable information\nbecause they cannot assess the origin of many of the tweets they collect. In\nthis work we seek to identify non-geotagged tweets that originate from within\nthe crisis region. Towards this, we address three questions: (1) is there a\ndifference between the language of tweets originating within a crisis region\nand tweets originating outside the region, (2) what are the linguistic patterns\nthat can be used to differentiate within-region and outside-region tweets, and\n(3) for non-geotagged tweets, can we automatically identify those originating\nwithin the crisis region in real-time?", "published": "2014-03-07 15:13:13", "link": "http://arxiv.org/abs/1403.1773v1", "categories": ["cs.CL", "cs.CY"], "primary_category": "cs.CL"}
{"title": "Home Location Identification of Twitter Users", "abstract": "We present a new algorithm for inferring the home location of Twitter users\nat different granularities, including city, state, time zone or geographic\nregion, using the content of users tweets and their tweeting behavior. Unlike\nexisting approaches, our algorithm uses an ensemble of statistical and\nheuristic classifiers to predict locations and makes use of a geographic\ngazetteer dictionary to identify place-name entities. We find that a\nhierarchical classification approach, where time zone, state or geographic\nregion is predicted first and city is predicted next, can improve prediction\naccuracy. We have also analyzed movement variations of Twitter users, built a\nclassifier to predict whether a user was travelling in a certain period of time\nand use that to further improve the location detection accuracy. Experimental\nevidence suggests that our algorithm works well in practice and outperforms the\nbest existing algorithms for predicting the home location of Twitter users.", "published": "2014-03-07 05:29:42", "link": "http://arxiv.org/abs/1403.2345v1", "categories": ["cs.SI", "cs.CL", "cs.CY"], "primary_category": "cs.SI"}
