{"title": "Coordinate System Selection for Minimum Error Rate Training in\n  Statistical Machine Translation", "abstract": "Minimum error rate training (MERT) is a widely used training procedure for\nstatistical machine translation. A general problem of this approach is that the\nsearch space is easy to converge to a local optimum and the acquired weight set\nis not in accord with the real distribution of feature functions. This paper\nintroduces coordinate system selection (RSS) into the search algorithm for\nMERT. Contrary to previous approaches in which every dimension only corresponds\nto one independent feature function, we create several coordinate systems by\nmoving one of the dimensions to a new direction. The basic idea is quite simple\nbut critical that the training procedure of MERT should be based on a\ncoordinate system formed by search directions but not directly on feature\nfunctions. Experiments show that by selecting coordinate systems with tuning\nset results, better results can be obtained without any other language\nknowledge.", "published": "2014-05-10 13:55:03", "link": "http://arxiv.org/abs/1405.2434v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Predicting Central Topics in a Blog Corpus from a Networks Perspective", "abstract": "In today's content-centric Internet, blogs are becoming increasingly popular\nand important from a data analysis perspective. According to Wikipedia, there\nwere over 156 million public blogs on the Internet as of February 2011. Blogs\nare a reflection of our contemporary society. The contents of different blog\nposts are important from social, psychological, economical and political\nperspectives. Discovery of important topics in the blogosphere is an area which\nstill needs much exploring. We try to come up with a procedure using\nprobabilistic topic modeling and network centrality measures which identifies\nthe central topics in a blog corpus.", "published": "2014-05-10 03:43:14", "link": "http://arxiv.org/abs/1405.2386v1", "categories": ["cs.IR", "cs.CL", "cs.SI", "physics.soc-ph"], "primary_category": "cs.IR"}
