{"title": "Detecting Suicidal Ideation in Chinese Microblogs with Psychological\n  Lexicons", "abstract": "Suicide is among the leading causes of death in China. However, technical\napproaches toward preventing suicide are challenging and remaining under\ndevelopment. Recently, several actual suicidal cases were preceded by users who\nposted microblogs with suicidal ideation to Sina Weibo, a Chinese social media\nnetwork akin to Twitter. It would therefore be desirable to detect suicidal\nideations from microblogs in real-time, and immediately alert appropriate\nsupport groups, which may lead to successful prevention. In this paper, we\npropose a real-time suicidal ideation detection system deployed over Weibo,\nusing machine learning and known psychological techniques. Currently, we have\nidentified 53 known suicidal cases who posted suicide notes on Weibo prior to\ntheir deaths.We explore linguistic features of these known cases using a\npsychological lexicon dictionary, and train an effective suicidal Weibo post\ndetection model. 6714 tagged posts and several classifiers are used to verify\nthe model. By combining both machine learning and psychological knowledge, SVM\nclassifier has the best performance of different classifiers, yielding an\nF-measure of 68:3%, a Precision of 78:9%, and a Recall of 60:3%.", "published": "2014-11-04 03:48:20", "link": "http://arxiv.org/abs/1411.0778v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Using Linguistic Features to Estimate Suicide Probability of Chinese\n  Microblog Users", "abstract": "If people with high risk of suicide can be identified through social media\nlike microblog, it is possible to implement an active intervention system to\nsave their lives. Based on this motivation, the current study administered the\nSuicide Probability Scale(SPS) to 1041 weibo users at Sina Weibo, which is a\nleading microblog service provider in China. Two NLP (Natural Language\nProcessing) methods, the Chinese edition of Linguistic Inquiry and Word Count\n(LIWC) lexicon and Latent Dirichlet Allocation (LDA), are used to extract\nlinguistic features from the Sina Weibo data. We trained predicting models by\nmachine learning algorithm based on these two types of features, to estimate\nsuicide probability based on linguistic features. The experiment results\nindicate that LDA can find topics that relate to suicide probability, and\nimprove the performance of prediction. Our study adds value in prediction of\nsuicidal probability of social network users with their behaviors.", "published": "2014-11-04 11:06:01", "link": "http://arxiv.org/abs/1411.0861v1", "categories": ["cs.SI", "cs.CL"], "primary_category": "cs.SI"}
{"title": "Tied Probabilistic Linear Discriminant Analysis for Speech Recognition", "abstract": "Acoustic models using probabilistic linear discriminant analysis (PLDA)\ncapture the correlations within feature vectors using subspaces which do not\nvastly expand the model. This allows high dimensional and correlated feature\nspaces to be used, without requiring the estimation of multiple high dimension\ncovariance matrices. In this letter we extend the recently presented PLDA\nmixture model for speech recognition through a tied PLDA approach, which is\nbetter able to control the model size to avoid overfitting. We carried out\nexperiments using the Switchboard corpus, with both mel frequency cepstral\ncoefficient features and bottleneck feature derived from a deep neural network.\nReductions in word error rate were obtained by using tied PLDA, compared with\nthe PLDA mixture model, subspace Gaussian mixture models, and deep neural\nnetworks.", "published": "2014-11-04 13:11:06", "link": "http://arxiv.org/abs/1411.0895v1", "categories": ["cs.CL", "cs.AI"], "primary_category": "cs.CL"}
{"title": "A Probabilistic Translation Method for Dictionary-based Cross-lingual\n  Information Retrieval in Agglutinative Languages", "abstract": "Translation ambiguity, out of vocabulary words and missing some translations\nin bilingual dictionaries make dictionary-based Cross-language Information\nRetrieval (CLIR) a challenging task. Moreover, in agglutinative languages which\ndo not have reliable stemmers, missing various lexical formations in bilingual\ndictionaries degrades CLIR performance. This paper aims to introduce a\nprobabilistic translation model to solve the ambiguity problem, and also to\nprovide most likely formations of a dictionary candidate. We propose Minimum\nEdit Support Candidates (MESC) method that exploits a monolingual corpus and a\nbilingual dictionary to translate users' native language queries to documents'\nlanguage. Our experiments show that the proposed method outperforms\nstate-of-the-art dictionary-based English-Persian CLIR.", "published": "2014-11-04 19:15:59", "link": "http://arxiv.org/abs/1411.1006v2", "categories": ["cs.IR", "cs.CL"], "primary_category": "cs.IR"}
