{"title": "Using graph transformation algorithms to generate natural language\n  equivalents of icons expressing medical concepts", "abstract": "A graphical language addresses the need to communicate medical information in\na synthetic way. Medical concepts are expressed by icons conveying fast visual\ninformation about patients' current state or about the known effects of drugs.\nIn order to increase the visual language's acceptance and usability, a natural\nlanguage generation interface is currently developed. In this context, this\npaper describes the use of an informatics method ---graph transformation--- to\nprepare data consisting of concepts in an OWL-DL ontology for use in a natural\nlanguage generation component. The OWL concept may be considered as a\nstar-shaped graph with a central node. The method transforms it into a graph\nrepresenting the deep semantic structure of a natural language phrase. This\nwork may be of future use in other contexts where ontology concepts have to be\nmapped to half-formalized natural language expressions.", "published": "2014-09-26 05:09:40", "link": "http://arxiv.org/abs/1411.4614v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Topic Similarity Networks: Visual Analytics for Large Document Sets", "abstract": "We investigate ways in which to improve the interpretability of LDA topic\nmodels by better analyzing and visualizing their outputs. We focus on examining\nwhat we refer to as topic similarity networks: graphs in which nodes represent\nlatent topics in text collections and links represent similarity among topics.\nWe describe efficient and effective approaches to both building and labeling\nsuch networks. Visualizations of topic models based on these networks are shown\nto be a powerful means of exploring, characterizing, and summarizing large\ncollections of unstructured text documents. They help to \"tease out\"\nnon-obvious connections among different sets of documents and provide insights\ninto how topics form larger themes. We demonstrate the efficacy and\npracticality of these approaches through two case studies: 1) NSF grants for\nbasic research spanning a 14 year period and 2) the entire English portion of\nWikipedia.", "published": "2014-09-26 15:11:57", "link": "http://arxiv.org/abs/1409.7591v1", "categories": ["cs.CL", "cs.HC", "cs.IR", "cs.SI", "stat.ML", "I.2.6; I.2.7; H.5.2"], "primary_category": "cs.CL"}
