{"title": "Authorship detection of SMS messages using unigrams", "abstract": "SMS messaging is a popular media of communication. Because of its popularity\nand privacy, it could be used for many illegal purposes. Additionally, since\nthey are part of the day to day life, SMSes can be used as evidence for many\nlegal disputes. Since a cellular phone might be accessible to people close to\nthe owner, it is important to establish the fact that the sender of the message\nis indeed the owner of the phone. For this purpose, the straight forward\nsolutions seem to be the use of popular stylometric methods. However, in\ncomparison with the data used for stylometry in the literature, SMSes have\nunusual characteristics making it hard or impossible to apply these methods in\na conventional way. Our target is to come up with a method of authorship\ndetection of SMS messages that could still give a usable accuracy. We argue\nthat, considering the methods of author attribution, the best method that could\nbe applied to SMS messages is an n-gram method. To prove our point, we checked\ntwo different methods of distribution comparison with varying number of\ntraining and testing data. We specifically try to compare how well our\nalgorithms work under less amount of testing data and large number of candidate\nauthors (which we believe to be the real world scenario) against controlled\ntests with less number of authors and selected SMSes with large number of\nwords. To counter the lack of information in an SMS message, we propose the\nmethod of stacking together few SMSes.", "published": "2014-03-06 01:33:55", "link": "http://arxiv.org/abs/1403.1314v1", "categories": ["cs.CL", "cs.IR"], "primary_category": "cs.CL"}
{"title": "Design a Persian Automated Plagiarism Detector (AMZPPD)", "abstract": "Currently there are lots of plagiarism detection approaches. But few of them\nimplemented and adapted for Persian languages. In this paper, our work on\ndesigning and implementation of a plagiarism detection system based on\npre-processing and NLP technics will be described. And the results of testing\non a corpus will be presented.", "published": "2014-03-06 22:57:29", "link": "http://arxiv.org/abs/1403.1618v1", "categories": ["cs.AI", "cs.CL"], "primary_category": "cs.AI"}
{"title": "Inducing Language Networks from Continuous Space Word Representations", "abstract": "Recent advancements in unsupervised feature learning have developed powerful\nlatent representations of words. However, it is still not clear what makes one\nrepresentation better than another and how we can learn the ideal\nrepresentation. Understanding the structure of latent spaces attained is key to\nany future advancement in unsupervised learning. In this work, we introduce a\nnew view of continuous space word representations as language networks. We\nexplore two techniques to create language networks from learned features by\ninducing them for two popular word representation methods and examining the\nproperties of their resulting networks. We find that the induced networks\ndiffer from other methods of creating language networks, and that they contain\nmeaningful community structure.", "published": "2014-03-06 01:36:53", "link": "http://arxiv.org/abs/1403.1252v2", "categories": ["cs.LG", "cs.CL", "cs.SI"], "primary_category": "cs.LG"}
{"title": "AntiPlag: Plagiarism Detection on Electronic Submissions of Text Based\n  Assignments", "abstract": "Plagiarism is one of the growing issues in academia and is always a concern\nin Universities and other academic institutions. The situation is becoming even\nworse with the availability of ample resources on the web. This paper focuses\non creating an effective and fast tool for plagiarism detection for text based\nelectronic assignments. Our plagiarism detection tool named AntiPlag is\ndeveloped using the tri-gram sequence matching technique. Three sets of text\nbased assignments were tested by AntiPlag and the results were compared against\nan existing commercial plagiarism detection tool. AntiPlag showed better\nresults in terms of false positives compared to the commercial tool due to the\npre-processing steps performed in AntiPlag. In addition, to improve the\ndetection latency, AntiPlag applies a data clustering technique making it four\ntimes faster than the commercial tool considered. AntiPlag could be used to\nisolate plagiarized text based assignments from non-plagiarised assignments\neasily. Therefore, we present AntiPlag, a fast and effective tool for\nplagiarism detection on text based electronic assignments.", "published": "2014-03-06 01:16:01", "link": "http://arxiv.org/abs/1403.1310v1", "categories": ["cs.IR", "cs.CL", "cs.DL"], "primary_category": "cs.IR"}
{"title": "Learning Soft Linear Constraints with Application to Citation Field\n  Extraction", "abstract": "Accurately segmenting a citation string into fields for authors, titles, etc.\nis a challenging task because the output typically obeys various global\nconstraints. Previous work has shown that modeling soft constraints, where the\nmodel is encouraged, but not require to obey the constraints, can substantially\nimprove segmentation performance. On the other hand, for imposing hard\nconstraints, dual decomposition is a popular technique for efficient prediction\ngiven existing algorithms for unconstrained inference. We extend the technique\nto perform prediction subject to soft constraints. Moreover, with a technique\nfor performing inference given soft constraints, it is easy to automatically\ngenerate large families of constraints and learn their costs with a simple\nconvex optimization problem during training. This allows us to obtain\nsubstantial gains in accuracy on a new, challenging citation extraction\ndataset.", "published": "2014-03-06 05:24:02", "link": "http://arxiv.org/abs/1403.1349v2", "categories": ["cs.CL", "cs.DL", "cs.IR"], "primary_category": "cs.CL"}
{"title": "Real-Time Classification of Twitter Trends", "abstract": "Social media users give rise to social trends as they share about common\ninterests, which can be triggered by different reasons. In this work, we\nexplore the types of triggers that spark trends on Twitter, introducing a\ntypology with following four types: 'news', 'ongoing events', 'memes', and\n'commemoratives'. While previous research has analyzed trending topics in a\nlong term, we look at the earliest tweets that produce a trend, with the aim of\ncategorizing trends early on. This would allow to provide a filtered subset of\ntrends to end users. We analyze and experiment with a set of straightforward\nlanguage-independent features based on the social spread of trends to\ncategorize them into the introduced typology. Our method provides an efficient\nway to accurately categorize trending topics without need of external data,\nenabling news organizations to discover breaking news in real-time, or to\nquickly identify viral memes that might enrich marketing decisions, among\nothers. The analysis of social features also reveals patterns associated with\neach type of trend, such as tweets about ongoing events being shorter as many\nwere likely sent from mobile devices, or memes having more retweets originating\nfrom a few trend-setters.", "published": "2014-03-06 14:23:53", "link": "http://arxiv.org/abs/1403.1451v1", "categories": ["cs.IR", "cs.CL", "cs.SI"], "primary_category": "cs.IR"}
