{"title": "A Robust Transformation-Based Learning Approach Using Ripple Down Rules\n  for Part-of-Speech Tagging", "abstract": "In this paper, we propose a new approach to construct a system of\ntransformation rules for the Part-of-Speech (POS) tagging task. Our approach is\nbased on an incremental knowledge acquisition method where rules are stored in\nan exception structure and new rules are only added to correct the errors of\nexisting rules; thus allowing systematic control of the interaction between the\nrules. Experimental results on 13 languages show that our approach is fast in\nterms of training time and tagging speed. Furthermore, our approach obtains\nvery competitive accuracy in comparison to state-of-the-art POS and\nmorphological taggers.", "published": "2014-12-12 15:26:43", "link": "http://arxiv.org/abs/1412.4021v5", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Ripple Down Rules for Question Answering", "abstract": "Recent years have witnessed a new trend of building ontology-based question\nanswering systems. These systems use semantic web information to produce more\nprecise answers to users' queries. However, these systems are mostly designed\nfor English. In this paper, we introduce an ontology-based question answering\nsystem named KbQAS which, to the best of our knowledge, is the first one made\nfor Vietnamese. KbQAS employs our question analysis approach that\nsystematically constructs a knowledge base of grammar rules to convert each\ninput question into an intermediate representation element. KbQAS then takes\nthe intermediate representation element with respect to a target ontology and\napplies concept-matching techniques to return an answer. On a wide range of\nVietnamese questions, experimental results show that the performance of KbQAS\nis promising with accuracies of 84.1% and 82.4% for analyzing input questions\nand retrieving output answers, respectively. Furthermore, our question analysis\napproach can easily be applied to new domains and new languages, thus saving\ntime and human effort.", "published": "2014-12-12 23:30:06", "link": "http://arxiv.org/abs/1412.4160v4", "categories": ["cs.CL", "cs.IR"], "primary_category": "cs.CL"}
