{"title": "Understanding Zipf's law of word frequencies through sample-space\n  collapse in sentence formation", "abstract": "The formation of sentences is a highly structured and history-dependent\nprocess. The probability of using a specific word in a sentence strongly\ndepends on the 'history' of word-usage earlier in that sentence. We study a\nsimple history-dependent model of text generation assuming that the\nsample-space of word usage reduces along sentence formation, on average. We\nfirst show that the model explains the approximate Zipf law found in word\nfrequencies as a direct consequence of sample-space reduction. We then\nempirically quantify the amount of sample-space reduction in the sentences of\nten famous English books, by analysis of corresponding word-transition tables\nthat capture which words can follow any given word in a text. We find a highly\nnested structure in these transition tables and show that this `nestedness' is\ntightly related to the power law exponents of the observed word frequency\ndistributions. With the proposed model it is possible to understand that the\nnestedness of a text can be the origin of the actual scaling exponent, and that\ndeviations from the exact Zipf law can be understood by variations of the\ndegree of nestedness on a book-by-book basis. On a theoretical level we are\nable to show that in case of weak nesting, Zipf's law breaks down in a fast\ntransition. Unlike previous attempts to understand Zipf's law in language the\nsample-space reducing model is not based on assumptions of multiplicative,\npreferential, or self-organised critical mechanisms behind language formation,\nbut simply used the empirically quantifiable parameter 'nestedness' to\nunderstand the statistics of word frequencies.", "published": "2014-07-17 09:38:07", "link": "http://arxiv.org/abs/1407.4610v2", "categories": ["physics.soc-ph", "cs.CL"], "primary_category": "physics.soc-ph"}
{"title": "Toward Selectivity Based Keyword Extraction for Croatian News", "abstract": "Preliminary report on network based keyword extraction for Croatian is an\nunsupervised method for keyword extraction from the complex network. We build\nour approach with a new network measure the node selectivity, motivated by the\nresearch of the graph based centrality approaches. The node selectivity is\ndefined as the average weight distribution on the links of the single node. We\nextract nodes (keyword candidates) based on the selectivity value. Furthermore,\nwe expand extracted nodes to word-tuples ranked with the highest in/out\nselectivity values. Selectivity based extraction does not require linguistic\nknowledge while it is purely derived from statistical and structural\ninformation en-compassed in the source text which is reflected into the\nstructure of the network. Obtained sets are evaluated on a manually annotated\nkeywords: for the set of extracted keyword candidates average F1 score is\n24,63%, and average F2 score is 21,19%; for the exacted words-tuples candidates\naverage F1 score is 25,9% and average F2 score is 24,47%.", "published": "2014-07-17 16:12:04", "link": "http://arxiv.org/abs/1407.4723v1", "categories": ["cs.CL", "cs.IR", "cs.SI"], "primary_category": "cs.CL"}
