{"title": "Strongly Incremental Repair Detection", "abstract": "We present STIR (STrongly Incremental Repair detection), a system that\ndetects speech repairs and edit terms on transcripts incrementally with minimal\nlatency. STIR uses information-theoretic measures from n-gram models as its\nprincipal decision features in a pipeline of classifiers detecting the\ndifferent stages of repairs. Results on the Switchboard disfluency tagged\ncorpus show utterance-final accuracy on a par with state-of-the-art incremental\nrepair detection methods, but with better incremental accuracy, faster\ntime-to-detection and less computational overhead. We evaluate its performance\nusing incremental metrics and propose new repair processing evaluation\nstandards.", "published": "2014-08-28 17:29:55", "link": "http://arxiv.org/abs/1408.6788v2", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Non-Standard Words as Features for Text Categorization", "abstract": "This paper presents categorization of Croatian texts using Non-Standard Words\n(NSW) as features. Non-Standard Words are: numbers, dates, acronyms,\nabbreviations, currency, etc. NSWs in Croatian language are determined\naccording to Croatian NSW taxonomy. For the purpose of this research, 390 text\ndocuments were collected and formed the SKIPEZ collection with 6 classes:\nofficial, literary, informative, popular, educational and scientific. Text\ncategorization experiment was conducted on three different representations of\nthe SKIPEZ collection: in the first representation, the frequencies of NSWs are\nused as features; in the second representation, the statistic measures of NSWs\n(variance, coefficient of variation, standard deviation, etc.) are used as\nfeatures; while the third representation combines the first two feature sets.\nNaive Bayes, CN2, C4.5, kNN, Classification Trees and Random Forest algorithms\nwere used in text categorization experiments. The best categorization results\nare achieved using the first feature set (NSW frequencies) with the\ncategorization accuracy of 87%. This suggests that the NSWs should be\nconsidered as features in highly inflectional languages, such as Croatian. NSW\nbased features reduce the dimensionality of the feature space without standard\nlemmatization procedures, and therefore the bag-of-NSWs should be considered\nfor further Croatian texts categorization experiments.", "published": "2014-08-28 15:06:50", "link": "http://arxiv.org/abs/1408.6746v2", "categories": ["cs.CL", "cs.LG"], "primary_category": "cs.CL"}
{"title": "Chatbot for admissions", "abstract": "The communication of potential students with a university department is\nperformed manually and it is a very time consuming procedure. The opportunity\nto communicate with on a one-to-one basis is highly valued. However with many\nhundreds of applications each year, one-to-one conversations are not feasible\nin most cases. The communication will require a member of academic staff to\nexpend several hours to find suitable answers and contact each student. It\nwould be useful to reduce his costs and time.\n  The project aims to reduce the burden on the head of admissions, and\npotentially other users, by developing a convincing chatbot. A suitable\nalgorithm must be devised to search through the set of data and find a\npotential answer. The program then replies to the user and provides a relevant\nweb link if the user is not satisfied by the answer. Furthermore a web\ninterface is provided for both users and an administrator.\n  The achievements of the project can be summarised as follows. To prepare the\nbackground of the project a literature review was undertaken, together with an\ninvestigation of existing tools, and consultation with the head of admissions.\nThe requirements of the system were established and a range of algorithms and\ntools were investigated, including keyword and template matching. An algorithm\nthat combines keyword matching with string similarity has been developed. A\nusable system using the proposed algorithm has been implemented. The system was\nevaluated by keeping logs of questions and answers and by feedback received by\npotential students that used it.", "published": "2014-08-28 16:01:10", "link": "http://arxiv.org/abs/1408.6762v1", "categories": ["cs.CY", "cs.CL"], "primary_category": "cs.CY"}
