{"title": "Experiments with Three Approaches to Recognizing Lexical Entailment", "abstract": "Inference in natural language often involves recognizing lexical entailment\n(RLE); that is, identifying whether one word entails another. For example,\n\"buy\" entails \"own\". Two general strategies for RLE have been proposed: One\nstrategy is to manually construct an asymmetric similarity measure for context\nvectors (directional similarity) and another is to treat RLE as a problem of\nlearning to recognize semantic relations using supervised machine learning\ntechniques (relation classification). In this paper, we experiment with two\nrecent state-of-the-art representatives of the two general strategies. The\nfirst approach is an asymmetric similarity measure (an instance of the\ndirectional similarity strategy), designed to capture the degree to which the\ncontexts of a word, a, form a subset of the contexts of another word, b. The\nsecond approach (an instance of the relation classification strategy)\nrepresents a word pair, a:b, with a feature vector that is the concatenation of\nthe context vectors of a and b, and then applies supervised learning to a\ntraining set of labeled feature vectors. Additionally, we introduce a third\napproach that is a new instance of the relation classification strategy. The\nthird approach represents a word pair, a:b, with a feature vector in which the\nfeatures are the differences in the similarities of a and b to a set of\nreference words. All three approaches use vector space models (VSMs) of\nsemantics, based on word-context matrices. We perform an extensive evaluation\nof the three approaches using three different datasets. The proposed new\napproach (similarity differences) performs significantly better than the other\ntwo approaches on some datasets and there is no dataset for which it is\nsignificantly worse. Our results suggest it is beneficial to make connections\nbetween the research in lexical entailment and the research in semantic\nrelation classification.", "published": "2014-01-31 19:42:19", "link": "http://arxiv.org/abs/1401.8269v1", "categories": ["cs.CL", "cs.AI", "cs.LG", "H.3.1; I.2.6; I.2.7"], "primary_category": "cs.CL"}
