{"title": "Pre-processing of Domain Ontology Graph Generation System in Punjabi", "abstract": "This paper describes pre-processing phase of ontology graph generation system\nfrom Punjabi text documents of different domains. This research paper focuses\non pre-processing of Punjabi text documents. Pre-processing is structured\nrepresentation of the input text. Pre-processing of ontology graph generation\nincludes allowing input restrictions to the text, removal of special symbols\nand punctuation marks, removal of duplicate terms, removal of stop words,\nextract terms by matching input terms with dictionary and gazetteer lists\nterms.", "published": "2014-11-21 08:50:30", "link": "http://arxiv.org/abs/1411.5796v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "A Joint Probabilistic Classification Model of Relevant and Irrelevant\n  Sentences in Mathematical Word Problems", "abstract": "Estimating the difficulty level of math word problems is an important task\nfor many educational applications. Identification of relevant and irrelevant\nsentences in math word problems is an important step for calculating the\ndifficulty levels of such problems. This paper addresses a novel application of\ntext categorization to identify two types of sentences in mathematical word\nproblems, namely relevant and irrelevant sentences. A novel joint probabilistic\nclassification model is proposed to estimate the joint probability of\nclassification decisions for all sentences of a math word problem by utilizing\nthe correlation among all sentences along with the correlation between the\nquestion sentence and other sentences, and sentence text. The proposed model is\ncompared with i) a SVM classifier which makes independent classification\ndecisions for individual sentences by only using the sentence text and ii) a\nnovel SVM classifier that considers the correlation between the question\nsentence and other sentences along with the sentence text. An extensive set of\nexperiments demonstrates the effectiveness of the joint probabilistic\nclassification model for identifying relevant and irrelevant sentences as well\nas the novel SVM classifier that utilizes the correlation between the question\nsentence and other sentences. Furthermore, empirical results and analysis show\nthat i) it is highly beneficial not to remove stopwords and ii) utilizing part\nof speech tagging does not make a significant improvement although it has been\nshown to be effective for the related task of math word problem type\nclassification.", "published": "2014-11-21 00:53:02", "link": "http://arxiv.org/abs/1411.5732v1", "categories": ["cs.CL", "cs.IR", "cs.LG", "stat.ML"], "primary_category": "cs.CL"}
