{"title": "Les noms propres se traduisent-ils ? Étude d'un corpus multilingue", "abstract": "In this paper, we tackle the problem of the translation of proper names. We\nintroduce our hypothesis according to which proper names can be translated more\noften than most people seem to think. Then, we describe the construction of a\nparallel multilingual corpus used to illustrate our point. We eventually\nevaluate both the advantages and limits of this corpus in our study.", "published": "2014-07-07 07:08:07", "link": "http://arxiv.org/abs/1407.1605v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "WordRep: A Benchmark for Research on Learning Word Representations", "abstract": "WordRep is a benchmark collection for the research on learning distributed\nword representations (or word embeddings), released by Microsoft Research. In\nthis paper, we describe the details of the WordRep collection and show how to\nuse it in different types of machine learning research related to word\nembedding. Specifically, we describe how the evaluation tasks in WordRep are\nselected, how the data are sampled, and how the evaluation tool is built. We\nthen compare several state-of-the-art word representations on WordRep, report\ntheir evaluation performance, and make discussions on the results. After that,\nwe discuss new potential research topics that can be supported by WordRep, in\naddition to algorithm comparison. We hope that this paper can help people gain\ndeeper understanding of WordRep, and enable more interesting research on\nlearning distributed word representations and related topics.", "published": "2014-07-07 09:31:21", "link": "http://arxiv.org/abs/1407.1640v1", "categories": ["cs.CL", "cs.LG"], "primary_category": "cs.CL"}
{"title": "KNET: A General Framework for Learning Word Embedding using\n  Morphological Knowledge", "abstract": "Neural network techniques are widely applied to obtain high-quality\ndistributed representations of words, i.e., word embeddings, to address text\nmining, information retrieval, and natural language processing tasks. Recently,\nefficient methods have been proposed to learn word embeddings from context that\ncaptures both semantic and syntactic relationships between words. However, it\nis challenging to handle unseen words or rare words with insufficient context.\nIn this paper, inspired by the study on word recognition process in cognitive\npsychology, we propose to take advantage of seemingly less obvious but\nessentially important morphological knowledge to address these challenges. In\nparticular, we introduce a novel neural network architecture called KNET that\nleverages both contextual information and morphological word similarity built\nbased on morphological knowledge to learn word embeddings. Meanwhile, the\nlearning architecture is also able to refine the pre-defined morphological\nknowledge and obtain more accurate word similarity. Experiments on an\nanalogical reasoning task and a word similarity task both demonstrate that the\nproposed KNET framework can greatly enhance the effectiveness of word\nembeddings.", "published": "2014-07-07 12:45:10", "link": "http://arxiv.org/abs/1407.1687v3", "categories": ["cs.CL", "cs.LG"], "primary_category": "cs.CL"}
