{"title": "Dependent Types for Pragmatics", "abstract": "This paper proposes the use of dependent types for pragmatic phenomena such\nas pronoun binding and presupposition resolution as a type-theoretic\nalternative to formalisms such as Discourse Representation Theory and Dynamic\nSemantics.", "published": "2014-10-17 05:19:12", "link": "http://arxiv.org/abs/1410.4639v3", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Arabic Language Text Classification Using Dependency Syntax-Based\n  Feature Selection", "abstract": "We study the performance of Arabic text classification combining various\ntechniques: (a) tfidf vs. dependency syntax, for feature selection and\nweighting; (b) class association rules vs. support vector machines, for\nclassification. The Arabic text is used in two forms: rootified and lightly\nstemmed. The results we obtain show that lightly stemmed text leads to better\nperformance than rootified text; that class association rules are better suited\nfor small feature sets obtained by dependency syntax constraints; and, finally,\nthat support vector machines are better suited for large feature sets based on\nmorphological feature selection criteria.", "published": "2014-10-17 21:05:01", "link": "http://arxiv.org/abs/1410.4863v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "A Modality Lexicon and its use in Automatic Tagging", "abstract": "This paper describes our resource-building results for an eight-week JHU\nHuman Language Technology Center of Excellence Summer Camp for Applied Language\nExploration (SCALE-2009) on Semantically-Informed Machine Translation.\nSpecifically, we describe the construction of a modality annotation scheme, a\nmodality lexicon, and two automated modality taggers that were built using the\nlexicon and annotation scheme. Our annotation scheme is based on identifying\nthree components of modality: a trigger, a target and a holder. We describe how\nour modality lexicon was produced semi-automatically, expanding from an initial\nhand-selected list of modality trigger words and phrases. The resulting\nexpanded modality lexicon is being made publicly available. We demonstrate that\none tagger---a structure-based tagger---results in precision around 86%\n(depending on genre) for tagging of a standard LDC data set. In a machine\ntranslation application, using the structure-based tagger to annotate English\nmodalities on an English-Urdu training corpus improved the translation quality\nscore for Urdu by 0.3 Bleu points in the face of sparse training data.", "published": "2014-10-17 21:19:15", "link": "http://arxiv.org/abs/1410.4868v1", "categories": ["cs.CL", "I.2.7"], "primary_category": "cs.CL"}
