{"title": "Optimality Theory as a Framework for Lexical Acquisition", "abstract": "This paper re-investigates a lexical acquisition system initially developed\nfor French.We show that, interestingly, the architecture of the system\nreproduces and implements the main components of Optimality Theory. However, we\nformulate the hypothesis that some of its limitations are mainly due to a poor\nrepresentation of the constraints used. Finally, we show how a better\nrepresentation of the constraints used would yield better results.", "published": "2014-05-26 18:51:06", "link": "http://arxiv.org/abs/1405.6682v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Inferring gender of a Twitter user using celebrities it follows", "abstract": "This paper addresses the task of user gender classification in social media,\nwith an application to Twitter. The approach automatically predicts gender by\nleveraging observable information such as the tweet behavior, linguistic\ncontent of the user's Twitter feed and the celebrities followed by the user.\nThis paper first evaluates linguistic content based features using LIWC\ndictionary and popular neighborhood features using Wikipedia and Freebase. Then\naugments both features which yielded a significant increase in the accuracy for\ngender prediction. Results show that rich linguistic features combined with\npopular neighborhood prove valuables and promising for additional user\nclassification needs.", "published": "2014-05-26 18:25:35", "link": "http://arxiv.org/abs/1405.6667v1", "categories": ["cs.IR", "cs.CL"], "primary_category": "cs.IR"}
{"title": "Hybrid Type-Logical Grammars, First-Order Linear Logic and the\n  Descriptive Inadequacy of Lambda Grammars", "abstract": "In this article we show that hybrid type-logical grammars are a fragment of\nfirst-order linear logic. This embedding result has several important\nconsequences: it not only provides a simple new proof theory for the calculus,\nthereby clarifying the proof-theoretic foundations of hybrid type-logical\ngrammars, but, since the translation is simple and direct, it also provides\nseveral new parsing strategies for hybrid type-logical grammars. Second,\nNP-completeness of hybrid type-logical grammars follows immediately. The main\nembedding result also sheds new light on problems with lambda grammars/abstract\ncategorial grammars and shows lambda grammars/abstract categorial grammars\nsuffer from problems of over-generation and from problems at the\nsyntax-semantics interface unlike any other categorial grammar.", "published": "2014-05-26 18:48:15", "link": "http://arxiv.org/abs/1405.6678v1", "categories": ["cs.LO", "cs.CL"], "primary_category": "cs.LO"}
