{"title": "Hybrid approaches for automatic vowelization of Arabic texts", "abstract": "Hybrid approaches for automatic vowelization of Arabic texts are presented in\nthis article. The process is made up of two modules. In the first one, a\nmorphological analysis of the text words is performed using the open source\nmorphological Analyzer AlKhalil Morpho Sys. Outputs for each word analyzed out\nof context, are its different possible vowelizations. The integration of this\nAnalyzer in our vowelization system required the addition of a lexical database\ncontaining the most frequent words in Arabic language. Using a statistical\napproach based on two hidden Markov models (HMM), the second module aims to\neliminate the ambiguities. Indeed, for the first HMM, the unvowelized Arabic\nwords are the observed states and the vowelized words are the hidden states.\nThe observed states of the second HMM are identical to those of the first, but\nthe hidden states are the lists of possible diacritics of the word without its\nArabic letters. Our system uses Viterbi algorithm to select the optimal path\namong the solutions proposed by Al Khalil Morpho Sys. Our approach opens an\nimportant way to improve the performance of automatic vowelization of Arabic\ntexts for other uses in automatic natural language processing.", "published": "2014-10-09 22:56:44", "link": "http://arxiv.org/abs/1410.2646v1", "categories": ["cs.CL", "68T50"], "primary_category": "cs.CL"}
{"title": "BilBOWA: Fast Bilingual Distributed Representations without Word\n  Alignments", "abstract": "We introduce BilBOWA (Bilingual Bag-of-Words without Alignments), a simple\nand computationally-efficient model for learning bilingual distributed\nrepresentations of words which can scale to large monolingual datasets and does\nnot require word-aligned parallel training data. Instead it trains directly on\nmonolingual data and extracts a bilingual signal from a smaller set of raw-text\nsentence-aligned data. This is achieved using a novel sampled bag-of-words\ncross-lingual objective, which is used to regularize two noise-contrastive\nlanguage models for efficient cross-lingual feature learning. We show that\nbilingual embeddings learned using the proposed model outperform\nstate-of-the-art methods on a cross-lingual document classification task as\nwell as a lexical translation task on WMT11 data.", "published": "2014-10-09 13:41:18", "link": "http://arxiv.org/abs/1410.2455v3", "categories": ["stat.ML", "cs.CL", "cs.LG"], "primary_category": "stat.ML"}
{"title": "Spatial Diffuseness Features for DNN-Based Speech Recognition in Noisy\n  and Reverberant Environments", "abstract": "We propose a spatial diffuseness feature for deep neural network (DNN)-based\nautomatic speech recognition to improve recognition accuracy in reverberant and\nnoisy environments. The feature is computed in real-time from multiple\nmicrophone signals without requiring knowledge or estimation of the direction\nof arrival, and represents the relative amount of diffuse noise in each time\nand frequency bin. It is shown that using the diffuseness feature as an\nadditional input to a DNN-based acoustic model leads to a reduced word error\nrate for the REVERB challenge corpus, both compared to logmelspec features\nextracted from noisy signals, and features enhanced by spectral subtraction.", "published": "2014-10-09 14:15:42", "link": "http://arxiv.org/abs/1410.2479v2", "categories": ["cs.CL", "cs.NE", "cs.SD", "stat.ML"], "primary_category": "cs.CL"}
