{"title": "Semantic Unification A sheaf theoretic approach to natural language", "abstract": "Language is contextual and sheaf theory provides a high level mathematical\nframework to model contextuality. We show how sheaf theory can model the\ncontextual nature of natural language and how gluing can be used to provide a\nglobal semantics for a discourse by putting together the local logical\nsemantics of each sentence within the discourse. We introduce a presheaf\nstructure corresponding to a basic form of Discourse Representation Structures.\nWithin this setting, we formulate a notion of semantic unification --- gluing\nmeanings of parts of a discourse into a coherent whole --- as a form of\nsheaf-theoretic gluing. We illustrate this idea with a number of examples where\nit can used to represent resolutions of anaphoric references. We also discuss\nmultivalued gluing, described using a distributions functor, which can be used\nto represent situations where multiple gluings are possible, and where we may\nneed to rank them using quantitative measures.\n  Dedicated to Jim Lambek on the occasion of his 90th birthday.", "published": "2014-03-13 18:20:10", "link": "http://arxiv.org/abs/1403.3351v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "ARSENAL: Automatic Requirements Specification Extraction from Natural\n  Language", "abstract": "Requirements are informal and semi-formal descriptions of the expected\nbehavior of a complex system from the viewpoints of its stakeholders\n(customers, users, operators, designers, and engineers). However, for the\npurpose of design, testing, and verification for critical systems, we can\ntransform requirements into formal models that can be analyzed automatically.\nARSENAL is a framework and methodology for systematically transforming natural\nlanguage (NL) requirements into analyzable formal models and logic\nspecifications. These models can be analyzed for consistency and\nimplementability. The ARSENAL methodology is specialized to individual domains,\nbut the approach is general enough to be adapted to new domains.", "published": "2014-03-13 01:07:32", "link": "http://arxiv.org/abs/1403.3142v3", "categories": ["cs.CL", "cs.SE"], "primary_category": "cs.CL"}
{"title": "Sentiment Analysis by Using Fuzzy Logic", "abstract": "How could a product or service is reasonably evaluated by anyone in the\nshortest time? A million dollar question but it is having a simple answer:\nSentiment analysis. Sentiment analysis is consumers review on products and\nservices which helps both the producers and consumers (stakeholders) to take\neffective and efficient decision within a shortest period of time. Producers\ncan have better knowledge of their products and services through the sentiment\nanalysis (ex. positive and negative comments or consumers likes and dislikes)\nwhich will help them to know their products status (ex. product limitations or\nmarket status). Consumers can have better knowledge of their interested\nproducts and services through the sentiment analysis (ex. positive and negative\ncomments or consumers likes and dislikes) which will help them to know their\ndeserving products status (ex. product limitations or market status). For more\nspecification of the sentiment values, fuzzy logic could be introduced.\nTherefore, sentiment analysis with the help of fuzzy logic (deals with\nreasoning and gives closer views to the exact sentiment values) will help the\nproducers or consumers or any interested person for taking the effective\ndecision according to their product or service interest.", "published": "2014-03-13 07:48:15", "link": "http://arxiv.org/abs/1403.3185v1", "categories": ["cs.IR", "cs.CL"], "primary_category": "cs.IR"}
{"title": "Scalable and Robust Construction of Topical Hierarchies", "abstract": "Automated generation of high-quality topical hierarchies for a text\ncollection is a dream problem in knowledge engineering with many valuable\napplications. In this paper a scalable and robust algorithm is proposed for\nconstructing a hierarchy of topics from a text collection. We divide and\nconquer the problem using a top-down recursive framework, based on a tensor\northogonal decomposition technique. We solve a critical challenge to perform\nscalable inference for our newly designed hierarchical topic model. Experiments\nwith various real-world datasets illustrate its ability to generate robust,\nhigh-quality hierarchies efficiently. Our method reduces the time of\nconstruction by several orders of magnitude, and its robust feature renders it\npossible for users to interactively revise the hierarchy.", "published": "2014-03-13 23:22:21", "link": "http://arxiv.org/abs/1403.3460v1", "categories": ["cs.LG", "cs.CL", "cs.DB", "cs.IR"], "primary_category": "cs.LG"}
