{"title": "Thematically Reinforced Explicit Semantic Analysis", "abstract": "We present an extended, thematically reinforced version of Gabrilovich and\nMarkovitch's Explicit Semantic Analysis (ESA), where we obtain thematic\ninformation through the category structure of Wikipedia. For this we first\ndefine a notion of categorical tfidf which measures the relevance of terms in\ncategories. Using this measure as a weight we calculate a maximal spanning tree\nof the Wikipedia corpus considered as a directed graph of pages and categories.\nThis tree provides us with a unique path of \"most related categories\" between\neach page and the top of the hierarchy. We reinforce tfidf of words in a page\nby aggregating it with categorical tfidfs of the nodes of these paths, and\ndefine a thematically reinforced ESA semantic relatedness measure which is more\nrobust than standard ESA and less sensitive to noise caused by out-of-context\nwords. We apply our method to the French Wikipedia corpus, evaluate it through\na text classification on a 37.5 MB corpus of 20 French newsgroups and obtain a\nprecision increase of 9-10% compared with standard ESA.", "published": "2014-05-17 07:58:58", "link": "http://arxiv.org/abs/1405.4364v1", "categories": ["cs.CL", "68T50"], "primary_category": "cs.CL"}
{"title": "That's sick dude!: Automatic identification of word sense change across\n  different timescales", "abstract": "In this paper, we propose an unsupervised method to identify noun sense\nchanges based on rigorous analysis of time-varying text data available in the\nform of millions of digitized books. We construct distributional thesauri based\nnetworks from data at different time points and cluster each of them separately\nto obtain word-centric sense clusters corresponding to the different time\npoints. Subsequently, we compare these sense clusters of two different time\npoints to find if (i) there is birth of a new sense or (ii) if an older sense\nhas got split into more than one sense or (iii) if a newer sense has been\nformed from the joining of older senses or (iv) if a particular sense has died.\nWe conduct a thorough evaluation of the proposed methodology both manually as\nwell as through comparison with WordNet. Manual evaluation indicates that the\nalgorithm could correctly identify 60.4% birth cases from a set of 48 randomly\npicked samples and 57% split/join cases from a set of 21 randomly picked\nsamples. Remarkably, in 44% cases the birth of a novel sense is attested by\nWordNet, while in 46% cases and 43% cases split and join are respectively\nconfirmed by WordNet. Our approach can be applied for lexicography, as well as\nfor applications like word sense disambiguation or semantic search.", "published": "2014-05-17 13:29:13", "link": "http://arxiv.org/abs/1405.4392v1", "categories": ["cs.CL", "cs.AI", "68T50"], "primary_category": "cs.CL"}
{"title": "Multi-layered graph-based multi-document summarization model", "abstract": "Multi-document summarization is a process of automatic generation of a\ncompressed version of the given collection of documents. Recently, the\ngraph-based models and ranking algorithms have been actively investigated by\nthe extractive document summarization community. While most work to date\nfocuses on homogeneous connecteness of sentences and heterogeneous connecteness\nof documents and sentences (e.g. sentence similarity weighted by document\nimportance), in this paper we present a novel 3-layered graph model that\nemphasizes not only sentence and document level relations but also the\ninfluence of under sentence level relations (e.g. a part of sentence\nsimilarity).", "published": "2014-05-17 22:21:00", "link": "http://arxiv.org/abs/1405.7975v1", "categories": ["cs.IR", "cs.CL"], "primary_category": "cs.IR"}
{"title": "Preliminary Report on the Structure of Croatian Linguistic Co-occurrence\n  Networks", "abstract": "In this article, we investigate the structure of Croatian linguistic\nco-occurrence networks. We examine the change of network structure properties\nby systematically varying the co-occurrence window sizes, the corpus sizes and\nremoving stopwords. In a co-occurrence window of size $n$ we establish a link\nbetween the current word and $n-1$ subsequent words. The results point out that\nthe increase of the co-occurrence window size is followed by a decrease in\ndiameter, average path shortening and expectedly condensing the average\nclustering coefficient. The same can be noticed for the removal of the\nstopwords. Finally, since the size of texts is reflected in the network\nproperties, our results suggest that the corpus influence can be reduced by\nincreasing the co-occurrence window size.", "published": "2014-05-17 20:43:00", "link": "http://arxiv.org/abs/1405.4433v1", "categories": ["cs.CL", "cs.SI", "physics.soc-ph"], "primary_category": "cs.CL"}
