{"title": "An Algorithm Based on Empirical Methods, for Text-to-Tuneful-Speech\n  Synthesis of Sanskrit Verse", "abstract": "The rendering of Sanskrit poetry from text to speech is a problem that has\nnot been solved before. One reason may be the complications in the language\nitself. We present unique algorithms based on extensive empirical analysis, to\nsynthesize speech from a given text input of Sanskrit verses. Using a\npre-recorded audio units database which is itself tremendously reduced in size\ncompared to the colossal size that would otherwise be required, the algorithms\nwork on producing the best possible, tunefully rendered chanting of the given\nverse. His would enable the visually impaired and those with reading\ndisabilities to easily access the contents of Sanskrit verses otherwise\navailable only in writing.", "published": "2014-09-15 08:05:36", "link": "http://arxiv.org/abs/1409.4169v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "A Binary Schema and Computational Algorithms to Process Vowel-based\n  Euphonic Conjunctions for Word Searches", "abstract": "Comprehensively searching for words in Sanskrit E-text is a non-trivial\nproblem because words could change their forms in different contexts. One such\ncontext is sandhi or euphonic conjunctions, which cause a word to change owing\nto the presence of adjacent letters or words. The change wrought by these\npossible conjunctions can be so significant in Sanskrit that a simple search\nfor the word in its given form alone can significantly reduce the success level\nof the search. This work presents a representational schema that represents\nletters in a binary format and reduces Paninian rules of euphonic conjunctions\nto simple bit set-unset operations. The work presents an efficient algorithm to\nprocess vowel-based sandhis using this schema. It further presents another\nalgorithm that uses the sandhi processor to generate the possible transformed\nword forms of a given word to use in a comprehensive word search.", "published": "2014-09-15 18:08:33", "link": "http://arxiv.org/abs/1409.4354v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Computational Algorithms Based on the Paninian System to Process\n  Euphonic Conjunctions for Word Searches", "abstract": "Searching for words in Sanskrit E-text is a problem that is accompanied by\ncomplexities introduced by features of Sanskrit such as euphonic conjunctions\nor sandhis. A word could occur in an E-text in a transformed form owing to the\noperation of rules of sandhi. Simple word search would not yield these\ntransformed forms of the word. Further, there is no search engine in the\nliterature that can comprehensively search for words in Sanskrit E-texts taking\neuphonic conjunctions into account. This work presents an optimal binary\nrepresentational schema for letters of the Sanskrit alphabet along with\nalgorithms to efficiently process the sandhi rules of Sanskrit grammar. The\nwork further presents an algorithm that uses the sandhi processing algorithm to\nperform a comprehensive word search on E-text.", "published": "2014-09-15 18:19:06", "link": "http://arxiv.org/abs/1409.4364v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
