{"title": "Hybrid Approach to English-Hindi Name Entity Transliteration", "abstract": "Machine translation (MT) research in Indian languages is still in its\ninfancy. Not much work has been done in proper transliteration of name entities\nin this domain. In this paper we address this issue. We have used English-Hindi\nlanguage pair for our experiments and have used a hybrid approach. At first we\nhave processed English words using a rule based approach which extracts\nindividual phonemes from the words and then we have applied statistical\napproach which converts the English into its equivalent Hindi phoneme and in\nturn the corresponding Hindi word. Through this approach we have attained\n83.40% accuracy.", "published": "2014-03-28 17:30:32", "link": "http://arxiv.org/abs/1403.7455v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Emotion Analysis Platform on Chinese Microblog", "abstract": "Weibo, as the largest social media service in China, has billions of messages\ngenerated every day. The huge number of messages contain rich sentimental\ninformation. In order to analyze the emotional changes in accordance with time\nand space, this paper presents an Emotion Analysis Platform (EAP), which\nexplores the emotional distribution of each province, so that can monitor the\nglobal pulse of each province in China. The massive data of Weibo and the\nreal-time requirements make the building of EAP challenging. In order to solve\nthe above problems, emoticons, emotion lexicon and emotion-shifting rules are\nadopted in EAP to analyze the emotion of each tweet. In order to verify the\neffectiveness of the platform, case study on the Sichuan earthquake is done,\nand the analysis result of the platform accords with the fact. In order to\nanalyze from quantity, we manually annotate a test set and conduct experiment\non it. The experimental results show that the macro-Precision of EAP reaches\n80% and the EAP works effectively.", "published": "2014-03-28 10:45:31", "link": "http://arxiv.org/abs/1403.7335v1", "categories": ["cs.CL", "cs.CY", "cs.IR"], "primary_category": "cs.CL"}
