{"title": "Taking into Account the Differences between Actively and Passively\n  Acquired Data: The Case of Active Learning with Support Vector Machines for\n  Imbalanced Datasets", "abstract": "Actively sampled data can have very different characteristics than passively\nsampled data. Therefore, it's promising to investigate using different\ninference procedures during AL than are used during passive learning (PL). This\ngeneral idea is explored in detail for the focused case of AL with\ncost-weighted SVMs for imbalanced data, a situation that arises for many HLT\ntasks. The key idea behind the proposed InitPA method for addressing imbalance\nis to base cost models during AL on an estimate of overall corpus imbalance\ncomputed via a small unbiased sample rather than the imbalance in the labeled\ntraining data, which is the leading method used during PL.", "published": "2014-09-17 00:00:11", "link": "http://arxiv.org/abs/1409.4835v1", "categories": ["cs.LG", "cs.CL", "stat.ML", "I.2.6; I.2.7; I.5.1; I.5.4"], "primary_category": "cs.LG"}
{"title": "A Method for Stopping Active Learning Based on Stabilizing Predictions\n  and the Need for User-Adjustable Stopping", "abstract": "A survey of existing methods for stopping active learning (AL) reveals the\nneeds for methods that are: more widely applicable; more aggressive in saving\nannotations; and more stable across changing datasets. A new method for\nstopping AL based on stabilizing predictions is presented that addresses these\nneeds. Furthermore, stopping methods are required to handle a broad range of\ndifferent annotation/performance tradeoff valuations. Despite this, the\nexisting body of work is dominated by conservative methods with little (if any)\nattention paid to providing users with control over the behavior of stopping\nmethods. The proposed method is shown to fill a gap in the level of\naggressiveness available for stopping AL and supports providing users with\ncontrol over stopping behavior.", "published": "2014-09-17 23:28:59", "link": "http://arxiv.org/abs/1409.5165v1", "categories": ["cs.LG", "cs.CL", "stat.ML", "I.2.6; I.2.7; I.5.1; I.5.4; G.3"], "primary_category": "cs.LG"}
