{"title": "The CQC Algorithm: Cycling in Graphs to Semantically Enrich and Enhance\n  a Bilingual Dictionary", "abstract": "Bilingual machine-readable dictionaries are knowledge resources useful in\nmany automatic tasks. However, compared to monolingual computational lexicons\nlike WordNet, bilingual dictionaries typically provide a lower amount of\nstructured information, such as lexical and semantic relations, and often do\nnot cover the entire range of possible translations for a word of interest. In\nthis paper we present Cycles and Quasi-Cycles (CQC), a novel algorithm for the\nautomated disambiguation of ambiguous translations in the lexical entries of a\nbilingual machine-readable dictionary. The dictionary is represented as a\ngraph, and cyclic patterns are sought in the graph to assign an appropriate\nsense tag to each translation in a lexical entry. Further, we use the\nalgorithms output to improve the quality of the dictionary itself, by\nsuggesting accurate solutions to structural problems such as misalignments,\npartial alignments and missing entries. Finally, we successfully apply CQC to\nthe task of synonym extraction.", "published": "2014-01-18 21:08:40", "link": "http://arxiv.org/abs/1402.2561v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Generalized Biwords for Bitext Compression and Translation Spotting", "abstract": "Large bilingual parallel texts (also known as bitexts) are usually stored in\na compressed form, and previous work has shown that they can be more\nefficiently compressed if the fact that the two texts are mutual translations\nis exploited. For example, a bitext can be seen as a sequence of biwords\n---pairs of parallel words with a high probability of co-occurrence--- that can\nbe used as an intermediate representation in the compression process. However,\nthe simple biword approach described in the literature can only exploit\none-to-one word alignments and cannot tackle the reordering of words. We\ntherefore introduce a generalization of biwords which can describe multi-word\nexpressions and reorderings. We also describe some methods for the binary\ncompression of generalized biword sequences, and compare their performance when\ndifferent schemes are applied to the extraction of the biword sequence. In\naddition, we show that this generalization of biwords allows for the\nimplementation of an efficient algorithm to look on the compressed bitext for\nwords or text segments in one of the texts and retrieve their counterpart\ntranslations in the other text ---an application usually referred to as\ntranslation spotting--- with only some minor modifications in the compression\nalgorithm.", "published": "2014-01-18 21:11:30", "link": "http://arxiv.org/abs/1401.5674v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Semantic Similarity Measures Applied to an Ontology for Human-Like\n  Interaction", "abstract": "The focus of this paper is the calculation of similarity between two concepts\nfrom an ontology for a Human-Like Interaction system. In order to facilitate\nthis calculation, a similarity function is proposed based on five dimensions\n(sort, compositional, essential, restrictive and descriptive) constituting the\nstructure of ontological knowledge. The paper includes a proposal for computing\na similarity function for each dimension of knowledge. Later on, the similarity\nvalues obtained are weighted and aggregated to obtain a global similarity\nmeasure. In order to calculate those weights associated to each dimension, four\ntraining methods have been proposed. The training methods differ in the element\nto fit: the user, concepts or pairs of concepts, and a hybrid approach. For\nevaluating the proposal, the knowledge base was fed from WordNet and extended\nby using a knowledge editing toolkit (Cognos). The evaluation of the proposal\nis carried out through the comparison of system responses with those given by\nhuman test subjects, both providing a measure of the soundness of the procedure\nand revealing ways in which the proposal may be improved.", "published": "2014-01-18 21:09:42", "link": "http://arxiv.org/abs/1401.4603v1", "categories": ["cs.AI", "cs.CL"], "primary_category": "cs.AI"}
{"title": "Learning to Win by Reading Manuals in a Monte-Carlo Framework", "abstract": "Domain knowledge is crucial for effective performance in autonomous control\nsystems. Typically, human effort is required to encode this knowledge into a\ncontrol algorithm. In this paper, we present an approach to language grounding\nwhich automatically interprets text in the context of a complex control\napplication, such as a game, and uses domain knowledge extracted from the text\nto improve control performance. Both text analysis and control strategies are\nlearned jointly using only a feedback signal inherent to the application. To\neffectively leverage textual information, our method automatically extracts the\ntext segment most relevant to the current game state, and labels it with a\ntask-centric predicate structure. This labeled text is then used to bias an\naction selection policy for the game, guiding it towards promising regions of\nthe action space. We encode our model for text analysis and game playing in a\nmulti-layer neural network, representing linguistic decisions via latent\nvariables in the hidden layers, and game action quality via the output layer.\nOperating within the Monte-Carlo Search framework, we estimate model parameters\nusing feedback from simulated games. We apply our approach to the complex\nstrategy game Civilization II using the official game manual as the text guide.\nOur results show that a linguistically-informed game-playing agent\nsignificantly outperforms its language-unaware counterpart, yielding a 34%\nabsolute improvement and winning over 65% of games when playing against the\nbuilt-in AI of Civilization.", "published": "2014-01-18 21:10:57", "link": "http://arxiv.org/abs/1401.5390v1", "categories": ["cs.CL", "cs.AI", "cs.LG"], "primary_category": "cs.CL"}
