{"title": "Leverage Financial News to Predict Stock Price Movements Using Word\n  Embeddings and Deep Neural Networks", "abstract": "Financial news contains useful information on public companies and the\nmarket. In this paper we apply the popular word embedding methods and deep\nneural networks to leverage financial news to predict stock price movements in\nthe market. Experimental results have shown that our proposed methods are\nsimple but very effective, which can significantly improve the stock prediction\naccuracy on a standard financial database over the baseline system using only\nthe historical price information.", "published": "2015-06-24 01:43:11", "link": "http://arxiv.org/abs/1506.07220v1", "categories": ["cs.CE", "cs.AI", "cs.CL"], "primary_category": "cs.CE"}
{"title": "Ask Me Anything: Dynamic Memory Networks for Natural Language Processing", "abstract": "Most tasks in natural language processing can be cast into question answering\n(QA) problems over language input. We introduce the dynamic memory network\n(DMN), a neural network architecture which processes input sequences and\nquestions, forms episodic memories, and generates relevant answers. Questions\ntrigger an iterative attention process which allows the model to condition its\nattention on the inputs and the result of previous iterations. These results\nare then reasoned over in a hierarchical recurrent sequence model to generate\nanswers. The DMN can be trained end-to-end and obtains state-of-the-art results\non several types of tasks and datasets: question answering (Facebook's bAbI\ndataset), text classification for sentiment analysis (Stanford Sentiment\nTreebank) and sequence modeling for part-of-speech tagging (WSJ-PTB). The\ntraining for these different tasks relies exclusively on trained word vector\nrepresentations and input-question-answer triplets.", "published": "2015-06-24 08:27:02", "link": "http://arxiv.org/abs/1506.07285v5", "categories": ["cs.CL", "cs.LG", "cs.NE"], "primary_category": "cs.CL"}
{"title": "Efficient Learning for Undirected Topic Models", "abstract": "Replicated Softmax model, a well-known undirected topic model, is powerful in\nextracting semantic representations of documents. Traditional learning\nstrategies such as Contrastive Divergence are very inefficient. This paper\nprovides a novel estimator to speed up the learning based on Noise Contrastive\nEstimate, extended for documents of variant lengths and weighted inputs.\nExperiments on two benchmarks show that the new estimator achieves great\nlearning efficiency and high accuracy on document retrieval and classification.", "published": "2015-06-24 17:27:28", "link": "http://arxiv.org/abs/1506.07477v1", "categories": ["cs.LG", "cs.CL", "cs.IR", "stat.ML"], "primary_category": "cs.LG"}
{"title": "Attention-Based Models for Speech Recognition", "abstract": "Recurrent sequence generators conditioned on input data through an attention\nmechanism have recently shown very good performance on a range of tasks in-\ncluding machine translation, handwriting synthesis and image caption gen-\neration. We extend the attention-mechanism with features needed for speech\nrecognition. We show that while an adaptation of the model used for machine\ntranslation in reaches a competitive 18.7% phoneme error rate (PER) on the\nTIMIT phoneme recognition task, it can only be applied to utterances which are\nroughly as long as the ones it was trained on. We offer a qualitative\nexplanation of this failure and propose a novel and generic method of adding\nlocation-awareness to the attention mechanism to alleviate this issue. The new\nmethod yields a model that is robust to long inputs and achieves 18% PER in\nsingle utterances and 20% in 10-times longer (repeated) utterances. Finally, we\npropose a change to the at- tention mechanism that prevents it from\nconcentrating too much on single frames, which further reduces PER to 17.6%\nlevel.", "published": "2015-06-24 19:10:33", "link": "http://arxiv.org/abs/1506.07503v1", "categories": ["cs.CL", "cs.LG", "cs.NE", "stat.ML"], "primary_category": "cs.CL"}
