{"title": "Turn Segmentation into Utterances for Arabic Spontaneous Dialogues and\n  Instance Messages", "abstract": "Text segmentation task is an essential processing task for many of Natural\nLanguage Processing (NLP) such as text summarization, text translation,\ndialogue language understanding, among others. Turns segmentation considered\nthe key player in dialogue understanding task for building automatic\nHuman-Computer systems. In this paper, we introduce a novel approach to turn\nsegmentation into utterances for Egyptian spontaneous dialogues and Instance\nMessages (IM) using Machine Learning (ML) approach as a part of automatic\nunderstanding Egyptian spontaneous dialogues and IM task. Due to the lack of\nEgyptian dialect dialogue corpus the system evaluated by our corpus includes\n3001 turns, which are collected, segmented, and annotated manually from\nEgyptian call-centers. The system achieves F1 scores of 90.74% and accuracy of\n95.98%.", "published": "2015-05-12 16:33:03", "link": "http://arxiv.org/abs/1505.03081v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "A Survey of Arabic Dialogues Understanding for Spontaneous Dialogues and\n  Instant Message", "abstract": "Building dialogues systems interaction has recently gained considerable\nattention, but most of the resources and systems built so far are tailored to\nEnglish and other Indo-European languages. The need for designing systems for\nother languages is increasing such as Arabic language. For this reasons, there\nare more interest for Arabic dialogue acts classification task because it a key\nplayer in Arabic language understanding to building this systems. This paper\nsurveys different techniques for dialogue acts classification for Arabic. We\ndescribe the main existing techniques for utterances segmentations and\nclassification, annotation schemas, and test corpora for Arabic dialogues\nunderstanding that have introduced in the literature", "published": "2015-05-12 16:38:39", "link": "http://arxiv.org/abs/1505.03084v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Indonesian Social Media Sentiment Analysis With Sarcasm Detection", "abstract": "Sarcasm is considered one of the most difficult problem in sentiment\nanalysis. In our ob-servation on Indonesian social media, for cer-tain topics,\npeople tend to criticize something using sarcasm. Here, we proposed two\nadditional features to detect sarcasm after a common sentiment analysis is\nconducted. The features are the negativity information and the number of\ninterjection words. We also employed translated SentiWordNet in the sentiment\nclassification. All the classifications were conducted with machine learning\nalgorithms. The experimental results showed that the additional features are\nquite effective in the sarcasm detection.", "published": "2015-05-12 16:45:52", "link": "http://arxiv.org/abs/1505.03085v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Sentiment Analysis For Modern Standard Arabic And Colloquial", "abstract": "The rise of social media such as blogs and social networks has fueled\ninterest in sentiment analysis. With the proliferation of reviews, ratings,\nrecommendations and other forms of online expression, online opinion has turned\ninto a kind of virtual currency for businesses looking to market their\nproducts, identify new opportunities and manage their reputations, therefore\nmany are now looking to the field of sentiment analysis. In this paper, we\npresent a feature-based sentence level approach for Arabic sentiment analysis.\nOur approach is using Arabic idioms/saying phrases lexicon as a key importance\nfor improving the detection of the sentiment polarity in Arabic sentences as\nwell as a number of novels and rich set of linguistically motivated features\ncontextual Intensifiers, contextual Shifter and negation handling), syntactic\nfeatures for conflicting phrases which enhance the sentiment classification\naccuracy. Furthermore, we introduce an automatic expandable wide coverage\npolarity lexicon of Arabic sentiment words. The lexicon is built with\ngold-standard sentiment words as a seed which is manually collected and\nannotated and it expands and detects the sentiment orientation automatically of\nnew sentiment words using synset aggregation technique and free online Arabic\nlexicons and thesauruses. Our data focus on modern standard Arabic (MSA) and\nEgyptian dialectal Arabic tweets and microblogs (hotel reservation, product\nreviews, etc.). The experimental results using our resources and techniques\nwith SVM classifier indicate high performance levels, with accuracies of over\n95%.", "published": "2015-05-12 18:10:53", "link": "http://arxiv.org/abs/1505.03105v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Comparing methods for Twitter Sentiment Analysis", "abstract": "This work extends the set of works which deal with the popular problem of\nsentiment analysis in Twitter. It investigates the most popular document\n(\"tweet\") representation methods which feed sentiment evaluation mechanisms. In\nparticular, we study the bag-of-words, n-grams and n-gram graphs approaches and\nfor each of them we evaluate the performance of a lexicon-based and 7\nlearning-based classification algorithms (namely SVM, Na\\\"ive Bayesian\nNetworks, Logistic Regression, Multilayer Perceptrons, Best-First Trees,\nFunctional Trees and C4.5) as well as their combinations, using a set of 4451\nmanually annotated tweets. The results demonstrate the superiority of\nlearning-based methods and in particular of n-gram graphs approaches for\npredicting the sentiment of tweets. They also show that the combinatory\napproach has impressive effects on n-grams, raising the confidence up to 83.15%\non the 5-Grams, using majority vote and a balanced dataset (equal number of\npositive, negative and neutral tweets for training). In the n-gram graph cases\nthe improvement was small to none, reaching 94.52% on the 4-gram graphs, using\nOrthodromic distance and a threshold of 0.001.", "published": "2015-05-12 12:05:19", "link": "http://arxiv.org/abs/1505.02973v1", "categories": ["cs.CL", "cs.IR", "cs.SI"], "primary_category": "cs.CL"}
