{"title": "A Chinese POS Decision Method Using Korean Translation Information", "abstract": "In this paper we propose a method that imitates a translation expert using\nthe Korean translation information and analyse the performance. Korean is good\nat tagging than Chinese, so we can use this property in Chinese POS tagging.", "published": "2015-11-08 03:44:26", "link": "http://arxiv.org/abs/1511.02435v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Learning Linguistic Biomarkers for Predicting Mild Cognitive Impairment\n  using Compound Skip-grams", "abstract": "Predicting Mild Cognitive Impairment (MCI) is currently a challenge as\nexisting diagnostic criteria rely on neuropsychological examinations. Automated\nMachine Learning (ML) models that are trained on verbal utterances of MCI\npatients can aid diagnosis. Using a combination of skip-gram features, our\nmodel learned several linguistic biomarkers to distinguish between 19 patients\nwith MCI and 19 healthy control individuals from the DementiaBank language\ntranscript clinical dataset. Results show that a model with compound of\nskip-grams has better AUC and could help ML prediction on small MCI data\nsample.", "published": "2015-11-08 03:45:49", "link": "http://arxiv.org/abs/1511.02436v2", "categories": ["cs.CL", "cs.AI"], "primary_category": "cs.CL"}
{"title": "Towards Structured Deep Neural Network for Automatic Speech Recognition", "abstract": "In this paper we propose the Structured Deep Neural Network (structured DNN)\nas a structured and deep learning framework. This approach can learn to find\nthe best structured object (such as a label sequence) given a structured input\n(such as a vector sequence) by globally considering the mapping relationships\nbetween the structures rather than item by item.\n  When automatic speech recognition is viewed as a special case of such a\nstructured learning problem, where we have the acoustic vector sequence as the\ninput and the phoneme label sequence as the output, it becomes possible to\ncomprehensively learn utterance by utterance as a whole, rather than frame by\nframe.\n  Structured Support Vector Machine (structured SVM) was proposed to perform\nASR with structured learning previously, but limited by the linear nature of\nSVM. Here we propose structured DNN to use nonlinear transformations in\nmulti-layers as a structured and deep learning approach. This approach was\nshown to beat structured SVM in preliminary experiments on TIMIT.", "published": "2015-11-08 17:08:54", "link": "http://arxiv.org/abs/1511.02506v1", "categories": ["cs.CL", "cs.LG", "cs.NE"], "primary_category": "cs.CL"}
