{"title": "Classifying Relations via Long Short Term Memory Networks along Shortest\n  Dependency Path", "abstract": "Relation classification is an important research arena in the field of\nnatural language processing (NLP). In this paper, we present SDP-LSTM, a novel\nneural network to classify the relation of two entities in a sentence. Our\nneural architecture leverages the shortest dependency path (SDP) between two\nentities; multichannel recurrent neural networks, with long short term memory\n(LSTM) units, pick up heterogeneous information along the SDP. Our proposed\nmodel has several distinct features: (1) The shortest dependency paths retain\nmost relevant information (to relation classification), while eliminating\nirrelevant words in the sentence. (2) The multichannel LSTM networks allow\neffective information integration from heterogeneous sources over the\ndependency paths. (3) A customized dropout strategy regularizes the neural\nnetwork to alleviate overfitting. We test our model on the SemEval 2010\nrelation classification task, and achieve an $F_1$-score of 83.7\\%, higher than\ncompeting methods in the literature.", "published": "2015-08-15 11:15:32", "link": "http://arxiv.org/abs/1508.03720v1", "categories": ["cs.CL", "cs.LG"], "primary_category": "cs.CL"}
{"title": "A Comparative Study on Regularization Strategies for Embedding-based\n  Neural Networks", "abstract": "This paper aims to compare different regularization strategies to address a\ncommon phenomenon, severe overfitting, in embedding-based neural networks for\nNLP. We chose two widely studied neural models and tasks as our testbed. We\ntried several frequently applied or newly proposed regularization strategies,\nincluding penalizing weights (embeddings excluded), penalizing embeddings,\nre-embedding words, and dropout. We also emphasized on incremental\nhyperparameter tuning, and combining different regularizations. The results\nprovide a picture on tuning hyperparameters for neural NLP models.", "published": "2015-08-15 11:16:39", "link": "http://arxiv.org/abs/1508.03721v1", "categories": ["cs.CL", "cs.LG"], "primary_category": "cs.CL"}
