{"title": "Topic2Vec: Learning Distributed Representations of Topics", "abstract": "Latent Dirichlet Allocation (LDA) mining thematic structure of documents\nplays an important role in nature language processing and machine learning\nareas. However, the probability distribution from LDA only describes the\nstatistical relationship of occurrences in the corpus and usually in practice,\nprobability is not the best choice for feature representations. Recently,\nembedding methods have been proposed to represent words and documents by\nlearning essential concepts and representations, such as Word2Vec and Doc2Vec.\nThe embedded representations have shown more effectiveness than LDA-style\nrepresentations in many tasks. In this paper, we propose the Topic2Vec approach\nwhich can learn topic representations in the same semantic vector space with\nwords, as an alternative to probability. The experimental results show that\nTopic2Vec achieves interesting and meaningful results.", "published": "2015-06-28 16:17:40", "link": "http://arxiv.org/abs/1506.08422v1", "categories": ["cs.CL", "cs.LG"], "primary_category": "cs.CL"}
{"title": "Improved Deep Speaker Feature Learning for Text-Dependent Speaker\n  Recognition", "abstract": "A deep learning approach has been proposed recently to derive speaker\nidentifies (d-vector) by a deep neural network (DNN). This approach has been\napplied to text-dependent speaker recognition tasks and shows reasonable\nperformance gains when combined with the conventional i-vector approach.\nAlthough promising, the existing d-vector implementation still can not compete\nwith the i-vector baseline. This paper presents two improvements for the deep\nlearning approach: a phonedependent DNN structure to normalize phone variation,\nand a new scoring approach based on dynamic time warping (DTW). Experiments on\na text-dependent speaker recognition task demonstrated that the proposed\nmethods can provide considerable performance improvement over the existing\nd-vector implementation.", "published": "2015-06-28 03:32:02", "link": "http://arxiv.org/abs/1506.08349v1", "categories": ["cs.CL", "cs.LG", "cs.NE"], "primary_category": "cs.CL"}
{"title": "WYSIWYE: An Algebra for Expressing Spatial and Textual Rules for Visual\n  Information Extraction", "abstract": "The visual layout of a webpage can provide valuable clues for certain types\nof Information Extraction (IE) tasks. In traditional rule based IE frameworks,\nthese layout cues are mapped to rules that operate on the HTML source of the\nwebpages. In contrast, we have developed a framework in which the rules can be\nspecified directly at the layout level. This has many advantages, since the\nhigher level of abstraction leads to simpler extraction rules that are largely\nindependent of the source code of the page, and, therefore, more robust. It can\nalso enable specification of new types of rules that are not otherwise\npossible. To the best of our knowledge, there is no general framework that\nallows declarative specification of information extraction rules based on\nspatial layout. Our framework is complementary to traditional text based rules\nframework and allows a seamless combination of spatial layout based rules with\ntraditional text based rules. We describe the algebra that enables such a\nsystem and its efficient implementation using standard relational and text\nindexing features of a relational database. We demonstrate the simplicity and\nefficiency of this system for a task involving the extraction of software\nsystem requirements from software product pages.", "published": "2015-06-28 21:17:26", "link": "http://arxiv.org/abs/1506.08454v2", "categories": ["cs.CL", "cs.DB", "cs.IR"], "primary_category": "cs.CL"}
