{"title": "Robustly Leveraging Prior Knowledge in Text Classification", "abstract": "Prior knowledge has been shown very useful to address many natural language\nprocessing tasks. Many approaches have been proposed to formalise a variety of\nknowledge, however, whether the proposed approach is robust or sensitive to the\nknowledge supplied to the model has rarely been discussed. In this paper, we\npropose three regularization terms on top of generalized expectation criteria,\nand conduct extensive experiments to justify the robustness of the proposed\nmethods. Experimental results demonstrate that our proposed methods obtain\nremarkable improvements and are much more robust than baselines.", "published": "2015-03-03 06:59:28", "link": "http://arxiv.org/abs/1503.00841v1", "categories": ["cs.CL", "cs.AI", "cs.IR", "cs.LG"], "primary_category": "cs.CL"}
{"title": "Complexity and universality in the long-range order of words", "abstract": "As is the case of many signals produced by complex systems, language presents\na statistical structure that is balanced between order and disorder. Here we\nreview and extend recent results from quantitative characterisations of the\ndegree of order in linguistic sequences that give insights into two relevant\naspects of language: the presence of statistical universals in word ordering,\nand the link between semantic information and the statistical linguistic\nstructure. We first analyse a measure of relative entropy that assesses how\nmuch the ordering of words contributes to the overall statistical structure of\nlanguage. This measure presents an almost constant value close to 3.5 bits/word\nacross several linguistic families. Then, we show that a direct application of\ninformation theory leads to an entropy measure that can quantify and extract\nsemantic structures from linguistic samples, even without prior knowledge of\nthe underlying language.", "published": "2015-03-03 21:18:05", "link": "http://arxiv.org/abs/1503.01129v1", "categories": ["cs.CL", "physics.data-an", "physics.soc-ph"], "primary_category": "cs.CL"}
