{"title": "On the evolution of word usage of classical Chinese poetry", "abstract": "The hierarchy of classical Chinese poetry has been broadly acknowledged by a\nnumber of studies in Chinese literature. However, quantitative investigations\nabout the evolutionary linkages of classical Chinese poetry are limited. The\nprimary goal of this study is to provide quantitative evidence of the\nevolutionary linkages, with emphasis on character usage, among different period\ngenres of classical Chinese poetry. Specifically, various statistical analyses\nare performed to find and compare the patterns of character usage in the poems\nof nine period genres, including shi jing, chu ci, Han shi , Jin shi, Tang shi,\nSong shi, Yuan shi, Ming shi, and Qing shi. The result of analysis indicates\nthat each of nine period genres has unique patterns of character usage, with\nsome Chinese characters that are preferably used in the poems of a particular\nperiod genre. The analysis on the general pattern of character preference\nimplies a decreasing trend in the use of Chinese characters that rarely occur\nin modern Chinese literature along the timeline of dynastic types of classical\nChinese poetry. The phylogenetic analysis based on the distance matrix suggests\nthat the evolutionary linkages of different types of classical Chinese poetry\nare congruent with their chronological order, suggesting that character\nfrequencies contain phylogenetic information that is useful for inferring\nevolutionary linkages among various types of classical Chinese poetry. The\nestimated phylogenetic tree identifies four groups (shi jing, chu ci), (Han\nshi, Jin shi), (Tang shi, Song shi, Yuan shi), and (Ming shi, Qing shi). The\nstatistical analyses conducted in this study can be generalized to analyze the\ndata sets of general Chinese literature. Such analyses can provide quantitative\ninsights about the evolutionary linkages of general Chinese literature.", "published": "2015-09-10 18:08:13", "link": "http://arxiv.org/abs/1509.04556v4", "categories": ["physics.soc-ph", "cs.CL"], "primary_category": "physics.soc-ph"}
