{"title": "Reasoning about Linguistic Regularities in Word Embeddings using Matrix\n  Manifolds", "abstract": "Recent work has explored methods for learning continuous vector space word\nrepresentations reflecting the underlying semantics of words. Simple vector\nspace arithmetic using cosine distances has been shown to capture certain types\nof analogies, such as reasoning about plurals from singulars, past tense from\npresent tense, etc. In this paper, we introduce a new approach to capture\nanalogies in continuous word representations, based on modeling not just\nindividual word vectors, but rather the subspaces spanned by groups of words.\nWe exploit the property that the set of subspaces in n-dimensional Euclidean\nspace form a curved manifold space called the Grassmannian, a quotient subgroup\nof the Lie group of rotations in n- dimensions. Based on this mathematical\nmodel, we develop a modified cosine distance model based on geodesic kernels\nthat captures relation-specific distances across word categories. Our\nexperiments on analogy tasks show that our approach performs significantly\nbetter than the previous approaches for the given task.", "published": "2015-07-28 03:51:43", "link": "http://arxiv.org/abs/1507.07636v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Classifying informative and imaginative prose using complex networks", "abstract": "Statistical methods have been widely employed in recent years to grasp many\nlanguage properties. The application of such techniques have allowed an\nimprovement of several linguistic applications, which encompasses machine\ntranslation, automatic summarization and document classification. In the\nlatter, many approaches have emphasized the semantical content of texts, as it\nis the case of bag-of-word language models. This approach has certainly yielded\nreasonable performance. However, some potential features such as the structural\norganization of texts have been used only on a few studies. In this context, we\nprobe how features derived from textual structure analysis can be effectively\nemployed in a classification task. More specifically, we performed a supervised\nclassification aiming at discriminating informative from imaginative documents.\nUsing a networked model that describes the local topological/dynamical\nproperties of function words, we achieved an accuracy rate of up to 95%, which\nis much higher than similar networked approaches. A systematic analysis of\nfeature relevance revealed that symmetry and accessibility measurements are\namong the most prominent network measurements. Our results suggest that these\nmeasurements could be used in related language applications, as they play a\ncomplementary role in characterizing texts.", "published": "2015-07-28 15:59:39", "link": "http://arxiv.org/abs/1507.07826v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
