{"title": "Noisy-parallel and comparable corpora filtering methodology for the\n  extraction of bi-lingual equivalent data at sentence level", "abstract": "Text alignment and text quality are critical to the accuracy of Machine\nTranslation (MT) systems, some NLP tools, and any other text processing tasks\nrequiring bilingual data. This research proposes a language independent\nbi-sentence filtering approach based on Polish (not a position-sensitive\nlanguage) to English experiments. This cleaning approach was developed on the\nTED Talks corpus and also initially tested on the Wikipedia comparable corpus,\nbut it can be used for any text domain or language pair. The proposed approach\nimplements various heuristics for sentence comparison. Some of them leverage\nsynonyms and semantic and structural analysis of text as additional\ninformation. Minimization of data loss was ensured. An improvement in MT system\nscore with text processed using the tool is discussed.", "published": "2015-10-15 12:29:14", "link": "http://arxiv.org/abs/1510.04500v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Telemedicine as a special case of Machine Translation", "abstract": "Machine translation is evolving quite rapidly in terms of quality. Nowadays,\nwe have several machine translation systems available in the web, which provide\nreasonable translations. However, these systems are not perfect, and their\nquality may decrease in some specific domains. This paper examines the effects\nof different training methods when it comes to Polish - English Statistical\nMachine Translation system used for the medical data. Numerous elements of the\nEMEA parallel text corpora and not related OPUS Open Subtitles project were\nused as the ground for creation of phrase tables and different language models\nincluding the development, tuning and testing of these translation systems. The\nBLEU, NIST, METEOR, and TER metrics have been used in order to evaluate the\nresults of various systems. Our experiments deal with the systems that include\nPOS tagging, factored phrase models, hierarchical models, syntactic taggers,\nand other alignment methods. We also executed a deep analysis of Polish data as\npreparatory work before automatized data processing such as true casing or\npunctuation normalization phase. Normalized metrics was used to compare\nresults. Scores lower than 15% mean that Machine Translation engine is unable\nto provide satisfying quality, scores greater than 30% mean that translations\nshould be understandable without problems and scores over 50 reflect adequate\ntranslations. The average results of Polish to English translations scores for\nBLEU, NIST, METEOR, and TER were relatively high and ranged from 70,58 to\n82,72. The lowest score was 64,38. The average results ranges for English to\nPolish translations were little lower (67,58 - 78,97). The real-life\nimplementations of presented high quality Machine Translation Systems are\nanticipated in general medical practice and telemedicine.", "published": "2015-10-15 16:02:50", "link": "http://arxiv.org/abs/1510.04600v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "A Method for Modeling Co-Occurrence Propensity of Clinical Codes with\n  Application to ICD-10-PCS Auto-Coding", "abstract": "Objective. Natural language processing methods for medical auto-coding, or\nautomatic generation of medical billing codes from electronic health records,\ngenerally assign each code independently of the others. They may thus assign\ncodes for closely related procedures or diagnoses to the same document, even\nwhen they do not tend to occur together in practice, simply because the right\nchoice can be difficult to infer from the clinical narrative.\n  Materials and Methods. We propose a method that injects awareness of the\npropensities for code co-occurrence into this process. First, a model is\ntrained to estimate the conditional probability that one code is assigned by a\nhuman coder, given than another code is known to have been assigned to the same\ndocument. Then, at runtime, an iterative algorithm is used to apply this model\nto the output of an existing statistical auto-coder to modify the confidence\nscores of the codes.\n  Results. We tested this method in combination with a primary auto-coder for\nICD-10 procedure codes, achieving a 12% relative improvement in F-score over\nthe primary auto-coder baseline.\n  Discussion. The proposed method can be used, with appropriate features, in\ncombination with any auto-coder that generates codes with different levels of\nconfidence.\n  Conclusion. The promising results obtained for ICD-10 procedure codes suggest\nthat the proposed method may have wider applications in auto-coding.", "published": "2015-10-15 22:36:08", "link": "http://arxiv.org/abs/1510.04734v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Multilingual Image Description with Neural Sequence Models", "abstract": "In this paper we present an approach to multi-language image description\nbringing together insights from neural machine translation and neural image\ndescription. To create a description of an image for a given target language,\nour sequence generation models condition on feature vectors from the image, the\ndescription from the source language, and/or a multimodal vector computed over\nthe image and a description in the source language. In image description\nexperiments on the IAPR-TC12 dataset of images aligned with English and German\nsentences, we find significant and substantial improvements in BLEU4 and Meteor\nscores for models trained over multiple languages, compared to a monolingual\nbaseline.", "published": "2015-10-15 20:29:21", "link": "http://arxiv.org/abs/1510.04709v2", "categories": ["cs.CL", "cs.CV", "cs.LG", "cs.NE"], "primary_category": "cs.CL"}
