{"title": "deltaBLEU: A Discriminative Metric for Generation Tasks with\n  Intrinsically Diverse Targets", "abstract": "We introduce Discriminative BLEU (deltaBLEU), a novel metric for intrinsic\nevaluation of generated text in tasks that admit a diverse range of possible\noutputs. Reference strings are scored for quality by human raters on a scale of\n[-1, +1] to weight multi-reference BLEU. In tasks involving generation of\nconversational responses, deltaBLEU correlates reasonably with human judgments\nand outperforms sentence-level and IBM BLEU in terms of both Spearman's rho and\nKendall's tau.", "published": "2015-06-23 05:24:53", "link": "http://arxiv.org/abs/1506.06863v2", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "New Approach to translation of Isolated Units in English-Korean Machine\n  Translation", "abstract": "It is the most effective way for quick translation of tremendous amount of\nexplosively increasing science and technique information material to develop a\npracticable machine translation system and introduce it into translation\npractice. This essay treats problems arising from translation of isolated units\non the basis of the practical materials and experiments obtained in the\ndevelopment and introduction of English-Korean machine translation system. In\nother words, this essay considers establishment of information for isolated\nunits and their Korean equivalents and word order.", "published": "2015-06-23 08:26:50", "link": "http://arxiv.org/abs/1506.06904v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Multi-domain Dialog State Tracking using Recurrent Neural Networks", "abstract": "Dialog state tracking is a key component of many modern dialog systems, most\nof which are designed with a single, well-defined domain in mind. This paper\nshows that dialog data drawn from different dialog domains can be used to train\na general belief tracking model which can operate across all of these domains,\nexhibiting superior performance to each of the domain-specific models. We\npropose a training procedure which uses out-of-domain data to initialise belief\ntracking models for entirely new domains. This procedure leads to improvements\nin belief tracking performance regardless of the amount of in-domain data\navailable for training the model.", "published": "2015-06-23 20:16:06", "link": "http://arxiv.org/abs/1506.07190v1", "categories": ["cs.CL", "cs.LG"], "primary_category": "cs.CL"}
{"title": "Detection and Analysis of Emotion From Speech Signals", "abstract": "Recognizing emotion from speech has become one the active research themes in\nspeech processing and in applications based on human-computer interaction. This\npaper conducts an experimental study on recognizing emotions from human speech.\nThe emotions considered for the experiments include neutral, anger, joy and\nsadness. The distinuishability of emotional features in speech were studied\nfirst followed by emotion classification performed on a custom dataset. The\nclassification was performed for different classifiers. One of the main feature\nattribute considered in the prepared dataset was the peak-to-peak distance\nobtained from the graphical representation of the speech signals. After\nperforming the classification tests on a dataset formed from 30 different\nsubjects, it was found that for getting better accuracy, one should consider\nthe data collected from one person rather than considering the data from a\ngroup of people.", "published": "2015-06-23 00:28:08", "link": "http://arxiv.org/abs/1506.06832v1", "categories": ["cs.SD", "cs.CL", "cs.HC"], "primary_category": "cs.SD"}
{"title": "A Survey of Current Datasets for Vision and Language Research", "abstract": "Integrating vision and language has long been a dream in work on artificial\nintelligence (AI). In the past two years, we have witnessed an explosion of\nwork that brings together vision and language from images to videos and beyond.\nThe available corpora have played a crucial role in advancing this area of\nresearch. In this paper, we propose a set of quality metrics for evaluating and\nanalyzing the vision & language datasets and categorize them accordingly. Our\nanalyses show that the most recent datasets have been using more complex\nlanguage and more abstract concepts, however, there are different strengths and\nweaknesses in each.", "published": "2015-06-23 00:59:27", "link": "http://arxiv.org/abs/1506.06833v2", "categories": ["cs.CL", "cs.AI", "cs.CV"], "primary_category": "cs.CL"}
