{"title": "Extraction of evidence tables from abstracts of randomized clinical\n  trials using a maximum entropy classifier and global constraints", "abstract": "Systematic use of the published results of randomized clinical trials is\nincreasingly important in evidence-based medicine. In order to collate and\nanalyze the results from potentially numerous trials, evidence tables are used\nto represent trials concerning a set of interventions of interest. An evidence\ntable has columns for the patient group, for each of the interventions being\ncompared, for the criterion for the comparison (e.g. proportion who survived\nafter 5 years from treatment), and for each of the results. Currently, it is a\nlabour-intensive activity to read each published paper and extract the\ninformation for each field in an evidence table. There have been some NLP\nstudies investigating how some of the features from papers can be extracted, or\nat least the relevant sentences identified. However, there is a lack of an NLP\nsystem for the systematic extraction of each item of information required for\nan evidence table. We address this need by a combination of a maximum entropy\nclassifier, and integer linear programming. We use the later to handle\nconstraints on what is an acceptable classification of the features to be\nextracted. With experimental results, we demonstrate substantial advantages in\nusing global constraints (such as the features describing the patient group,\nand the interventions, must occur before the features describing the results of\nthe comparison).", "published": "2015-09-17 11:20:35", "link": "http://arxiv.org/abs/1509.05209v1", "categories": ["cs.CL", "cs.AI"], "primary_category": "cs.CL"}
{"title": "Network analysis of named entity co-occurrences in written texts", "abstract": "The use of methods borrowed from statistics and physics to analyze written\ntexts has allowed the discovery of unprecedent patterns of human behavior and\ncognition by establishing links between models features and language structure.\nWhile current models have been useful to unveil patterns via analysis of\nsyntactical and semantical networks, only a few works have probed the relevance\nof investigating the structure arising from the relationship between relevant\nentities such as characters, locations and organizations. In this study, we\nrepresent entities appearing in the same context as a co-occurrence network,\nwhere links are established according to a null model based on random, shuffled\ntexts. Computational simulations performed in novels revealed that the proposed\nmodel displays interesting topological features, such as the small world\nfeature, characterized by high values of clustering coefficient. The\neffectiveness of our model was verified in a practical pattern recognition task\nin real networks. When compared with traditional word adjacency networks, our\nmodel displayed optimized results in identifying unknown references in texts.\nBecause the proposed representation plays a complementary role in\ncharacterizing unstructured documents via topological analysis of named\nentities, we believe that it could be useful to improve the characterization of\nwritten texts (and related systems), specially if combined with traditional\napproaches based on statistical and deeper paradigms.", "published": "2015-09-17 15:08:36", "link": "http://arxiv.org/abs/1509.05281v2", "categories": ["cs.CL", "physics.data-an", "physics.soc-ph"], "primary_category": "cs.CL"}
