{"title": "Leveraging Word Embeddings for Spoken Document Summarization", "abstract": "Owing to the rapidly growing multimedia content available on the Internet,\nextractive spoken document summarization, with the purpose of automatically\nselecting a set of representative sentences from a spoken document to concisely\nexpress the most important theme of the document, has been an active area of\nresearch and experimentation. On the other hand, word embedding has emerged as\na newly favorite research subject because of its excellent performance in many\nnatural language processing (NLP)-related tasks. However, as far as we are\naware, there are relatively few studies investigating its use in extractive\ntext or speech summarization. A common thread of leveraging word embeddings in\nthe summarization process is to represent the document (or sentence) by\naveraging the word embeddings of the words occurring in the document (or\nsentence). Then, intuitively, the cosine similarity measure can be employed to\ndetermine the relevance degree between a pair of representations. Beyond the\ncontinued efforts made to improve the representation of words, this paper\nfocuses on building novel and efficient ranking models based on the general\nword embedding methods for extractive speech summarization. Experimental\nresults demonstrate the effectiveness of our proposed methods, compared to\nexisting state-of-the-art methods.", "published": "2015-06-14 09:18:36", "link": "http://arxiv.org/abs/1506.04365v1", "categories": ["cs.CL", "cs.AI"], "primary_category": "cs.CL"}
{"title": "Linguistics and some aspects of its underlying dynamics", "abstract": "In recent years, central components of a new approach to linguistics, the\nMinimalist Program (MP) have come closer to physics. Features of the Minimalist\nProgram, such as the unconstrained nature of recursive Merge, the operation of\nthe Labeling Algorithm that only operates at the interface of Narrow Syntax\nwith the Conceptual-Intentional and the Sensory-Motor interfaces, the\ndifference between pronounced and un-pronounced copies of elements in a\nsentence and the build-up of the Fibonacci sequence in the syntactic derivation\nof sentence structures, are directly accessible to representation in terms of\nalgebraic formalism. Although in our scheme linguistic structures are classical\nones, we find that an interesting and productive isomorphism can be established\nbetween the MP structure, algebraic structures and many-body field theory\nopening new avenues of inquiry on the dynamics underlying some central aspects\nof linguistics.", "published": "2015-06-14 12:09:01", "link": "http://arxiv.org/abs/1506.08663v1", "categories": ["cs.CL", "quant-ph"], "primary_category": "cs.CL"}
