{"title": "Towards Understanding Egyptian Arabic Dialogues", "abstract": "Labelling of user's utterances to understanding his attends which called\nDialogue Act (DA) classification, it is considered the key player for dialogue\nlanguage understanding layer in automatic dialogue systems. In this paper, we\nproposed a novel approach to user's utterances labeling for Egyptian\nspontaneous dialogues and Instant Messages using Machine Learning (ML) approach\nwithout relying on any special lexicons, cues, or rules. Due to the lack of\nEgyptian dialect dialogue corpus, the system evaluated by multi-genre corpus\nincludes 4725 utterances for three domains, which are collected and annotated\nmanually from Egyptian call-centers. The system achieves F1 scores of 70. 36%\noverall domains.", "published": "2015-07-14 02:47:40", "link": "http://arxiv.org/abs/1509.03208v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Recurrent Polynomial Network for Dialogue State Tracking", "abstract": "Dialogue state tracking (DST) is a process to estimate the distribution of\nthe dialogue states as a dialogue progresses. Recent studies on constrained\nMarkov Bayesian polynomial (CMBP) framework take the first step towards\nbridging the gap between rule-based and statistical approaches for DST. In this\npaper, the gap is further bridged by a novel framework -- recurrent polynomial\nnetwork (RPN). RPN's unique structure enables the framework to have all the\nadvantages of CMBP including efficiency, portability and interpretability.\nAdditionally, RPN achieves more properties of statistical approaches than CMBP.\nRPN was evaluated on the data corpora of the second and the third Dialog State\nTracking Challenge (DSTC-2/3). Experiments showed that RPN can significantly\noutperform both traditional rule-based approaches and statistical approaches\nwith similar feature set. Compared with the state-of-the-art statistical DST\napproaches with a lot richer features, RPN is also competitive.", "published": "2015-07-14 17:18:30", "link": "http://arxiv.org/abs/1507.03934v2", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Feature Normalisation for Robust Speech Recognition", "abstract": "Speech recognition system performance degrades in noisy environments. If the\nacoustic models are built using features of clean utterances, the features of a\nnoisy test utterance would be acoustically mismatched with the trained model.\nThis gives poor likelihoods and poor recognition accuracy. Model adaptation and\nfeature normalisation are two broad areas that address this problem. While the\nformer often gives better performance, the latter involves estimation of lesser\nnumber of parameters, making the system feasible for practical implementations.\n  This research focuses on the efficacies of various subspace, statistical and\nstereo based feature normalisation techniques. A subspace projection based\nmethod has been investigated as a standalone and adjunct technique involving\nreconstruction of noisy speech features from a precomputed set of clean speech\nbuilding-blocks. The building blocks are learned using non-negative matrix\nfactorisation (NMF) on log-Mel filter bank coefficients, which form a basis for\nthe clean speech subspace. The work provides a detailed study on how the method\ncan be incorporated into the extraction process of Mel-frequency cepstral\ncoefficients. Experimental results show that the new features are robust to\nnoise, and achieve better results when combined with the existing techniques.\n  The work also proposes a modification to the training process of SPLICE\nalgorithm for noise robust speech recognition. It is based on feature\ncorrelations, and enables this stereo-based algorithm to improve the\nperformance in all noise conditions, especially in unseen cases. Further, the\nmodified framework is extended to work for non-stereo datasets where clean and\nnoisy training utterances, but not stereo counterparts, are required. An\nMLLR-based computationally efficient run-time noise adaptation method in SPLICE\nframework has been proposed.", "published": "2015-07-14 20:34:16", "link": "http://arxiv.org/abs/1507.04019v1", "categories": ["cs.CL", "cs.SD"], "primary_category": "cs.CL"}
