{"title": "Open Data Platform for Knowledge Access in Plant Health Domain : VESPA\n  Mining", "abstract": "Important data are locked in ancient literature. It would be uneconomic to\nproduce these data again and today or to extract them without the help of text\nmining technologies. Vespa is a text mining project whose aim is to extract\ndata on pest and crops interactions, to model and predict attacks on crops, and\nto reduce the use of pesticides. A few attempts proposed an agricultural\ninformation access. Another originality of our work is to parse documents with\na dependency of the document architecture.", "published": "2015-04-23 08:27:29", "link": "http://arxiv.org/abs/1504.06077v1", "categories": ["cs.IR", "cs.CL"], "primary_category": "cs.IR"}
{"title": "x.ent: R Package for Entities and Relations Extraction based on\n  Unsupervised Learning and Document Structure", "abstract": "Relation extraction with accurate precision is still a challenge when\nprocessing full text databases. We propose an approach based on cooccurrence\nanalysis in each document for which we used document organization to improve\naccuracy of relation extraction. This approach is implemented in a R package\ncalled \\emph{x.ent}. Another facet of extraction relies on use of extracted\nrelation into a querying system for expert end-users. Two datasets had been\nused. One of them gets interest from specialists of epidemiology in plant\nhealth. For this dataset usage is dedicated to plant-disease exploration\nthrough agricultural information news. An open-data platform exploits exports\nfrom \\emph{x.ent} and is publicly available.", "published": "2015-04-23 08:28:01", "link": "http://arxiv.org/abs/1504.06078v1", "categories": ["cs.CL", "cs.AI"], "primary_category": "cs.CL"}
{"title": "svcR: An R Package for Support Vector Clustering improved with Geometric\n  Hashing applied to Lexical Pattern Discovery", "abstract": "We present a new R package which takes a numerical matrix format as data\ninput, and computes clusters using a support vector clustering method (SVC). We\nhave implemented an original 2D-grid labeling approach to speed up cluster\nextraction. In this sense, SVC can be seen as an efficient cluster extraction\nif clusters are separable in a 2-D map. Secondly we showed that this SVC\napproach using a Jaccard-Radial base kernel can help to classify well enough a\nset of terms into ontological classes and help to define regular expression\nrules for information extraction in documents; our case study concerns a set of\nterms and documents about developmental and molecular biology.", "published": "2015-04-23 08:29:11", "link": "http://arxiv.org/abs/1504.06080v1", "categories": ["cs.LG", "cs.CL"], "primary_category": "cs.LG"}
{"title": "Multimodal Convolutional Neural Networks for Matching Image and Sentence", "abstract": "In this paper, we propose multimodal convolutional neural networks (m-CNNs)\nfor matching image and sentence. Our m-CNN provides an end-to-end framework\nwith convolutional architectures to exploit image representation, word\ncomposition, and the matching relations between the two modalities. More\nspecifically, it consists of one image CNN encoding the image content, and one\nmatching CNN learning the joint representation of image and sentence. The\nmatching CNN composes words to different semantic fragments and learns the\ninter-modal relations between image and the composed fragments at different\nlevels, thus fully exploit the matching relations between image and sentence.\nExperimental results on benchmark databases of bidirectional image and sentence\nretrieval demonstrate that the proposed m-CNNs can effectively capture the\ninformation necessary for image and sentence matching. Specifically, our\nproposed m-CNNs for bidirectional image and sentence retrieval on Flickr30K and\nMicrosoft COCO databases achieve the state-of-the-art performances.", "published": "2015-04-23 07:10:13", "link": "http://arxiv.org/abs/1504.06063v5", "categories": ["cs.CV", "cs.CL", "cs.NE"], "primary_category": "cs.CV"}
{"title": "Analysis of Stopping Active Learning based on Stabilizing Predictions", "abstract": "Within the natural language processing (NLP) community, active learning has\nbeen widely investigated and applied in order to alleviate the annotation\nbottleneck faced by developers of new NLP systems and technologies. This paper\npresents the first theoretical analysis of stopping active learning based on\nstabilizing predictions (SP). The analysis has revealed three elements that are\ncentral to the success of the SP method: (1) bounds on Cohen's Kappa agreement\nbetween successively trained models impose bounds on differences in F-measure\nperformance of the models; (2) since the stop set does not have to be labeled,\nit can be made large in practice, helping to guarantee that the results\ntransfer to previously unseen streams of examples at test/application time; and\n(3) good (low variance) sample estimates of Kappa between successive models can\nbe obtained. Proofs of relationships between the level of Kappa agreement and\nthe difference in performance between consecutive models are presented.\nSpecifically, if the Kappa agreement between two models exceeds a threshold T\n(where $T>0$), then the difference in F-measure performance between those\nmodels is bounded above by $\\frac{4(1-T)}{T}$ in all cases. If precision of the\npositive conjunction of the models is assumed to be $p$, then the bound can be\ntightened to $\\frac{4(1-T)}{(p+1)T}$.", "published": "2015-04-23 20:07:01", "link": "http://arxiv.org/abs/1504.06329v1", "categories": ["cs.LG", "cs.CL", "stat.ML", "I.5.1; I.5.4; G.3; I.2.7; I.2.6"], "primary_category": "cs.LG"}
