{"title": "Annotating Cognates and Etymological Origin in Turkic Languages", "abstract": "Turkic languages exhibit extensive and diverse etymological relationships\namong lexical items. These relationships make the Turkic languages promising\nfor exploring automated translation lexicon induction by leveraging cognate and\nother etymological information. However, due to the extent and diversity of the\ntypes of relationships between words, it is not clear how to annotate such\ninformation. In this paper, we present a methodology for annotating cognates\nand etymological origin in Turkic languages. Our method strives to balance the\namount of research effort the annotator expends with the utility of the\nannotations for supporting research on improving automated translation lexicon\ninduction.", "published": "2015-01-13 22:14:57", "link": "http://arxiv.org/abs/1501.03191v1", "categories": ["cs.CL", "I.2.7"], "primary_category": "cs.CL"}
{"title": "Towards Deep Semantic Analysis Of Hashtags", "abstract": "Hashtags are semantico-syntactic constructs used across various social\nnetworking and microblogging platforms to enable users to start a topic\nspecific discussion or classify a post into a desired category. Segmenting and\nlinking the entities present within the hashtags could therefore help in better\nunderstanding and extraction of information shared across the social media.\nHowever, due to lack of space delimiters in the hashtags (e.g #nsavssnowden),\nthe segmentation of hashtags into constituent entities (\"NSA\" and \"Edward\nSnowden\" in this case) is not a trivial task. Most of the current\nstate-of-the-art social media analytics systems like Sentiment Analysis and\nEntity Linking tend to either ignore hashtags, or treat them as a single word.\nIn this paper, we present a context aware approach to segment and link entities\nin the hashtags to a knowledge base (KB) entry, based on the context within the\ntweet. Our approach segments and links the entities in hashtags such that the\ncoherence between hashtag semantics and the tweet is maximized. To the best of\nour knowledge, no existing study addresses the issue of linking entities in\nhashtags for extracting semantic information. We evaluate our method on two\ndifferent datasets, and demonstrate the effectiveness of our technique in\nimproving the overall entity linking in tweets via additional semantic\ninformation provided by segmenting and linking entities in a hashtag.", "published": "2015-01-13 23:51:29", "link": "http://arxiv.org/abs/1501.03210v1", "categories": ["cs.IR", "cs.CL"], "primary_category": "cs.IR"}
