{"title": "Modeling Order in Neural Word Embeddings at Scale", "abstract": "Natural Language Processing (NLP) systems commonly leverage bag-of-words\nco-occurrence techniques to capture semantic and syntactic word relationships.\nThe resulting word-level distributed representations often ignore morphological\ninformation, though character-level embeddings have proven valuable to NLP\ntasks. We propose a new neural language model incorporating both word order and\ncharacter order in its embedding. The model produces several vector spaces with\nmeaningful substructure, as evidenced by its performance of 85.8% on a recent\nword-analogy task, exceeding best published syntactic word-analogy scores by a\n58% error margin. Furthermore, the model includes several parallel training\nmethods, most notably allowing a skip-gram network with 160 billion parameters\nto be trained overnight on 3 multi-core CPUs, 14x larger than the previous\nlargest neural network.", "published": "2015-06-08 02:21:46", "link": "http://arxiv.org/abs/1506.02338v3", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Learning to Transduce with Unbounded Memory", "abstract": "Recently, strong results have been demonstrated by Deep Recurrent Neural\nNetworks on natural language transduction problems. In this paper we explore\nthe representational power of these models using synthetic grammars designed to\nexhibit phenomena similar to those found in real transduction problems such as\nmachine translation. These experiments lead us to propose new memory-based\nrecurrent networks that implement continuously differentiable analogues of\ntraditional data structures such as Stacks, Queues, and DeQues. We show that\nthese architectures exhibit superior generalisation performance to Deep RNNs\nand are often able to learn the underlying generating algorithms in our\ntransduction experiments.", "published": "2015-06-08 14:23:30", "link": "http://arxiv.org/abs/1506.02516v3", "categories": ["cs.NE", "cs.CL", "cs.LG", "68T05", "I.5.1; I.2.6; I.2.7"], "primary_category": "cs.NE"}
