{"title": "Learning to Understand Phrases by Embedding the Dictionary", "abstract": "Distributional models that learn rich semantic word representations are a\nsuccess story of recent NLP research. However, developing models that learn\nuseful representations of phrases and sentences has proved far harder. We\npropose using the definitions found in everyday dictionaries as a means of\nbridging this gap between lexical and phrasal semantics. Neural language\nembedding models can be effectively trained to map dictionary definitions\n(phrases) to (lexical) representations of the words defined by those\ndefinitions. We present two applications of these architectures: \"reverse\ndictionaries\" that return the name of a concept given a definition or\ndescription and general-knowledge crossword question answerers. On both tasks,\nneural language embedding models trained on definitions from a handful of\nfreely-available lexical resources perform as well or better than existing\ncommercial systems that rely on significant task-specific engineering. The\nresults highlight the effectiveness of both neural embedding architectures and\ndefinition-based training for developing models that understand phrases and\nsentences.", "published": "2015-04-02 13:30:27", "link": "http://arxiv.org/abs/1504.00548v4", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Eliciting Disease Data from Wikipedia Articles", "abstract": "Traditional disease surveillance systems suffer from several disadvantages,\nincluding reporting lags and antiquated technology, that have caused a movement\ntowards internet-based disease surveillance systems. Internet systems are\nparticularly attractive for disease outbreaks because they can provide data in\nnear real-time and can be verified by individuals around the globe. However,\nmost existing systems have focused on disease monitoring and do not provide a\ndata repository for policy makers or researchers. In order to fill this gap, we\nanalyzed Wikipedia article content.\n  We demonstrate how a named-entity recognizer can be trained to tag case\ncounts, death counts, and hospitalization counts in the article narrative that\nachieves an F1 score of 0.753. We also show, using the 2014 West African Ebola\nvirus disease epidemic article as a case study, that there are detailed time\nseries data that are consistently updated that closely align with ground truth\ndata.\n  We argue that Wikipedia can be used to create the first community-driven\nopen-source emerging disease detection, monitoring, and repository system.", "published": "2015-04-02 19:34:01", "link": "http://arxiv.org/abs/1504.00657v4", "categories": ["cs.IR", "cs.CL", "cs.SI", "q-bio.PE"], "primary_category": "cs.IR"}
