{"title": "Deep Learning Applied to Image and Text Matching", "abstract": "The ability to describe images with natural language sentences is the\nhallmark for image and language understanding. Such a system has wide ranging\napplications such as annotating images and using natural sentences to search\nfor images.In this project we focus on the task of bidirectional image\nretrieval: such asystem is capable of retrieving an image based on a sentence\n(image search) andretrieve sentence based on an image query (image annotation).\nWe present asystem based on a global ranking objective function which uses a\ncombinationof convolutional neural networks (CNN) and multi layer perceptrons\n(MLP).It takes a pair of image and sentence and processes them in different\nchannels,finally embedding it into a common multimodal vector space. These\nembeddingsencode abstract semantic information about the two inputs and can be\ncomparedusing traditional information retrieval approaches. For each such pair,\nthe modelreturns a score which is interpretted as a similarity metric. If this\nscore is high,the image and sentence are likely to convey similar meaning, and\nif the score is low then they are likely not to.\n  The visual input is modeled via deep convolutional neural network. On\ntheother hand we explore three models for the textual module. The first one\nisbag of words with an MLP. The second one uses n-grams (bigram, trigrams,and a\ncombination of trigram & skip-grams) with an MLP. The third is morespecialized\ndeep network specific for modeling variable length sequences (SSE).We report\ncomparable performance to recent work in the field, even though ouroverall\nmodel is simpler. We also show that the training time choice of how wecan\ngenerate our negative samples has a significant impact on performance, and can\nbe used to specialize the bi-directional system in one particular task.", "published": "2015-09-14 17:19:33", "link": "http://arxiv.org/abs/1601.03478v1", "categories": ["cs.LG", "cs.CL", "cs.CV"], "primary_category": "cs.LG"}
{"title": "Twitter Sentiment Analysis", "abstract": "This project addresses the problem of sentiment analysis in twitter; that is\nclassifying tweets according to the sentiment expressed in them: positive,\nnegative or neutral. Twitter is an online micro-blogging and social-networking\nplatform which allows users to write short status updates of maximum length 140\ncharacters. It is a rapidly expanding service with over 200 million registered\nusers - out of which 100 million are active users and half of them log on\ntwitter on a daily basis - generating nearly 250 million tweets per day. Due to\nthis large amount of usage we hope to achieve a reflection of public sentiment\nby analysing the sentiments expressed in the tweets. Analysing the public\nsentiment is important for many applications such as firms trying to find out\nthe response of their products in the market, predicting political elections\nand predicting socioeconomic phenomena like stock exchange. The aim of this\nproject is to develop a functional classifier for accurate and automatic\nsentiment classification of an unknown tweet stream.", "published": "2015-09-14 17:39:37", "link": "http://arxiv.org/abs/1509.04219v1", "categories": ["cs.CL", "cs.IR", "cs.SI"], "primary_category": "cs.CL"}
