{"title": "Analysis of the South Slavic Scripts by Run-Length Features of the Image\n  Texture", "abstract": "The paper proposes an algorithm for the script recognition based on the\ntexture characteristics. The image texture is achieved by coding each letter\nwith the equivalent script type (number code) according to its position in the\ntext line. Each code is transformed into equivalent gray level pixel creating\nan 1-D image. Then, the image texture is subjected to the run-length analysis.\nThis analysis extracts the run-length features, which are classified to make a\ndistinction between the scripts under consideration. In the experiment, a\ncustom oriented database is subject to the proposed algorithm. The database\nconsists of some text documents written in Cyrillic, Latin and Glagolitic\nscripts. Furthermore, it is divided into training and test parts. The results\nof the experiment show that 3 out of 5 run-length features can be used for\neffective differentiation between the analyzed South Slavic scripts.", "published": "2015-07-17 10:34:23", "link": "http://arxiv.org/abs/1507.04908v1", "categories": ["cs.CV", "cs.CL"], "primary_category": "cs.CV"}
{"title": "Building End-To-End Dialogue Systems Using Generative Hierarchical\n  Neural Network Models", "abstract": "We investigate the task of building open domain, conversational dialogue\nsystems based on large dialogue corpora using generative models. Generative\nmodels produce system responses that are autonomously generated word-by-word,\nopening up the possibility for realistic, flexible interactions. In support of\nthis goal, we extend the recently proposed hierarchical recurrent\nencoder-decoder neural network to the dialogue domain, and demonstrate that\nthis model is competitive with state-of-the-art neural language models and\nback-off n-gram models. We investigate the limitations of this and similar\napproaches, and show how its performance can be improved by bootstrapping the\nlearning from a larger question-answer pair corpus and from pretrained word\nembeddings.", "published": "2015-07-17 00:21:39", "link": "http://arxiv.org/abs/1507.04808v3", "categories": ["cs.CL", "cs.AI", "cs.LG", "cs.NE", "I.5.1; I.2.7"], "primary_category": "cs.CL"}
