{"title": "A Survey and Classification of Controlled Natural Languages", "abstract": "What is here called controlled natural language (CNL) has traditionally been\ngiven many different names. Especially during the last four decades, a wide\nvariety of such languages have been designed. They are applied to improve\ncommunication among humans, to improve translation, or to provide natural and\nintuitive representations for formal notations. Despite the apparent\ndifferences, it seems sensible to put all these languages under the same\numbrella. To bring order to the variety of languages, a general classification\nscheme is presented here. A comprehensive survey of existing English-based CNLs\nis given, listing and describing 100 languages from 1930 until today.\nClassification of these languages reveals that they form a single scattered\ncloud filling the conceptual space between natural languages such as English on\nthe one end and formal languages such as propositional logic on the other. The\ngoal of this article is to provide a common terminology and a common model for\nCNL, to contribute to the understanding of their general nature, to provide a\nstarting point for researchers interested in the area, and to help developers\nto make design decisions.", "published": "2015-07-07 08:23:31", "link": "http://arxiv.org/abs/1507.01701v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Dependency-based Convolutional Neural Networks for Sentence Embedding", "abstract": "In sentence modeling and classification, convolutional neural network\napproaches have recently achieved state-of-the-art results, but all such\nefforts process word vectors sequentially and neglect long-distance\ndependencies. To exploit both deep learning and linguistic structures, we\npropose a tree-based convolutional neural network model which exploit various\nlong-distance relationships between words. Our model improves the sequential\nbaselines on all three sentiment and question classification tasks, and\nachieves the highest published accuracy on TREC.", "published": "2015-07-07 15:20:36", "link": "http://arxiv.org/abs/1507.01839v2", "categories": ["cs.CL", "cs.AI", "cs.LG"], "primary_category": "cs.CL"}
