{"title": "Phrase database Approach to structural and semantic disambiguation in\n  English-Korean Machine Translation", "abstract": "In machine translation it is common phenomenon that machine-readable\ndictionaries and standard parsing rules are not enough to ensure accuracy in\nparsing and translating English phrases into Korean language, which is revealed\nin misleading translation results due to consequent structural and semantic\nambiguities. This paper aims to suggest a solution to structural and semantic\nambiguities due to the idiomaticity and non-grammaticalness of phrases commonly\nused in English language by applying bilingual phrase database in\nEnglish-Korean Machine Translation (EKMT). This paper firstly clarifies what\nthe phrase unit in EKMT is based on the definition of the English phrase,\nsecondly clarifies what kind of language unit can be the target of the phrase\ndatabase for EKMT, thirdly suggests a way to build the phrase database by\npresenting the format of the phrase database with examples, and finally\ndiscusses briefly the method to apply this bilingual phrase database to the\nEKMT for structural and semantic disambiguation.", "published": "2015-03-19 01:37:40", "link": "http://arxiv.org/abs/1503.05626v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Syntagma Lexical Database", "abstract": "This paper discusses the structure of Syntagma's Lexical Database (focused on\nItalian). The basic database consists in four tables. Table Forms contains word\ninflections, used by the POS-tagger for the identification of input-words.\nForms is related to Lemma. Table Lemma stores all kinds of grammatical features\nof words, word-level semantic data and restrictions. In the table Meanings\nmeaning-related data are stored: definition, examples, domain, and semantic\ninformation. Table Valency contains the argument structure of each meaning,\nwith syntactic and semantic features for each argument. The extended version of\nSLD contains the links to Syntagma's Semantic Net and to the WordNet synsets of\nother languages.", "published": "2015-03-19 19:45:24", "link": "http://arxiv.org/abs/1503.05907v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
