{"title": "Category Enhanced Word Embedding", "abstract": "Distributed word representations have been demonstrated to be effective in\ncapturing semantic and syntactic regularities. Unsupervised representation\nlearning from large unlabeled corpora can learn similar representations for\nthose words that present similar co-occurrence statistics. Besides local\noccurrence statistics, global topical information is also important knowledge\nthat may help discriminate a word from another. In this paper, we incorporate\ncategory information of documents in the learning of word representations and\nto learn the proposed models in a document-wise manner. Our models outperform\nseveral state-of-the-art models in word analogy and word similarity tasks.\nMoreover, we evaluate the learned word vectors on sentiment analysis and text\nclassification tasks, which shows the superiority of our learned word vectors.\nWe also learn high-quality category embeddings that reflect topical meanings.", "published": "2015-11-27 11:38:57", "link": "http://arxiv.org/abs/1511.08629v2", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "A C-LSTM Neural Network for Text Classification", "abstract": "Neural network models have been demonstrated to be capable of achieving\nremarkable performance in sentence and document modeling. Convolutional neural\nnetwork (CNN) and recurrent neural network (RNN) are two mainstream\narchitectures for such modeling tasks, which adopt totally different ways of\nunderstanding natural languages. In this work, we combine the strengths of both\narchitectures and propose a novel and unified model called C-LSTM for sentence\nrepresentation and text classification. C-LSTM utilizes CNN to extract a\nsequence of higher-level phrase representations, and are fed into a long\nshort-term memory recurrent neural network (LSTM) to obtain the sentence\nrepresentation. C-LSTM is able to capture both local features of phrases as\nwell as global and temporal sentence semantics. We evaluate the proposed\narchitecture on sentiment classification and question classification tasks. The\nexperimental results show that the C-LSTM outperforms both CNN and LSTM and can\nachieve excellent performance on these tasks.", "published": "2015-11-27 11:44:17", "link": "http://arxiv.org/abs/1511.08630v2", "categories": ["cs.CL"], "primary_category": "cs.CL"}
