{"title": "The SYSU System for the Interspeech 2015 Automatic Speaker Verification\n  Spoofing and Countermeasures Challenge", "abstract": "Many existing speaker verification systems are reported to be vulnerable\nagainst different spoofing attacks, for example speaker-adapted speech\nsynthesis, voice conversion, play back, etc. In order to detect these spoofed\nspeech signals as a countermeasure, we propose a score level fusion approach\nwith several different i-vector subsystems. We show that the acoustic level\nMel-frequency cepstral coefficients (MFCC) features, the phase level modified\ngroup delay cepstral coefficients (MGDCC) and the phonetic level phoneme\nposterior probability (PPP) tandem features are effective for the\ncountermeasure. Furthermore, feature level fusion of these features before\ni-vector modeling also enhance the performance. A polynomial kernel support\nvector machine is adopted as the supervised classifier. In order to enhance the\ngeneralizability of the countermeasure, we also adopted the cosine similarity\nand PLDA scoring as one-class classifications methods. By combining the\nproposed i-vector subsystems with the OpenSMILE baseline which covers the\nacoustic and prosodic information further improves the final performance. The\nproposed fusion system achieves 0.29% and 3.26% EER on the development and test\nset of the database provided by the INTERSPEECH 2015 automatic speaker\nverification spoofing and countermeasures challenge.", "published": "2015-07-24 00:36:01", "link": "http://arxiv.org/abs/1507.06711v2", "categories": ["cs.SD", "cs.CL"], "primary_category": "cs.SD"}
{"title": "YARBUS : Yet Another Rule Based belief Update System", "abstract": "We introduce a new rule based system for belief tracking in dialog systems.\nDespite the simplicity of the rules being considered, the proposed belief\ntracker ranks favourably compared to the previous submissions on the second and\nthird Dialog State Tracking challenges. The results of this simple tracker\nallows to reconsider the performances of previous submissions using more\nelaborate techniques.", "published": "2015-07-24 13:21:59", "link": "http://arxiv.org/abs/1507.06837v1", "categories": ["cs.CL", "cs.AI"], "primary_category": "cs.CL"}
{"title": "The Polylingual Labeled Topic Model", "abstract": "In this paper, we present the Polylingual Labeled Topic Model, a model which\ncombines the characteristics of the existing Polylingual Topic Model and\nLabeled LDA. The model accounts for multiple languages with separate topic\ndistributions for each language while restricting the permitted topics of a\ndocument to a set of predefined labels. We explore the properties of the model\nin a two-language setting on a dataset from the social science domain. Our\nexperiments show that our model outperforms LDA and Labeled LDA in terms of\ntheir held-out perplexity and that it produces semantically coherent topics\nwhich are well interpretable by human subjects.", "published": "2015-07-24 13:01:20", "link": "http://arxiv.org/abs/1507.06829v1", "categories": ["cs.CL", "cs.IR", "cs.LG", "G.3; I.2.7"], "primary_category": "cs.CL"}
{"title": "Fast and Accurate Recurrent Neural Network Acoustic Models for Speech\n  Recognition", "abstract": "We have recently shown that deep Long Short-Term Memory (LSTM) recurrent\nneural networks (RNNs) outperform feed forward deep neural networks (DNNs) as\nacoustic models for speech recognition. More recently, we have shown that the\nperformance of sequence trained context dependent (CD) hidden Markov model\n(HMM) acoustic models using such LSTM RNNs can be equaled by sequence trained\nphone models initialized with connectionist temporal classification (CTC). In\nthis paper, we present techniques that further improve performance of LSTM RNN\nacoustic models for large vocabulary speech recognition. We show that frame\nstacking and reduced frame rate lead to more accurate models and faster\ndecoding. CD phone modeling leads to further improvements. We also present\ninitial results for LSTM RNN models outputting words directly.", "published": "2015-07-24 18:28:32", "link": "http://arxiv.org/abs/1507.06947v1", "categories": ["cs.CL", "cs.LG", "cs.NE", "stat.ML"], "primary_category": "cs.CL"}
