{"title": "Dependency length minimization: Puzzles and Promises", "abstract": "In the recent issue of PNAS, Futrell et al. claims that their study of 37\nlanguages gives the first large scale cross-language evidence for Dependency\nLength Minimization, which is an overstatement that ignores similar previous\nresearches. In addition,this study seems to pay no attention to factors like\nthe uniformity of genres,which weakens the validity of the argument that DLM is\nuniversal. Another problem is that this study sets the baseline random language\nas projective, which fails to truly uncover the difference between natural\nlanguage and random language, since projectivity is an important feature of\nmany natural languages. Finally, the paper contends an \"apparent relationship\nbetween head finality and dependency length\" despite the lack of an explicit\nstatistical comparison, which renders this conclusion rather hasty and\nimproper.", "published": "2015-09-15 04:29:50", "link": "http://arxiv.org/abs/1509.04393v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Splitting Compounds by Semantic Analogy", "abstract": "Compounding is a highly productive word-formation process in some languages\nthat is often problematic for natural language processing applications. In this\npaper, we investigate whether distributional semantics in the form of word\nembeddings can enable a deeper, i.e., more knowledge-rich, processing of\ncompounds than the standard string-based methods. We present an unsupervised\napproach that exploits regularities in the semantic vector space (based on\nanalogies such as \"bookshop is to shop as bookshelf is to shelf\") to produce\ncompound analyses of high quality. A subsequent compound splitting algorithm\nbased on these analyses is highly effective, particularly for ambiguous\ncompounds. German to English machine translation experiments show that this\nsemantic analogy-based compound splitter leads to better translations than a\ncommonly used frequency-based method.", "published": "2015-09-15 10:03:35", "link": "http://arxiv.org/abs/1509.04473v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
