{"title": "Bias and population structure in the actuation of sound change", "abstract": "Why do human languages change at some times, and not others? We address this\nlongstanding question from a computational perspective, focusing on the case of\nsound change. Sound change arises from the pronunciation variability ubiquitous\nin every speech community, but most such variability does not lead to change.\nHence, an adequate model must allow for stability as well as change. Existing\ntheories of sound change tend to emphasize factors at the level of individual\nlearners promoting one outcome or the other, such as channel bias (which favors\nchange) or inductive bias (which favors stability). Here, we consider how the\ninteraction of these biases can lead to both stability and change in a\npopulation setting. We find that population structure itself can act as a\nsource of stability, but that both stability and change are possible only when\nboth types of bias are active, suggesting that it is possible to understand why\nsound change occurs at some times and not others as the population-level result\nof the interplay between forces promoting each outcome in individual speakers.\nIn addition, if it is assumed that learners learn from two or more teachers,\nthe transition from stability to change is marked by a phase transition,\nconsistent with the abrupt transitions seen in many empirical cases of sound\nchange. The predictions of multiple-teacher models thus match empirical cases\nof sound change better than the predictions of single-teacher models,\nunderscoring the importance of modeling language change in a population\nsetting.", "published": "2015-07-16 00:27:02", "link": "http://arxiv.org/abs/1507.04420v1", "categories": ["cs.CL", "physics.soc-ph"], "primary_category": "cs.CL"}
{"title": "A Dependency-Based Neural Network for Relation Classification", "abstract": "Previous research on relation classification has verified the effectiveness\nof using dependency shortest paths or subtrees. In this paper, we further\nexplore how to make full use of the combination of these dependency\ninformation. We first propose a new structure, termed augmented dependency path\n(ADP), which is composed of the shortest dependency path between two entities\nand the subtrees attached to the shortest path. To exploit the semantic\nrepresentation behind the ADP structure, we develop dependency-based neural\nnetworks (DepNN): a recursive neural network designed to model the subtrees,\nand a convolutional neural network to capture the most important features on\nthe shortest path. Experiments on the SemEval-2010 dataset show that our\nproposed method achieves state-of-art results.", "published": "2015-07-16 16:43:55", "link": "http://arxiv.org/abs/1507.04646v1", "categories": ["cs.CL", "cs.LG", "cs.NE"], "primary_category": "cs.CL"}
{"title": "Exploratory topic modeling with distributional semantics", "abstract": "As we continue to collect and store textual data in a multitude of domains,\nwe are regularly confronted with material whose largely unknown thematic\nstructure we want to uncover. With unsupervised, exploratory analysis, no prior\nknowledge about the content is required and highly open-ended tasks can be\nsupported. In the past few years, probabilistic topic modeling has emerged as a\npopular approach to this problem. Nevertheless, the representation of the\nlatent topics as aggregations of semi-coherent terms limits their\ninterpretability and level of detail.\n  This paper presents an alternative approach to topic modeling that maps\ntopics as a network for exploration, based on distributional semantics using\nlearned word vectors. From the granular level of terms and their semantic\nsimilarity relations global topic structures emerge as clustered regions and\ngradients of concepts. Moreover, the paper discusses the visual interactive\nrepresentation of the topic map, which plays an important role in supporting\nits exploration.", "published": "2015-07-16 23:11:45", "link": "http://arxiv.org/abs/1507.04798v1", "categories": ["cs.IR", "cs.CL", "cs.LG"], "primary_category": "cs.IR"}
