{"title": "Fast k-best Sentence Compression", "abstract": "A popular approach to sentence compression is to formulate the task as a\nconstrained optimization problem and solve it with integer linear programming\n(ILP) tools. Unfortunately, dependence on ILP may make the compressor\nprohibitively slow, and thus approximation techniques have been proposed which\nare often complex and offer a moderate gain in speed. As an alternative\nsolution, we introduce a novel compression algorithm which generates k-best\ncompressions relying on local deletion decisions. Our algorithm is two orders\nof magnitude faster than a recent ILP-based method while producing better\ncompressions. Moreover, an extensive evaluation demonstrates that the quality\nof compressions does not degrade much as we move from single best to top-five\nresults.", "published": "2015-10-28 19:04:30", "link": "http://arxiv.org/abs/1510.08418v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Emoticons vs. Emojis on Twitter: A Causal Inference Approach", "abstract": "Online writing lacks the non-verbal cues present in face-to-face\ncommunication, which provide additional contextual information about the\nutterance, such as the speaker's intention or affective state. To fill this\nvoid, a number of orthographic features, such as emoticons, expressive\nlengthening, and non-standard punctuation, have become popular in social media\nservices including Twitter and Instagram. Recently, emojis have been introduced\nto social media, and are increasingly popular. This raises the question of\nwhether these predefined pictographic characters will come to replace earlier\northographic methods of paralinguistic communication. In this abstract, we\nattempt to shed light on this question, using a matching approach from causal\ninference to test whether the adoption of emojis causes individual users to\nemploy fewer emoticons in their text on Twitter.", "published": "2015-10-28 20:41:30", "link": "http://arxiv.org/abs/1510.08480v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "CBAS: context based arabic stemmer", "abstract": "Arabic morphology encapsulates many valuable features such as word root.\nArabic roots are being utilized for many tasks; the process of extracting a\nword root is referred to as stemming. Stemming is an essential part of most\nNatural Language Processing tasks, especially for derivative languages such as\nArabic. However, stemming is faced with the problem of ambiguity, where two or\nmore roots could be extracted from the same word. On the other hand,\ndistributional semantics is a powerful co-occurrence model. It captures the\nmeaning of a word based on its context. In this paper, a distributional\nsemantics model utilizing Smoothed Pointwise Mutual Information (SPMI) is\nconstructed to investigate its effectiveness on the stemming analysis task. It\nshowed an accuracy of 81.5%, with a at least 9.4% improvement over other\nstemmers.", "published": "2015-10-28 10:10:51", "link": "http://arxiv.org/abs/1611.00027v1", "categories": ["cs.CL", "cs.IR"], "primary_category": "cs.CL"}
