{"title": "A Knowledge-poor Pronoun Resolution System for Turkish", "abstract": "A pronoun resolution system which requires limited syntactic knowledge to\nidentify the antecedents of personal and reflexive pronouns in Turkish is\npresented. As in its counterparts for languages like English, Spanish and\nFrench, the core of the system is the constraints and preferences determined\nempirically. In the evaluation phase, it performed considerably better than the\nbaseline algorithm used for comparison. The system is significant for its being\nthe first fully specified knowledge-poor computational framework for pronoun\nresolution in Turkish where Turkish possesses different structural properties\nfrom the languages for which knowledge-poor systems had been developed.", "published": "2015-04-18 18:34:19", "link": "http://arxiv.org/abs/1504.04751v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Unsupervised Dependency Parsing: Let's Use Supervised Parsers", "abstract": "We present a self-training approach to unsupervised dependency parsing that\nreuses existing supervised and unsupervised parsing algorithms. Our approach,\ncalled `iterated reranking' (IR), starts with dependency trees generated by an\nunsupervised parser, and iteratively improves these trees using the richer\nprobability models used in supervised parsing that are in turn trained on these\ntrees. Our system achieves 1.8% accuracy higher than the state-of-the-part\nparser of Spitkovsky et al. (2013) on the WSJ corpus.", "published": "2015-04-18 00:23:16", "link": "http://arxiv.org/abs/1504.04666v1", "categories": ["cs.CL", "cs.LG"], "primary_category": "cs.CL"}
{"title": "Gap Analysis of Natural Language Processing Systems with respect to\n  Linguistic Modality", "abstract": "Modality is one of the important components of grammar in linguistics. It\nlets speaker to express attitude towards, or give assessment or potentiality of\nstate of affairs. It implies different senses and thus has different\nperceptions as per the context. This paper presents an account showing the gap\nin the functionality of the current state of art Natural Language Processing\n(NLP) systems. The contextual nature of linguistic modality is studied. In this\npaper, the works and logical approaches employed by Natural Language Processing\nsystems dealing with modality are reviewed. It sees human cognition and\nintelligence as multi-layered approach that can be implemented by intelligent\nsystems for learning. Lastly, current flow of research going on within this\nfield is talked providing futurology.", "published": "2015-04-18 13:28:59", "link": "http://arxiv.org/abs/1504.04716v1", "categories": ["cs.CL", "cs.AI"], "primary_category": "cs.CL"}
{"title": "Online Inference for Relation Extraction with a Reduced Feature Set", "abstract": "Access to web-scale corpora is gradually bringing robust automatic knowledge\nbase creation and extension within reach. To exploit these large\nunannotated---and extremely difficult to annotate---corpora, unsupervised\nmachine learning methods are required. Probabilistic models of text have\nrecently found some success as such a tool, but scalability remains an obstacle\nin their application, with standard approaches relying on sampling schemes that\nare known to be difficult to scale. In this report, we therefore present an\nempirical assessment of the sublinear time sparse stochastic variational\ninference (SSVI) scheme applied to RelLDA. We demonstrate that online inference\nleads to relatively strong qualitative results but also identify some of its\npathologies---and those of the model---which will need to be overcome if SSVI\nis to be used for large-scale relation extraction.", "published": "2015-04-18 22:08:50", "link": "http://arxiv.org/abs/1504.04770v1", "categories": ["cs.CL", "cs.LG"], "primary_category": "cs.CL"}
