{"title": "\"Draw My Topics\": Find Desired Topics fast from large scale of Corpus", "abstract": "We develop the \"Draw My Topics\" toolkit, which provides a fast way to\nincorporate social scientists' interest into standard topic modelling. Instead\nof using raw corpus with primitive processing as input, an algorithm based on\nVector Space Model and Conditional Entropy are used to connect social\nscientists' willingness and unsupervised topic models' output. Space for users'\nadjustment on specific corpus of their interest is also accommodated. We\ndemonstrate the toolkit's use on the Diachronic People's Daily Corpus in\nChinese.", "published": "2016-02-03 19:44:37", "link": "http://arxiv.org/abs/1602.01428v1", "categories": ["cs.CL", "cs.IR"], "primary_category": "cs.CL"}
{"title": "Spatial Concept Acquisition for a Mobile Robot that Integrates\n  Self-Localization and Unsupervised Word Discovery from Spoken Sentences", "abstract": "In this paper, we propose a novel unsupervised learning method for the\nlexical acquisition of words related to places visited by robots, from human\ncontinuous speech signals. We address the problem of learning novel words by a\nrobot that has no prior knowledge of these words except for a primitive\nacoustic model. Further, we propose a method that allows a robot to effectively\nuse the learned words and their meanings for self-localization tasks. The\nproposed method is nonparametric Bayesian spatial concept acquisition method\n(SpCoA) that integrates the generative model for self-localization and the\nunsupervised word segmentation in uttered sentences via latent variables\nrelated to the spatial concept. We implemented the proposed method SpCoA on\nSIGVerse, which is a simulation environment, and TurtleBot2, which is a mobile\nrobot in a real environment. Further, we conducted experiments for evaluating\nthe performance of SpCoA. The experimental results showed that SpCoA enabled\nthe robot to acquire the names of places from speech sentences. They also\nrevealed that the robot could effectively utilize the acquired spatial concepts\nand reduce the uncertainty in self-localization.", "published": "2016-02-03 06:56:51", "link": "http://arxiv.org/abs/1602.01208v3", "categories": ["cs.AI", "cs.CL", "cs.RO"], "primary_category": "cs.AI"}
{"title": "Using Hadoop for Large Scale Analysis on Twitter: A Technical Report", "abstract": "Sentiment analysis (or opinion mining) on Twitter data has attracted much\nattention recently. One of the system's key features, is the immediacy in\ncommunication with other users in an easy, user-friendly and fast way.\nConsequently, people tend to express their feelings freely, which makes Twitter\nan ideal source for accumulating a vast amount of opinions towards a wide\ndiversity of topics. This amount of information offers huge potential and can\nbe harnessed to receive the sentiment tendency towards these topics. However,\nsince none can invest an infinite amount of time to read through these tweets,\nan automated decision making approach is necessary. Nevertheless, most existing\nsolutions are limited in centralized environments only. Thus, they can only\nprocess at most a few thousand tweets. Such a sample, is not representative to\ndefine the sentiment polarity towards a topic due to the massive number of\ntweets published daily. In this paper, we go one step further and develop a\nnovel method for sentiment learning in the MapReduce framework. Our algorithm\nexploits the hashtags and emoticons inside a tweet, as sentiment labels, and\nproceeds to a classification procedure of diverse sentiment types in a parallel\nand distributed manner. Moreover, we utilize Bloom filters to compact the\nstorage size of intermediate data and boost the performance of our algorithm.\nThrough an extensive experimental evaluation, we prove that our solution is\nefficient, robust and scalable and confirm the quality of our sentiment\nidentification.", "published": "2016-02-03 10:19:19", "link": "http://arxiv.org/abs/1602.01248v1", "categories": ["cs.DB", "cs.CL", "cs.IR", "H.2.4"], "primary_category": "cs.DB"}
