{"title": "Classifying Patents Based on their Semantic Content", "abstract": "In this paper, we extend some usual techniques of classification resulting\nfrom a large-scale data-mining and network approach. This new technology, which\nin particular is designed to be suitable to big data, is used to construct an\nopen consolidated database from raw data on 4 million patents taken from the US\npatent office from 1976 onward. To build the pattern network, not only do we\nlook at each patent title, but we also examine their full abstract and extract\nthe relevant keywords accordingly. We refer to this classification as semantic\napproach in contrast with the more common technological approach which consists\nin taking the topology when considering US Patent office technological classes.\nMoreover, we document that both approaches have highly different topological\nmeasures and strong statistical evidence that they feature a different model.\nThis suggests that our method is a useful tool to extract endogenous\ninformation.", "published": "2016-12-27 05:59:55", "link": "http://arxiv.org/abs/1612.08504v1", "categories": ["physics.soc-ph", "cs.CL"], "primary_category": "physics.soc-ph"}
{"title": "The ontogeny of discourse structure mimics the development of literature", "abstract": "Discourse varies with age, education, psychiatric state and historical epoch,\nbut the ontogenetic and cultural dynamics of discourse structure remain to be\nquantitatively characterized. To this end we investigated word graphs obtained\nfrom verbal reports of 200 subjects ages 2-58, and 676 literary texts spanning\n~5,000 years. In healthy subjects, lexical diversity, graph size, and\nlong-range recurrence departed from initial near-random levels through a\nmonotonic asymptotic increase across ages, while short-range recurrence showed\na corresponding decrease. These changes were explained by education and suggest\na hierarchical development of discourse structure: short-range recurrence and\nlexical diversity stabilize after elementary school, but graph size and\nlong-range recurrence only stabilize after high school. This gradual maturation\nwas blurred in psychotic subjects, who maintained in adulthood a near-random\nstructure. In literature, monotonic asymptotic changes over time were\nremarkable: While lexical diversity, long-range recurrence and graph size\nincreased away from near-randomness, short-range recurrence declined, from\nabove to below random levels. Bronze Age texts are structurally similar to\nchildish or psychotic discourses, but subsequent texts converge abruptly to the\nhealthy adult pattern around the onset of the Axial Age (800-200 BC), a period\nof pivotal cultural change. Thus, individually as well as historically,\ndiscourse maturation increases the range of word recurrence away from\nrandomness.", "published": "2016-12-27 21:58:42", "link": "http://arxiv.org/abs/1612.09268v1", "categories": ["q-bio.NC", "cs.CL", "physics.soc-ph"], "primary_category": "q-bio.NC"}
{"title": "Distributed Real-Time Sentiment Analysis for Big Data Social Streams", "abstract": "Big data trend has enforced the data-centric systems to have continuous fast\ndata streams. In recent years, real-time analytics on stream data has formed\ninto a new research field, which aims to answer queries about\nwhat-is-happening-now with a negligible delay. The real challenge with\nreal-time stream data processing is that it is impossible to store instances of\ndata, and therefore online analytical algorithms are utilized. To perform\nreal-time analytics, pre-processing of data should be performed in a way that\nonly a short summary of stream is stored in main memory. In addition, due to\nhigh speed of arrival, average processing time for each instance of data should\nbe in such a way that incoming instances are not lost without being captured.\nLastly, the learner needs to provide high analytical accuracy measures.\nSentinel is a distributed system written in Java that aims to solve this\nchallenge by enforcing both the processing and learning process to be done in\ndistributed form. Sentinel is built on top of Apache Storm, a distributed\ncomputing platform. Sentinels learner, Vertical Hoeffding Tree, is a parallel\ndecision tree-learning algorithm based on the VFDT, with ability of enabling\nparallel classification in distributed environments. Sentinel also uses\nSpaceSaving to keep a summary of the data stream and stores its summary in a\nsynopsis data structure. Application of Sentinel on Twitter Public Stream API\nis shown and the results are discussed.", "published": "2016-12-27 09:10:18", "link": "http://arxiv.org/abs/1612.08543v1", "categories": ["stat.ML", "cs.CL", "cs.DB", "cs.DC", "cs.IR"], "primary_category": "stat.ML"}
