{"title": "Robsut Wrod Reocginiton via semi-Character Recurrent Neural Network", "abstract": "Language processing mechanism by humans is generally more robust than\ncomputers. The Cmabrigde Uinervtisy (Cambridge University) effect from the\npsycholinguistics literature has demonstrated such a robust word processing\nmechanism, where jumbled words (e.g. Cmabrigde / Cambridge) are recognized with\nlittle cost. On the other hand, computational models for word recognition (e.g.\nspelling checkers) perform poorly on data with such noise. Inspired by the\nfindings from the Cmabrigde Uinervtisy effect, we propose a word recognition\nmodel based on a semi-character level recurrent neural network (scRNN). In our\nexperiments, we demonstrate that scRNN has significantly more robust\nperformance in word spelling correction (i.e. word recognition) compared to\nexisting spelling checkers and character-based convolutional neural network.\nFurthermore, we demonstrate that the model is cognitively plausible by\nreplicating a psycholinguistics experiment about human reading difficulty using\nour model.", "published": "2016-08-07 13:28:46", "link": "http://arxiv.org/abs/1608.02214v2", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Automating Political Bias Prediction", "abstract": "Every day media generate large amounts of text. An unbiased view on media\nreports requires an understanding of the political bias of media content.\nAssistive technology for estimating the political bias of texts can be helpful\nin this context. This study proposes a simple statistical learning approach to\npredict political bias from text. Standard text features extracted from\nspeeches and manifestos of political parties are used to predict political bias\nin terms of political party affiliation and in terms of political views.\nResults indicate that political bias can be predicted with above chance\naccuracy. Mistakes of the model can be interpreted with respect to changes of\npolicies of political actors. Two approaches are presented to make the results\nmore interpretable: a) discriminative text features are related to the\npolitical orientation of a party and b) sentiment features of texts are\ncorrelated with a measure of political power. Political power appears to be\nstrongly correlated with positive sentiment of a text. To highlight some\npotential use cases a web application shows how the model can be used for texts\nfor which the political bias is not clear such as news articles.", "published": "2016-08-07 09:04:59", "link": "http://arxiv.org/abs/1608.02195v1", "categories": ["cs.SI", "cs.CL"], "primary_category": "cs.SI"}
{"title": "Reconciling Lambek's restriction, cut-elimination, and substitution in\n  the presence of exponential modalities", "abstract": "The Lambek calculus can be considered as a version of non-commutative\nintuitionistic linear logic. One of the interesting features of the Lambek\ncalculus is the so-called \"Lambek's restriction,\" that is, the antecedent of\nany provable sequent should be non-empty. In this paper we discuss ways of\nextending the Lambek calculus with the linear logic exponential modality while\nkeeping Lambek's restriction. Interestingly enough, we show that for any system\nequipped with a reasonable exponential modality the following holds: if the\nsystem enjoys cut elimination and substitution to the full extent, then the\nsystem necessarily violates Lambek's restriction. Nevertheless, we show that\ntwo of the three conditions can be implemented. Namely, we design a system with\nLambek's restriction and cut elimination and another system with Lambek's\nrestriction and substitution. For both calculi we prove that they are\nundecidable, even if we take only one of the two divisions provided by the\nLambek calculus. The system with cut elimination and substitution and without\nLambek's restriction is folklore and known to be undecidable.", "published": "2016-08-07 18:17:02", "link": "http://arxiv.org/abs/1608.02254v2", "categories": ["math.LO", "cs.CL", "03B47"], "primary_category": "math.LO"}
{"title": "Incorporation of Speech Duration Information in Score Fusion of Speaker\n  Recognition Systems", "abstract": "In recent years identity-vector (i-vector) based speaker verification (SV)\nsystems have become very successful. Nevertheless, environmental noise and\nspeech duration variability still have a significant effect on degrading the\nperformance of these systems. In many real-life applications, duration of\nrecordings are very short; as a result, extracted i-vectors cannot reliably\nrepresent the attributes of the speaker. Here, we investigate the effect of\nspeech duration on the performance of three state-of-the-art speaker\nrecognition systems. In addition, using a variety of available score fusion\nmethods, we investigate the effect of score fusion for those speaker\nverification techniques to benefit from the performance difference of different\nmethods under different enrollment and test speech duration conditions. This\ntechnique performed significantly better than the baseline score fusion\nmethods.", "published": "2016-08-07 21:43:08", "link": "http://arxiv.org/abs/1608.02272v1", "categories": ["cs.SD", "cs.CL"], "primary_category": "cs.SD"}
