{"title": "PAMPO: using pattern matching and pos-tagging for effective Named\n  Entities recognition in Portuguese", "abstract": "This paper deals with the entity extraction task (named entity recognition)\nof a text mining process that aims at unveiling non-trivial semantic\nstructures, such as relationships and interaction between entities or\ncommunities. In this paper we present a simple and efficient named entity\nextraction algorithm. The method, named PAMPO (PAttern Matching and POs tagging\nbased algorithm for NER), relies on flexible pattern matching, part-of-speech\ntagging and lexical-based rules. It was developed to process texts written in\nPortuguese, however it is potentially applicable to other languages as well.\n  We compare our approach with current alternatives that support Named Entity\nRecognition (NER) for content written in Portuguese. These are Alchemy, Zemanta\nand Rembrandt. Evaluation of the efficacy of the entity extraction method on\nseveral texts written in Portuguese indicates a considerable improvement on\n$recall$ and $F_1$ measures.", "published": "2016-12-30 17:10:29", "link": "http://arxiv.org/abs/1612.09535v1", "categories": ["cs.IR", "cs.CL"], "primary_category": "cs.IR"}
{"title": "A Joint Speaker-Listener-Reinforcer Model for Referring Expressions", "abstract": "Referring expressions are natural language constructions used to identify\nparticular objects within a scene. In this paper, we propose a unified\nframework for the tasks of referring expression comprehension and generation.\nOur model is composed of three modules: speaker, listener, and reinforcer. The\nspeaker generates referring expressions, the listener comprehends referring\nexpressions, and the reinforcer introduces a reward function to guide sampling\nof more discriminative expressions. The listener-speaker modules are trained\njointly in an end-to-end learning framework, allowing the modules to be aware\nof one another during learning while also benefiting from the discriminative\nreinforcer's feedback. We demonstrate that this unified framework and training\nachieves state-of-the-art results for both comprehension and generation on\nthree referring expression datasets. Project and demo page:\nhttps://vision.cs.unc.edu/refer", "published": "2016-12-30 17:39:19", "link": "http://arxiv.org/abs/1612.09542v2", "categories": ["cs.CV", "cs.AI", "cs.CL"], "primary_category": "cs.CV"}
{"title": "Automatic Data Deformation Analysis on Evolving Folksonomy Driven\n  Environment", "abstract": "The Folksodriven framework makes it possible for data scientists to define an\nontology environment where searching for buried patterns that have some kind of\npredictive power to build predictive models more effectively. It accomplishes\nthis through an abstractions that isolate parameters of the predictive modeling\nprocess searching for patterns and designing the feature set, too. To reflect\nthe evolving knowledge, this paper considers ontologies based on folksonomies\naccording to a new concept structure called \"Folksodriven\" to represent\nfolksonomies. So, the studies on the transformational regulation of the\nFolksodriven tags are regarded to be important for adaptive folksonomies\nclassifications in an evolving environment used by Intelligent Systems to\nrepresent the knowledge sharing. Folksodriven tags are used to categorize\nsalient data points so they can be fed to a machine-learning system and\n\"featurizing\" the data.", "published": "2016-12-30 19:52:09", "link": "http://arxiv.org/abs/1612.09574v1", "categories": ["cs.IR", "cs.CL", "cs.CY", "cs.SI", "03B65, 03G10, 68M11, 68P05, 68Q55, 68T30, 68U35", "D.2.2; G.1.10; G.2.2; H.1.1; H.1.2; H.3.1; H.3.3; H.3.5; H.5.2;\n  H.5.3; H.5.4; I.2.1; I.2.4; I.2.7; I.3.6; K.4"], "primary_category": "cs.IR"}
