{"title": "Learning for Biomedical Information Extraction: Methodological Review of\n  Recent Advances", "abstract": "Biomedical information extraction (BioIE) is important to many applications,\nincluding clinical decision support, integrative biology, and\npharmacovigilance, and therefore it has been an active research. Unlike\nexisting reviews covering a holistic view on BioIE, this review focuses on\nmainly recent advances in learning based approaches, by systematically\nsummarizing them into different aspects of methodological development. In\naddition, we dive into open information extraction and deep learning, two\nemerging and influential techniques and envision next generation of BioIE.", "published": "2016-06-26 04:39:39", "link": "http://arxiv.org/abs/1606.07993v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Functional Distributional Semantics", "abstract": "Vector space models have become popular in distributional semantics, despite\nthe challenges they face in capturing various semantic phenomena. We propose a\nnovel probabilistic framework which draws on both formal semantics and recent\nadvances in machine learning. In particular, we separate predicates from the\nentities they refer to, allowing us to perform Bayesian inference based on\nlogical forms. We describe an implementation of this framework using a\ncombination of Restricted Boltzmann Machines and feedforward neural networks.\nFinally, we demonstrate the feasibility of this approach by training it on a\nparsed corpus and evaluating it on established similarity datasets.", "published": "2016-06-26 07:44:08", "link": "http://arxiv.org/abs/1606.08003v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "This before That: Causal Precedence in the Biomedical Domain", "abstract": "Causal precedence between biochemical interactions is crucial in the\nbiomedical domain, because it transforms collections of individual\ninteractions, e.g., bindings and phosphorylations, into the causal mechanisms\nneeded to inform meaningful search and inference. Here, we analyze causal\nprecedence in the biomedical domain as distinct from open-domain, temporal\nprecedence. First, we describe a novel, hand-annotated text corpus of causal\nprecedence in the biomedical domain. Second, we use this corpus to investigate\na battery of models of precedence, covering rule-based, feature-based, and\nlatent representation models. The highest-performing individual model achieved\na micro F1 of 43 points, approaching the best performers on the simpler\ntemporal-only precedence tasks. Feature-based and latent representation models\neach outperform the rule-based models, but their performance is complementary\nto one another. We apply a sieve-based architecture to capitalize on this lack\nof overlap, achieving a micro F1 score of 46 points.", "published": "2016-06-26 21:55:40", "link": "http://arxiv.org/abs/1606.08089v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
