{"title": "When is multitask learning effective? Semantic sequence prediction under\n  varying data conditions", "abstract": "Multitask learning has been applied successfully to a range of tasks, mostly\nmorphosyntactic. However, little is known on when MTL works and whether there\nare data characteristics that help to determine its success. In this paper we\nevaluate a range of semantic sequence labeling tasks in a MTL setup. We examine\ndifferent auxiliary tasks, amongst which a novel setup, and correlate their\nimpact to data-dependent conditions. Our results show that MTL is not always\neffective, significant improvements are obtained only for 1 out of 5 tasks.\nWhen successful, auxiliary tasks with compact and more uniform label\ndistributions are preferable.", "published": "2016-12-07 14:03:15", "link": "http://arxiv.org/abs/1612.02251v2", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Improving the Performance of Neural Machine Translation Involving\n  Morphologically Rich Languages", "abstract": "The advent of the attention mechanism in neural machine translation models\nhas improved the performance of machine translation systems by enabling\nselective lookup into the source sentence. In this paper, the efficiencies of\ntranslation using bidirectional encoder attention decoder models were studied\nwith respect to translation involving morphologically rich languages. The\nEnglish - Tamil language pair was selected for this analysis. First, the use of\nWord2Vec embedding for both the English and Tamil words improved the\ntranslation results by 0.73 BLEU points over the baseline RNNSearch model with\n4.84 BLEU score. The use of morphological segmentation before word\nvectorization to split the morphologically rich Tamil words into their\nrespective morphemes before the translation, caused a reduction in the target\nvocabulary size by a factor of 8. Also, this model (RNNMorph) improved the\nperformance of neural machine translation by 7.05 BLEU points over the\nRNNSearch model used over the same corpus. Since the BLEU evaluation of the\nRNNMorph model might be unreliable due to an increase in the number of matching\ntokens per sentence, the performances of the translations were also compared by\nmeans of human evaluation metrics of adequacy, fluency and relative ranking.\nFurther, the use of morphological segmentation also improved the efficacy of\nthe attention mechanism.", "published": "2016-12-07 23:20:53", "link": "http://arxiv.org/abs/1612.02482v2", "categories": ["cs.CL", "cs.LG", "cs.NE"], "primary_category": "cs.CL"}
