{"title": "Variations of the Similarity Function of TextRank for Automated\n  Summarization", "abstract": "This article presents new alternatives to the similarity function for the\nTextRank algorithm for automatic summarization of texts. We describe the\ngeneralities of the algorithm and the different functions we propose. Some of\nthese variants achieve a significative improvement using the same metrics and\ndataset as the original publication.", "published": "2016-02-11 02:39:21", "link": "http://arxiv.org/abs/1602.03606v1", "categories": ["cs.CL", "cs.IR", "I.2.7"], "primary_category": "cs.CL"}
{"title": "Attentive Pooling Networks", "abstract": "In this work, we propose Attentive Pooling (AP), a two-way attention\nmechanism for discriminative model training. In the context of pair-wise\nranking or classification with neural networks, AP enables the pooling layer to\nbe aware of the current input pair, in a way that information from the two\ninput items can directly influence the computation of each other's\nrepresentations. Along with such representations of the paired inputs, AP\njointly learns a similarity measure over projected segments (e.g. trigrams) of\nthe pair, and subsequently, derives the corresponding attention vector for each\ninput to guide the pooling. Our two-way attention mechanism is a general\nframework independent of the underlying representation learning, and it has\nbeen applied to both convolutional neural networks (CNNs) and recurrent neural\nnetworks (RNNs) in our studies. The empirical results, from three very\ndifferent benchmark tasks of question answering/answer selection, demonstrate\nthat our proposed models outperform a variety of strong baselines and achieve\nstate-of-the-art performance in all the benchmarks.", "published": "2016-02-11 03:06:33", "link": "http://arxiv.org/abs/1602.03609v1", "categories": ["cs.CL", "cs.LG"], "primary_category": "cs.CL"}
{"title": "On the emergence of syntactic structures: quantifying and modelling\n  duality of patterning", "abstract": "The complex organization of syntax in hierarchical structures is one of the\ncore design features of human language. Duality of patterning refers for\ninstance to the organization of the meaningful elements in a language at two\ndistinct levels: a combinatorial level where meaningless forms are combined\ninto meaningful forms and a compositional level where meaningful forms are\ncomposed into larger lexical units. The question remains wide open regarding\nhow such a structure could have emerged. Furthermore a clear mathematical\nframework to quantify this phenomenon is still lacking. The aim of this paper\nis that of addressing these two aspects in a self-consistent way. First, we\nintroduce suitable measures to quantify the level of combinatoriality and\ncompositionality in a language, and present a framework to estimate these\nobservables in human natural languages. Second, we show that the theoretical\npredictions of a multi-agents modeling scheme, namely the Blending Game, are in\nsurprisingly good agreement with empirical data. In the Blending Game a\npopulation of individuals plays language games aiming at success in\ncommunication. It is remarkable that the two sides of duality of patterning\nemerge simultaneously as a consequence of a pure cultural dynamics in a\nsimulated environment that contains meaningful relations, provided a simple\nconstraint on message transmission fidelity is also considered.", "published": "2016-02-11 10:15:03", "link": "http://arxiv.org/abs/1602.03661v1", "categories": ["physics.soc-ph", "cs.CL"], "primary_category": "physics.soc-ph"}
