{"title": "IISCNLP at SemEval-2016 Task 2: Interpretable STS with ILP based\n  Multiple Chunk Aligner", "abstract": "Interpretable semantic textual similarity (iSTS) task adds a crucial\nexplanatory layer to pairwise sentence similarity. We address various\ncomponents of this task: chunk level semantic alignment along with assignment\nof similarity type and score for aligned chunks with a novel system presented\nin this paper. We propose an algorithm, iMATCH, for the alignment of multiple\nnon-contiguous chunks based on Integer Linear Programming (ILP). Similarity\ntype and score assignment for pairs of chunks is done using a supervised\nmulticlass classification technique based on Random Forrest Classifier. Results\nshow that our algorithm iMATCH has low execution time and outperforms most\nother participating systems in terms of alignment score. Of the three datasets,\nwe are top ranked for answer- students dataset in terms of overall score and\nhave top alignment score for headlines dataset in the gold chunks track.", "published": "2016-05-04 09:36:49", "link": "http://arxiv.org/abs/1605.01194v1", "categories": ["cs.CL", "stat.ML"], "primary_category": "cs.CL"}
{"title": "Compression and the origins of Zipf's law for word frequencies", "abstract": "Here we sketch a new derivation of Zipf's law for word frequencies based on\noptimal coding. The structure of the derivation is reminiscent of Mandelbrot's\nrandom typing model but it has multiple advantages over random typing: (1) it\nstarts from realistic cognitive pressures (2) it does not require fine tuning\nof parameters and (3) it sheds light on the origins of other statistical laws\nof language and thus can lead to a compact theory of linguistic laws. Our\nfindings suggest that the recurrence of Zipf's law in human languages could\noriginate from pressure for easy and fast communication.", "published": "2016-05-04 16:00:59", "link": "http://arxiv.org/abs/1605.01326v2", "categories": ["cs.CL", "physics.data-an", "physics.soc-ph", "q-bio.NC"], "primary_category": "cs.CL"}
