{"title": "The Grail theorem prover: Type theory for syntax and semantics", "abstract": "As the name suggests, type-logical grammars are a grammar formalism based on\nlogic and type theory. From the prespective of grammar design, type-logical\ngrammars develop the syntactic and semantic aspects of linguistic phenomena\nhand-in-hand, letting the desired semantics of an expression inform the\nsyntactic type and vice versa. Prototypical examples of the successful\napplication of type-logical grammars to the syntax-semantics interface include\ncoordination, quantifier scope and extraction.This chapter describes the Grail\ntheorem prover, a series of tools for designing and testing grammars in various\nmodern type-logical grammars which functions as a tool . All tools described in\nthis chapter are freely available.", "published": "2016-02-02 07:35:02", "link": "http://arxiv.org/abs/1602.00812v2", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Winning Arguments: Interaction Dynamics and Persuasion Strategies in\n  Good-faith Online Discussions", "abstract": "Changing someone's opinion is arguably one of the most important challenges\nof social interaction. The underlying process proves difficult to study: it is\nhard to know how someone's opinions are formed and whether and how someone's\nviews shift. Fortunately, ChangeMyView, an active community on Reddit, provides\na platform where users present their own opinions and reasoning, invite others\nto contest them, and acknowledge when the ensuing discussions change their\noriginal views. In this work, we study these interactions to understand the\nmechanisms behind persuasion.\n  We find that persuasive arguments are characterized by interesting patterns\nof interaction dynamics, such as participant entry-order and degree of\nback-and-forth exchange. Furthermore, by comparing similar counterarguments to\nthe same opinion, we show that language factors play an essential role. In\nparticular, the interplay between the language of the opinion holder and that\nof the counterargument provides highly predictive cues of persuasiveness.\nFinally, since even in this favorable setting people may not be persuaded, we\ninvestigate the problem of determining whether someone's opinion is susceptible\nto being changed at all. For this more difficult task, we show that stylistic\nchoices in how the opinion is expressed carry predictive power.", "published": "2016-02-02 21:00:11", "link": "http://arxiv.org/abs/1602.01103v2", "categories": ["cs.SI", "cs.CL", "physics.soc-ph"], "primary_category": "cs.SI"}
