{"title": "Extracting Formal Models from Normative Texts", "abstract": "Normative texts are documents based on the deontic notions of obligation,\npermission, and prohibition. Our goal is to model such texts using the C-O\nDiagram formalism, making them amenable to formal analysis, in particular\nverifying that a text satisfies properties concerning causality of actions and\ntiming constraints. We present an experimental, semi-automatic aid to bridge\nthe gap between a normative text and its formal representation. Our approach\nuses dependency trees combined with our own rules and heuristics for extracting\nthe relevant components. The resulting tabular data can then be converted into\na C-O Diagram.", "published": "2016-07-06 06:25:07", "link": "http://arxiv.org/abs/1607.01485v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Bag of Tricks for Efficient Text Classification", "abstract": "This paper explores a simple and efficient baseline for text classification.\nOur experiments show that our fast text classifier fastText is often on par\nwith deep learning classifiers in terms of accuracy, and many orders of\nmagnitude faster for training and evaluation. We can train fastText on more\nthan one billion words in less than ten minutes using a standard multicore~CPU,\nand classify half a million sentences among~312K classes in less than a minute.", "published": "2016-07-06 19:40:15", "link": "http://arxiv.org/abs/1607.01759v3", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Towards Self-explanatory Ontology Visualization with Contextual\n  Verbalization", "abstract": "Ontologies are one of the core foundations of the Semantic Web. To\nparticipate in Semantic Web projects, domain experts need to be able to\nunderstand the ontologies involved. Visual notations can provide an overview of\nthe ontology and help users to understand the connections among entities.\nHowever, the users first need to learn the visual notation before they can\ninterpret it correctly. Controlled natural language representation would be\nreadable right away and might be preferred in case of complex axioms, however,\nthe structure of the ontology would remain less apparent. We propose to combine\nontology visualizations with contextual ontology verbalizations of selected\nontology (diagram) elements, displaying controlled natural language (CNL)\nexplanations of OWL axioms corresponding to the selected visual notation\nelements. Thus, the domain experts will benefit from both the high-level\noverview provided by the graphical notation and the detailed textual\nexplanations of particular elements in the diagram.", "published": "2016-07-06 06:58:31", "link": "http://arxiv.org/abs/1607.01490v1", "categories": ["cs.AI", "cs.CL"], "primary_category": "cs.AI"}
{"title": "Guided Alignment Training for Topic-Aware Neural Machine Translation", "abstract": "In this paper, we propose an effective way for biasing the attention\nmechanism of a sequence-to-sequence neural machine translation (NMT) model\ntowards the well-studied statistical word alignment models. We show that our\nnovel guided alignment training approach improves translation quality on\nreal-life e-commerce texts consisting of product titles and descriptions,\novercoming the problems posed by many unknown words and a large type/token\nratio. We also show that meta-data associated with input texts such as topic or\ncategory information can significantly improve translation quality when used as\nan additional signal to the decoder part of the network. With both novel\nfeatures, the BLEU score of the NMT system on a product title set improves from\n18.6 to 21.3%. Even larger MT quality gains are obtained through domain\nadaptation of a general domain NMT system to e-commerce data. The developed NMT\nsystem also performs well on the IWSLT speech translation task, where an\nensemble of four variant systems outperforms the phrase-based baseline by 2.1%\nBLEU absolute.", "published": "2016-07-06 14:13:12", "link": "http://arxiv.org/abs/1607.01628v1", "categories": ["cs.CL", "cs.NE"], "primary_category": "cs.CL"}
