{"title": "Towards End-to-End Reinforcement Learning of Dialogue Agents for\n  Information Access", "abstract": "This paper proposes KB-InfoBot -- a multi-turn dialogue agent which helps\nusers search Knowledge Bases (KBs) without composing complicated queries. Such\ngoal-oriented dialogue agents typically need to interact with an external\ndatabase to access real-world knowledge. Previous systems achieved this by\nissuing a symbolic query to the KB to retrieve entries based on their\nattributes. However, such symbolic operations break the differentiability of\nthe system and prevent end-to-end training of neural dialogue agents. In this\npaper, we address this limitation by replacing symbolic queries with an induced\n\"soft\" posterior distribution over the KB that indicates which entities the\nuser is interested in. Integrating the soft retrieval process with a\nreinforcement learner leads to higher task success rate and reward in both\nsimulations and against real users. We also present a fully neural end-to-end\nagent, trained entirely from user feedback, and discuss its application towards\npersonalized dialogue agents. The source code is available at\nhttps://github.com/MiuLab/KB-InfoBot.", "published": "2016-09-03 01:02:51", "link": "http://arxiv.org/abs/1609.00777v3", "categories": ["cs.CL", "cs.LG"], "primary_category": "cs.CL"}
{"title": "Lexical-Morphological Modeling for Legal Text Analysis", "abstract": "In the context of the Competition on Legal Information Extraction/Entailment\n(COLIEE), we propose a method comprising the necessary steps for finding\nrelevant documents to a legal question and deciding on textual entailment\nevidence to provide a correct answer. The proposed method is based on the\ncombination of several lexical and morphological characteristics, to build a\nlanguage model and a set of features for Machine Learning algorithms. We\nprovide a detailed study on the proposed method performance and failure cases,\nindicating that it is competitive with state-of-the-art approaches on Legal\nInformation Retrieval and Question Answering, while not needing extensive\ntraining data nor depending on expert produced knowledge. The proposed method\nachieved significant results in the competition, indicating a substantial level\nof adequacy for the tasks addressed.", "published": "2016-09-03 07:24:08", "link": "http://arxiv.org/abs/1609.00799v1", "categories": ["cs.IR", "cs.CL", "14J30 (Primary)", "H.3, H.3.3, I.2.7"], "primary_category": "cs.IR"}
