{"title": "Representation Learning Models for Entity Search", "abstract": "We focus on the problem of learning distributed representations for entity\nsearch queries, named entities, and their short descriptions. With our\nrepresentation learning models, the entity search query, named entity and\ndescription can be represented as low-dimensional vectors. Our goal is to\ndevelop a simple but effective model that can make the distributed\nrepresentations of query related entities similar to the query in the vector\nspace. Hence, we propose three kinds of learning strategies, and the difference\nbetween them mainly lies in how to deal with the relationship between an entity\nand its description. We analyze the strengths and weaknesses of each learning\nstrategy and validate our methods on public datasets which contain four kinds\nof named entities, i.e., movies, TV shows, restaurants and celebrities. The\nexperimental results indicate that our proposed methods can adapt to different\ntypes of entity search queries, and outperform the current state-of-the-art\nmethods based on keyword matching and vanilla word2vec models. Besides, the\nproposed methods can be trained fast and be easily extended to other similar\ntasks.", "published": "2016-10-28 06:33:33", "link": "http://arxiv.org/abs/1610.09091v3", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Word Embeddings for the Construction Domain", "abstract": "We introduce word vectors for the construction domain. Our vectors were\nobtained by running word2vec on an 11M-word corpus that we created from scratch\nby leveraging freely-accessible online sources of construction-related text. We\nfirst explore the embedding space and show that our vectors capture meaningful\nconstruction-specific concepts. We then evaluate the performance of our vectors\nagainst that of ones trained on a 100B-word corpus (Google News) within the\nframework of an injury report classification task. Without any parameter\ntuning, our embeddings give competitive results, and outperform the Google News\nvectors in many cases. Using a keyword-based compression of the reports also\nleads to a significant speed-up with only a limited loss in performance. We\nrelease our corpus and the data set we created for the classification task as\npublicly available, in the hope that they will be used by future studies for\nbenchmarking and building on our work.", "published": "2016-10-28 18:15:08", "link": "http://arxiv.org/abs/1610.09333v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Towards a continuous modeling of natural language domains", "abstract": "Humans continuously adapt their style and language to a variety of domains.\nHowever, a reliable definition of `domain' has eluded researchers thus far.\nAdditionally, the notion of discrete domains stands in contrast to the\nmultiplicity of heterogeneous domains that humans navigate, many of which\noverlap. In order to better understand the change and variation of human\nlanguage, we draw on research in domain adaptation and extend the notion of\ndiscrete domains to the continuous spectrum. We propose representation\nlearning-based models that can adapt to continuous domains and detail how these\ncan be used to investigate variation in language. To this end, we propose to\nuse dialogue modeling as a test bed due to its proximity to language modeling\nand its social component.", "published": "2016-10-28 10:26:40", "link": "http://arxiv.org/abs/1610.09158v1", "categories": ["cs.CL", "cs.LG"], "primary_category": "cs.CL"}
{"title": "Text Segmentation using Named Entity Recognition and Co-reference\n  Resolution in English and Greek Texts", "abstract": "In this paper we examine the benefit of performing named entity recognition\n(NER) and co-reference resolution to an English and a Greek corpus used for\ntext segmentation. The aim here is to examine whether the combination of text\nsegmentation and information extraction can be beneficial for the\nidentification of the various topics that appear in a document. NER was\nperformed manually in the English corpus and was compared with the output\nproduced by publicly available annotation tools while, an already existing tool\nwas used for the Greek corpus. Produced annotations from both corpora were\nmanually corrected and enriched to cover four types of named entities.\nCo-reference resolution i.e., substitution of every reference of the same\ninstance with the same named entity identifier was subsequently performed. The\nevaluation, using five text segmentation algorithms for the English corpus and\nfour for the Greek corpus leads to the conclusion that, the benefit highly\ndepends on the segment's topic, the number of named entity instances appearing\nin it, as well as the segment's length.", "published": "2016-10-28 14:09:33", "link": "http://arxiv.org/abs/1610.09226v1", "categories": ["cs.CL", "cs.IR"], "primary_category": "cs.CL"}
{"title": "Sentiment Analysis of Twitter Data for Predicting Stock Market Movements", "abstract": "Predicting stock market movements is a well-known problem of interest.\nNow-a-days social media is perfectly representing the public sentiment and\nopinion about current events. Especially, twitter has attracted a lot of\nattention from researchers for studying the public sentiments. Stock market\nprediction on the basis of public sentiments expressed on twitter has been an\nintriguing field of research. Previous studies have concluded that the\naggregate public mood collected from twitter may well be correlated with Dow\nJones Industrial Average Index (DJIA). The thesis of this work is to observe\nhow well the changes in stock prices of a company, the rises and falls, are\ncorrelated with the public opinions being expressed in tweets about that\ncompany. Understanding author's opinion from a piece of text is the objective\nof sentiment analysis. The present paper have employed two different textual\nrepresentations, Word2vec and N-gram, for analyzing the public sentiments in\ntweets. In this paper, we have applied sentiment analysis and supervised\nmachine learning principles to the tweets extracted from twitter and analyze\nthe correlation between stock market movements of a company and sentiments in\ntweets. In an elaborate way, positive news and tweets in social media about a\ncompany would definitely encourage people to invest in the stocks of that\ncompany and as a result the stock price of that company would increase. At the\nend of the paper, it is shown that a strong correlation exists between the rise\nand falls in stock prices with the public sentiments in tweets.", "published": "2016-10-28 14:07:43", "link": "http://arxiv.org/abs/1610.09225v1", "categories": ["cs.IR", "cs.CL", "cs.SI"], "primary_category": "cs.IR"}
