{"title": "Neural Sentence Ordering", "abstract": "Sentence ordering is a general and critical task for natural language\ngeneration applications. Previous works have focused on improving its\nperformance in an external, downstream task, such as multi-document\nsummarization. Given its importance, we propose to study it as an isolated\ntask. We collect a large corpus of academic texts, and derive a data driven\napproach to learn pairwise ordering of sentences, and validate the efficacy\nwith extensive experiments. Source codes and dataset of this paper will be made\npublicly available.", "published": "2016-07-23 16:22:23", "link": "http://arxiv.org/abs/1607.06952v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Authorship attribution via network motifs identification", "abstract": "Concepts and methods of complex networks can be used to analyse texts at\ntheir different complexity levels. Examples of natural language processing\n(NLP) tasks studied via topological analysis of networks are keyword\nidentification, automatic extractive summarization and authorship attribution.\nEven though a myriad of network measurements have been applied to study the\nauthorship attribution problem, the use of motifs for text analysis has been\nrestricted to a few works. The goal of this paper is to apply the concept of\nmotifs, recurrent interconnection patterns, in the authorship attribution task.\nThe absolute frequencies of all thirteen directed motifs with three nodes were\nextracted from the co-occurrence networks and used as classification features.\nThe effectiveness of these features was verified with four machine learning\nmethods. The results show that motifs are able to distinguish the writing style\nof different authors. In our best scenario, 57.5% of the books were correctly\nclassified. The chance baseline for this problem is 12.5%. In addition, we have\nfound that function words play an important role in these recurrent patterns.\nTaken together, our findings suggest that motifs should be further explored in\nother related linguistic tasks.", "published": "2016-07-23 19:07:53", "link": "http://arxiv.org/abs/1607.06961v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Processing Natural Language About Ongoing Actions", "abstract": "Actions may not proceed as planned; they may be interrupted, resumed or\noverridden. This is a challenge to handle in a natural language understanding\nsystem. We describe extensions to an existing implementation for the control of\nautonomous systems by natural language, to enable such systems to handle\nincoming language requests regarding actions. Language Communication with\nAutonomous Systems (LCAS) has been extended with support for X-nets,\nparameterized executable schemas representing actions. X-nets enable the system\nto control actions at a desired level of granularity, while providing a\nmechanism for language requests to be processed asynchronously. Standard\nsemantics supported include requests to stop, continue, or override the\nexisting action. The specific domain demonstrated is the control of motion of a\nsimulated robot, but the approach is general, and could be applied to other\ndomains.", "published": "2016-07-23 01:46:09", "link": "http://arxiv.org/abs/1607.06875v2", "categories": ["cs.AI", "cs.CL", "cs.HC", "cs.RO"], "primary_category": "cs.AI"}
