{"title": "Sequential Matching Network: A New Architecture for Multi-turn Response\n  Selection in Retrieval-based Chatbots", "abstract": "We study response selection for multi-turn conversation in retrieval-based\nchatbots. Existing work either concatenates utterances in context or matches a\nresponse with a highly abstract context vector finally, which may lose\nrelationships among utterances or important contextual information. We propose\na sequential matching network (SMN) to address both problems. SMN first matches\na response with each utterance in the context on multiple levels of\ngranularity, and distills important matching information from each pair as a\nvector with convolution and pooling operations. The vectors are then\naccumulated in a chronological order through a recurrent neural network (RNN)\nwhich models relationships among utterances. The final matching score is\ncalculated with the hidden states of the RNN. An empirical study on two public\ndata sets shows that SMN can significantly outperform state-of-the-art methods\nfor response selection in multi-turn conversation.", "published": "2016-12-06 01:57:39", "link": "http://arxiv.org/abs/1612.01627v2", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Listen and Translate: A Proof of Concept for End-to-End Speech-to-Text\n  Translation", "abstract": "This paper proposes a first attempt to build an end-to-end speech-to-text\ntranslation system, which does not use source language transcription during\nlearning or decoding. We propose a model for direct speech-to-text translation,\nwhich gives promising results on a small French-English synthetic corpus.\nRelaxing the need for source language transcription would drastically change\nthe data collection methodology in speech translation, especially in\nunder-resourced scenarios. For instance, in the former project DARPA TRANSTAC\n(speech translation from spoken Arabic dialects), a large effort was devoted to\nthe collection of speech transcripts (and a prerequisite to obtain transcripts\nwas often a detailed transcription guide for languages with little standardized\nspelling). Now, if end-to-end approaches for speech-to-text translation are\nsuccessful, one might consider collecting data by asking bilingual speakers to\ndirectly utter speech in the source language from target language text\nutterances. Such an approach has the advantage to be applicable to any\nunwritten (source) language.", "published": "2016-12-06 10:48:56", "link": "http://arxiv.org/abs/1612.01744v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Condensed Memory Networks for Clinical Diagnostic Inferencing", "abstract": "Diagnosis of a clinical condition is a challenging task, which often requires\nsignificant medical investigation. Previous work related to diagnostic\ninferencing problems mostly consider multivariate observational data (e.g.\nphysiological signals, lab tests etc.). In contrast, we explore the problem\nusing free-text medical notes recorded in an electronic health record (EHR).\nComplex tasks like these can benefit from structured knowledge bases, but those\nare not scalable. We instead exploit raw text from Wikipedia as a knowledge\nsource. Memory networks have been demonstrated to be effective in tasks which\nrequire comprehension of free-form text. They use the final iteration of the\nlearned representation to predict probable classes. We introduce condensed\nmemory neural networks (C-MemNNs), a novel model with iterative condensation of\nmemory representations that preserves the hierarchy of features in the memory.\nExperiments on the MIMIC-III dataset show that the proposed model outperforms\nother variants of memory networks to predict the most probable diagnoses given\na complex clinical scenario.", "published": "2016-12-06 15:15:27", "link": "http://arxiv.org/abs/1612.01848v2", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Cross-Lingual Predicate Mapping Between Linked Data Ontologies", "abstract": "Ontologies in different natural languages often differ in quality in terms of\nrichness of schema or richness of internal links. This difference is markedly\nvisible when comparing a rich English language ontology with a non-English\nlanguage counterpart. Discovering alignment between them is a useful endeavor\nas it serves as a starting point in bridging the disparity. In particular, our\nwork is motivated by the absence of inter-language links for predicates in the\nlocalised versions of DBpedia. In this paper, we propose and demonstrate an\nad-hoc system to find possible owl:equivalentProperty links between predicates\nin ontologies of different natural languages. We seek to achieve this mapping\nby using pre-existing inter-language links of the resources connected by the\ngiven predicate. Thus, our methodology stresses on semantic similarity rather\nthan lexical. Moreover, through an evaluation, we show that our system is\ncapable of outperforming a baseline system that is similar to the one used in\nrecent OAEI campaigns.", "published": "2016-12-06 16:26:33", "link": "http://arxiv.org/abs/1612.01892v1", "categories": ["cs.AI", "cs.CL"], "primary_category": "cs.AI"}
