{"title": "Synthetic Language Generation and Model Validation in BEAST2", "abstract": "Generating synthetic languages aids in the testing and validation of future\ncomputational linguistic models and methods. This thesis extends the BEAST2\nphylogenetic framework to add linguistic sequence generation under multiple\nmodels. The new plugin is then used to test the effects of the phenomena of\nword borrowing on the inference process under two widely used phylolinguistic\nmodels.", "published": "2016-07-27 01:44:54", "link": "http://arxiv.org/abs/1607.07931v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Joint Embedding of Hierarchical Categories and Entities for Concept\n  Categorization and Dataless Classification", "abstract": "Due to the lack of structured knowledge applied in learning distributed\nrepresentation of cate- gories, existing work cannot incorporate category\nhierarchies into entity information. We propose a framework that embeds\nentities and categories into a semantic space by integrating structured\nknowledge and taxonomy hierarchy from large knowledge bases. The framework\nallows to com- pute meaningful semantic relatedness between entities and\ncategories. Our framework can han- dle both single-word concepts and\nmultiple-word concepts with superior performance on concept categorization and\nyield state of the art results on dataless hierarchical classification.", "published": "2016-07-27 04:51:17", "link": "http://arxiv.org/abs/1607.07956v1", "categories": ["cs.CL", "cs.AI"], "primary_category": "cs.CL"}
{"title": "Mining Arguments from Cancer Documents Using Natural Language Processing\n  and Ontologies", "abstract": "In the medical domain, the continuous stream of scientific research contains\ncontradictory results supported by arguments and counter-arguments. As medical\nexpertise occurs at different levels, part of the human agents have\ndifficulties to face the huge amount of studies, but also to understand the\nreasons and pieces of evidences claimed by the proponents and the opponents of\nthe debated topic. To better understand the supporting arguments for new\nfindings related to current state of the art in the medical domain we need\ntools able to identify arguments in scientific papers. Our work here aims to\nfill the above technological gap.\n  Quite aware of the difficulty of this task, we embark to this road by relying\non the well-known interleaving of domain knowledge with natural language\nprocessing. To formalise the existing medical knowledge, we rely on ontologies.\nTo structure the argumentation model we use also the expressivity and reasoning\ncapabilities of Description Logics. To perform argumentation mining we\nformalise various linguistic patterns in a rule-based language. We tested our\nsolution against a corpus of scientific papers related to breast cancer. The\nrun experiments show a F-measure between 0.71 and 0.86 for identifying\nconclusions of an argument and between 0.65 and 0.86 for identifying premises\nof an argument.", "published": "2016-07-27 13:08:41", "link": "http://arxiv.org/abs/1607.08074v1", "categories": ["cs.AI", "cs.CL"], "primary_category": "cs.AI"}
