{"title": "Bandit Structured Prediction for Learning from Partial Feedback in\n  Statistical Machine Translation", "abstract": "We present an approach to structured prediction from bandit feedback, called\nBandit Structured Prediction, where only the value of a task loss function at a\nsingle predicted point, instead of a correct structure, is observed in\nlearning. We present an application to discriminative reranking in Statistical\nMachine Translation (SMT) where the learning algorithm only has access to a\n1-BLEU loss evaluation of a predicted translation instead of obtaining a gold\nstandard reference translation. In our experiment bandit feedback is obtained\nby evaluating BLEU on reference translations without revealing them to the\nalgorithm. This can be thought of as a simulation of interactive machine\ntranslation where an SMT system is personalized by a user who provides single\npoint feedback to predicted translations. Our experiments show that our\napproach improves translation quality and is comparable to approaches that\nemploy more informative feedback in learning.", "published": "2016-01-18 11:09:02", "link": "http://arxiv.org/abs/1601.04468v1", "categories": ["cs.CL", "cs.LG"], "primary_category": "cs.CL"}
{"title": "Nonparametric Bayesian Storyline Detection from Microtexts", "abstract": "News events and social media are composed of evolving storylines, which\ncapture public attention for a limited period of time. Identifying storylines\nrequires integrating temporal and linguistic information, and prior work takes\na largely heuristic approach. We present a novel online non-parametric Bayesian\nframework for storyline detection, using the distance-dependent Chinese\nRestaurant Process (dd-CRP). To ensure efficient linear-time inference, we\nemploy a fixed-lag Gibbs sampling procedure, which is novel for the dd-CRP. We\nevaluate on the TREC Twitter Timeline Generation (TTG), obtaining encouraging\nresults: despite using a weak baseline retrieval model, the dd-CRP story\nclustering method is competitive with the best entries in the 2014 TTG task.", "published": "2016-01-18 15:46:00", "link": "http://arxiv.org/abs/1601.04580v2", "categories": ["cs.CL", "cs.LG"], "primary_category": "cs.CL"}
