{"title": "Shamela: A Large-Scale Historical Arabic Corpus", "abstract": "Arabic is a widely-spoken language with a rich and long history spanning more\nthan fourteen centuries. Yet existing Arabic corpora largely focus on the\nmodern period or lack sufficient diachronic information. We develop a\nlarge-scale, historical corpus of Arabic of about 1 billion words from diverse\nperiods of time. We clean this corpus, process it with a morphological\nanalyzer, and enhance it by detecting parallel passages and automatically\ndating undated texts. We demonstrate its utility with selected case-studies in\nwhich we show its application to the digital humanities.", "published": "2016-12-28 21:10:28", "link": "http://arxiv.org/abs/1612.08989v1", "categories": ["cs.CL", "I.2.7"], "primary_category": "cs.CL"}
{"title": "Here's My Point: Joint Pointer Architecture for Argument Mining", "abstract": "One of the major goals in automated argumentation mining is to uncover the\nargument structure present in argumentative text. In order to determine this\nstructure, one must understand how different individual components of the\noverall argument are linked. General consensus in this field dictates that the\nargument components form a hierarchy of persuasion, which manifests itself in a\ntree structure. This work provides the first neural network-based approach to\nargumentation mining, focusing on the two tasks of extracting links between\nargument components, and classifying types of argument components. In order to\nsolve this problem, we propose to use a joint model that is based on a Pointer\nNetwork architecture. A Pointer Network is appealing for this task for the\nfollowing reasons: 1) It takes into account the sequential nature of argument\ncomponents; 2) By construction, it enforces certain properties of the tree\nstructure present in argument relations; 3) The hidden representations can be\napplied to auxiliary tasks. In order to extend the contribution of the original\nPointer Network model, we construct a joint model that simultaneously attempts\nto learn the type of argument component, as well as continuing to predict links\nbetween argument components. The proposed joint model achieves state-of-the-art\nresults on two separate evaluation corpora, achieving far superior performance\nthan a regular Pointer Network model. Our results show that optimizing for both\ntasks, and adding a fully-connected layer prior to recurrent neural network\ninput, is crucial for high performance.", "published": "2016-12-28 21:36:19", "link": "http://arxiv.org/abs/1612.08994v2", "categories": ["cs.CL"], "primary_category": "cs.CL"}
