{"title": "Generating Simulations of Motion Events from Verbal Descriptions", "abstract": "In this paper, we describe a computational model for motion events in natural\nlanguage that maps from linguistic expressions, through a dynamic event\ninterpretation, into three-dimensional temporal simulations in a model.\nStarting with the model from (Pustejovsky and Moszkowicz, 2011), we analyze\nmotion events using temporally-traced Labelled Transition Systems. We model the\ndistinction between path- and manner-motion in an operational semantics, and\nfurther distinguish different types of manner-of-motion verbs in terms of the\nmereo-topological relations that hold throughout the process of movement. From\nthese representations, we generate minimal models, which are realized as\nthree-dimensional simulations in software developed with the game engine,\nUnity. The generated simulations act as a conceptual \"debugger\" for the\nsemantics of different motion verbs: that is, by testing for consistency and\ninformativeness in the model, simulations expose the presuppositions associated\nwith linguistic expressions and their compositions. Because the model\ngeneration component is still incomplete, this paper focuses on an\nimplementation which maps directly from linguistic interpretations into the\nUnity code snippets that create the simulations.", "published": "2016-10-06 01:56:23", "link": "http://arxiv.org/abs/1610.01713v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Neural-based Noise Filtering from Word Embeddings", "abstract": "Word embeddings have been demonstrated to benefit NLP tasks impressively.\nYet, there is room for improvement in the vector representations, because\ncurrent word embeddings typically contain unnecessary information, i.e., noise.\nWe propose two novel models to improve word embeddings by unsupervised\nlearning, in order to yield word denoising embeddings. The word denoising\nembeddings are obtained by strengthening salient information and weakening\nnoise in the original word embeddings, based on a deep feed-forward neural\nnetwork filter. Results from benchmark tasks show that the filtered word\ndenoising embeddings outperform the original word embeddings.", "published": "2016-10-06 13:52:52", "link": "http://arxiv.org/abs/1610.01874v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Toward Automatic Understanding of the Function of Affective Language in\n  Support Groups", "abstract": "Understanding expressions of emotions in support forums has considerable\nvalue and NLP methods are key to automating this. Many approaches\nunderstandably use subjective categories which are more fine-grained than a\nstraightforward polarity-based spectrum. However, the definition of such\ncategories is non-trivial and, in fact, we argue for a need to incorporate\ncommunicative elements even beyond subjectivity. To support our position, we\nreport experiments on a sentiment-labelled corpus of posts taken from a medical\nsupport forum. We argue that not only is a more fine-grained approach to text\nanalysis important, but simultaneously recognising the social function behind\naffective expressions enable a more accurate and valuable level of\nunderstanding.", "published": "2016-10-06 15:23:31", "link": "http://arxiv.org/abs/1610.01910v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Scalable Machine Translation in Memory Constrained Environments", "abstract": "Machine translation is the discipline concerned with developing automated\ntools for translating from one human language to another. Statistical machine\ntranslation (SMT) is the dominant paradigm in this field. In SMT, translations\nare generated by means of statistical models whose parameters are learned from\nbilingual data. Scalability is a key concern in SMT, as one would like to make\nuse of as much data as possible to train better translation systems.\n  In recent years, mobile devices with adequate computing power have become\nwidely available. Despite being very successful, mobile applications relying on\nNLP systems continue to follow a client-server architecture, which is of\nlimited use because access to internet is often limited and expensive. The goal\nof this dissertation is to show how to construct a scalable machine translation\nsystem that can operate with the limited resources available on a mobile\ndevice.\n  The main challenge for porting translation systems on mobile devices is\nmemory usage. The amount of memory available on a mobile device is far less\nthan what is typically available on the server side of a client-server\napplication. In this thesis, we investigate alternatives for the two components\nwhich prevent standard translation systems from working on mobile devices due\nto high memory usage. We show that once these standard components are replaced\nwith our proposed alternatives, we obtain a scalable translation system that\ncan work on a device with limited memory.", "published": "2016-10-06 19:22:49", "link": "http://arxiv.org/abs/1610.02003v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Automatic Detection of Small Groups of Persons, Influential Members,\n  Relations and Hierarchy in Written Conversations Using Fuzzy Logic", "abstract": "Nowadays a lot of data is collected in online forums. One of the key tasks is\nto determine the social structure of these online groups, for example the\nidentification of subgroups within a larger group. We will approach the\ngrouping of individual as a classification problem. The classifier will be\nbased on fuzzy logic. The input to the classifier will be linguistic features\nand degree of relationships (among individuals). The output of the classifiers\nare the groupings of individuals. We also incorporate a method that ranks the\nmembers of the detected subgroup to identify the hierarchies in each subgroup.\nData from the HBO television show The Wire is used to analyze the efficacy and\nusefulness of fuzzy logic based methods as alternative methods to classical\nstatistical methods usually used for these problems. The proposed methodology\ncould detect automatically the most influential members of each organization\nThe Wire with 90% accuracy.", "published": "2016-10-06 02:39:29", "link": "http://arxiv.org/abs/1610.01720v1", "categories": ["cs.CL", "cs.SI"], "primary_category": "cs.CL"}
{"title": "A Robust Framework for Classifying Evolving Document Streams in an\n  Expert-Machine-Crowd Setting", "abstract": "An emerging challenge in the online classification of social media data\nstreams is to keep the categories used for classification up-to-date. In this\npaper, we propose an innovative framework based on an Expert-Machine-Crowd\n(EMC) triad to help categorize items by continuously identifying novel concepts\nin heterogeneous data streams often riddled with outliers. We unify constrained\nclustering and outlier detection by formulating a novel optimization problem:\nCOD-Means. We design an algorithm to solve the COD-Means problem and show that\nCOD-Means will not only help detect novel categories but also seamlessly\ndiscover human annotation errors and improve the overall quality of the\ncategorization process. Experiments on diverse real data sets demonstrate that\nour approach is both effective and efficient.", "published": "2016-10-06 13:20:07", "link": "http://arxiv.org/abs/1610.01858v1", "categories": ["cs.CL", "cs.IR"], "primary_category": "cs.CL"}
{"title": "A New Data Representation Based on Training Data Characteristics to\n  Extract Drug Named-Entity in Medical Text", "abstract": "One essential task in information extraction from the medical corpus is drug\nname recognition. Compared with text sources come from other domains, the\nmedical text is special and has unique characteristics. In addition, the\nmedical text mining poses more challenges, e.g., more unstructured text, the\nfast growing of new terms addition, a wide range of name variation for the same\ndrug. The mining is even more challenging due to the lack of labeled dataset\nsources and external knowledge, as well as multiple token representations for a\nsingle drug name that is more common in the real application setting. Although\nmany approaches have been proposed to overwhelm the task, some problems\nremained with poor F-score performance (less than 0.75). This paper presents a\nnew treatment in data representation techniques to overcome some of those\nchallenges. We propose three data representation techniques based on the\ncharacteristics of word distribution and word similarities as a result of word\nembedding training. The first technique is evaluated with the standard NN\nmodel, i.e., MLP (Multi-Layer Perceptrons). The second technique involves two\ndeep network classifiers, i.e., DBN (Deep Belief Networks), and SAE (Stacked\nDenoising Encoders). The third technique represents the sentence as a sequence\nthat is evaluated with a recurrent NN model, i.e., LSTM (Long Short Term\nMemory). In extracting the drug name entities, the third technique gives the\nbest F-score performance compared to the state of the art, with its average\nF-score being 0.8645.", "published": "2016-10-06 14:38:09", "link": "http://arxiv.org/abs/1610.01891v1", "categories": ["cs.CL", "cs.AI", "cs.LG", "cs.NE", "68Txx", "I.2.4"], "primary_category": "cs.CL"}
