{"title": "Compositional Sentence Representation from Character within Large\n  Context Text", "abstract": "This paper describes a Hierarchical Composition Recurrent Network (HCRN)\nconsisting of a 3-level hierarchy of compositional models: character, word and\nsentence. This model is designed to overcome two problems of representing a\nsentence on the basis of a constituent word sequence. The first is a\ndata-sparsity problem in word embedding, and the other is a no usage of\ninter-sentence dependency. In the HCRN, word representations are built from\ncharacters, thus resolving the data-sparsity problem, and inter-sentence\ndependency is embedded into sentence representation at the level of sentence\ncomposition. We adopt a hierarchy-wise learning scheme in order to alleviate\nthe optimization difficulties of learning deep hierarchical recurrent network\nin end-to-end fashion. The HCRN was quantitatively and qualitatively evaluated\non a dialogue act classification task. Especially, sentence representations\nwith an inter-sentence dependency are able to capture both implicit and\nexplicit semantics of sentence, significantly improving performance. In the\nend, the HCRN achieved state-of-the-art performance with a test error rate of\n22.7% for dialogue act classification on the SWBD-DAMSL database.", "published": "2016-05-02 13:41:38", "link": "http://arxiv.org/abs/1605.00482v3", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Multi30K: Multilingual English-German Image Descriptions", "abstract": "We introduce the Multi30K dataset to stimulate multilingual multimodal\nresearch. Recent advances in image description have been demonstrated on\nEnglish-language datasets almost exclusively, but image description should not\nbe limited to English. This dataset extends the Flickr30K dataset with i)\nGerman translations created by professional translators over a subset of the\nEnglish descriptions, and ii) descriptions crowdsourced independently of the\noriginal English descriptions. We outline how the data can be used for\nmultilingual image description and multimodal machine translation, but we\nanticipate the data will be useful for a broader range of tasks.", "published": "2016-05-02 12:38:03", "link": "http://arxiv.org/abs/1605.00459v1", "categories": ["cs.CL", "cs.CV"], "primary_category": "cs.CL"}
