{"title": "Ensemble of Jointly Trained Deep Neural Network-Based Acoustic Models\n  for Reverberant Speech Recognition", "abstract": "Distant speech recognition is a challenge, particularly due to the corruption\nof speech signals by reverberation caused by large distances between the\nspeaker and microphone. In order to cope with a wide range of reverberations in\nreal-world situations, we present novel approaches for acoustic modeling\nincluding an ensemble of deep neural networks (DNNs) and an ensemble of jointly\ntrained DNNs. First, multiple DNNs are established, each of which corresponds\nto a different reverberation time 60 (RT60) in a setup step. Also, each model\nin the ensemble of DNN acoustic models is further jointly trained, including\nboth feature mapping and acoustic modeling, where the feature mapping is\ndesigned for the dereverberation as a front-end. In a testing phase, the two\nmost likely DNNs are chosen from the DNN ensemble using maximum a posteriori\n(MAP) probabilities, computed in an online fashion by using maximum likelihood\n(ML)-based blind RT60 estimation and then the posterior probability outputs\nfrom two DNNs are combined using the ML-based weights as a simple average.\nExtensive experiments demonstrate that the proposed approach leads to\nsubstantial improvements in speech recognition accuracy over the conventional\nDNN baseline systems under diverse reverberant conditions.", "published": "2016-08-17 14:43:17", "link": "http://arxiv.org/abs/1608.04983v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Path-based vs. Distributional Information in Recognizing Lexical\n  Semantic Relations", "abstract": "Recognizing various semantic relations between terms is beneficial for many\nNLP tasks. While path-based and distributional information sources are\nconsidered complementary for this task, the superior results the latter showed\nrecently suggested that the former's contribution might have become obsolete.\nWe follow the recent success of an integrated neural method for hypernymy\ndetection (Shwartz et al., 2016) and extend it to recognize multiple relations.\nThe empirical results show that this method is effective in the multiclass\nsetting as well. We further show that the path-based information source always\ncontributes to the classification, and analyze the cases in which it mostly\ncomplements the distributional information.", "published": "2016-08-17 16:27:49", "link": "http://arxiv.org/abs/1608.05014v4", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "SlangSD: Building and Using a Sentiment Dictionary of Slang Words for\n  Short-Text Sentiment Classification", "abstract": "Sentiment in social media is increasingly considered as an important resource\nfor customer segmentation, market understanding, and tackling other\nsocio-economic issues. However, sentiment in social media is difficult to\nmeasure since user-generated content is usually short and informal. Although\nmany traditional sentiment analysis methods have been proposed, identifying\nslang sentiment words remains untackled. One of the reasons is that slang\nsentiment words are not available in existing dictionaries or sentiment\nlexicons. To this end, we propose to build the first sentiment dictionary of\nslang words to aid sentiment analysis of social media content. It is laborious\nand time-consuming to collect and label the sentiment polarity of a\ncomprehensive list of slang words. We present an approach to leverage web\nresources to construct an extensive Slang Sentiment word Dictionary (SlangSD)\nthat is easy to maintain and extend. SlangSD is publicly available for research\npurposes. We empirically show the advantages of using SlangSD, the newly-built\nslang sentiment word dictionary for sentiment classification, and provide\nexamples demonstrating its ease of use with an existing sentiment system.", "published": "2016-08-17 23:32:57", "link": "http://arxiv.org/abs/1608.05129v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Towards Music Captioning: Generating Music Playlist Descriptions", "abstract": "Descriptions are often provided along with recommendations to help users'\ndiscovery. Recommending automatically generated music playlists (e.g.\npersonalised playlists) introduces the problem of generating descriptions. In\nthis paper, we propose a method for generating music playlist descriptions,\nwhich is called as music captioning. In the proposed method, audio content\nanalysis and natural language processing are adopted to utilise the information\nof each track.", "published": "2016-08-17 06:24:46", "link": "http://arxiv.org/abs/1608.04868v2", "categories": ["cs.MM", "cs.AI", "cs.CL"], "primary_category": "cs.MM"}
{"title": "Cohesion and Coalition Formation in the European Parliament: Roll-Call\n  Votes and Twitter Activities", "abstract": "We study the cohesion within and the coalitions between political groups in\nthe Eighth European Parliament (2014--2019) by analyzing two entirely different\naspects of the behavior of the Members of the European Parliament (MEPs) in the\npolicy-making processes. On one hand, we analyze their co-voting patterns and,\non the other, their retweeting behavior. We make use of two diverse datasets in\nthe analysis. The first one is the roll-call vote dataset, where cohesion is\nregarded as the tendency to co-vote within a group, and a coalition is formed\nwhen the members of several groups exhibit a high degree of co-voting agreement\non a subject. The second dataset comes from Twitter; it captures the retweeting\n(i.e., endorsing) behavior of the MEPs and implies cohesion (retweets within\nthe same group) and coalitions (retweets between groups) from a completely\ndifferent perspective.\n  We employ two different methodologies to analyze the cohesion and coalitions.\nThe first one is based on Krippendorff's Alpha reliability, used to measure the\nagreement between raters in data-analysis scenarios, and the second one is\nbased on Exponential Random Graph Models, often used in social-network\nanalysis. We give general insights into the cohesion of political groups in the\nEuropean Parliament, explore whether coalitions are formed in the same way for\ndifferent policy areas, and examine to what degree the retweeting behavior of\nMEPs corresponds to their co-voting patterns. A novel and interesting aspect of\nour work is the relationship between the co-voting and retweeting patterns.", "published": "2016-08-17 10:10:14", "link": "http://arxiv.org/abs/1608.04917v2", "categories": ["cs.CL", "cs.CY", "cs.SI"], "primary_category": "cs.CL"}
