{"title": "Response Selection with Topic Clues for Retrieval-based Chatbots", "abstract": "We consider incorporating topic information into message-response matching to\nboost responses with rich content in retrieval-based chatbots. To this end, we\npropose a topic-aware convolutional neural tensor network (TACNTN). In TACNTN,\nmatching between a message and a response is not only conducted between a\nmessage vector and a response vector generated by convolutional neural\nnetworks, but also leverages extra topic information encoded in two topic\nvectors. The two topic vectors are linear combinations of topic words of the\nmessage and the response respectively, where the topic words are obtained from\na pre-trained LDA model and their weights are determined by themselves as well\nas the message vector and the response vector. The message vector, the response\nvector, and the two topic vectors are fed to neural tensors to calculate a\nmatching score. Empirical study on a public data set and a human annotated data\nset shows that TACNTN can significantly outperform state-of-the-art methods for\nmessage-response matching.", "published": "2016-04-30 10:48:29", "link": "http://arxiv.org/abs/1605.00090v3", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "An Improved System for Sentence-level Novelty Detection in Textual\n  Streams", "abstract": "Novelty detection in news events has long been a difficult problem. A number\nof models performed well on specific data streams but certain issues are far\nfrom being solved, particularly in large data streams from the WWW where\nunpredictability of new terms requires adaptation in the vector space model. We\npresent a novel event detection system based on the Incremental Term\nFrequency-Inverse Document Frequency (TF-IDF) weighting incorporated with\nLocality Sensitive Hashing (LSH). Our system could efficiently and effectively\nadapt to the changes within the data streams of any new terms with continual\nupdates to the vector space model. Regarding miss probability, our proposed\nnovelty detection framework outperforms a recognised baseline system by\napproximately 16% when evaluating a benchmark dataset from Google News.", "published": "2016-04-30 15:04:19", "link": "http://arxiv.org/abs/1605.00122v1", "categories": ["cs.IR", "cs.AI", "cs.CL"], "primary_category": "cs.IR"}
