{"title": "Semantic Spaces", "abstract": "Any natural language can be considered as a tool for producing large\ndatabases (consisting of texts, written, or discursive). This tool for its\ndescription in turn requires other large databases (dictionaries, grammars\netc.). Nowadays, the notion of database is associated with computer processing\nand computer memory. However, a natural language resides also in human brains\nand functions in human communication, from interpersonal to intergenerational\none. We discuss in this survey/research paper mathematical, in particular\ngeometric, constructions, which help to bridge these two worlds. In particular,\nin this paper we consider the Vector Space Model of semantics based on\nfrequency matrices, as used in Natural Language Processing. We investigate\nunderlying geometries, formulated in terms of Grassmannians, projective spaces,\nand flag varieties. We formulate the relation between vector space models and\nsemantic spaces based on semic axes in terms of projectability of subvarieties\nin Grassmannians and projective spaces. We interpret Latent Semantics as a\ngeometric flow on Grassmannians. We also discuss how to formulate G\\\"ardenfors'\nnotion of \"meeting of minds\" in our geometric setting.", "published": "2016-05-13 16:25:38", "link": "http://arxiv.org/abs/1605.04238v1", "categories": ["cs.CL", "68Q55, 14M15"], "primary_category": "cs.CL"}
{"title": "Universal Dependencies for Learner English", "abstract": "We introduce the Treebank of Learner English (TLE), the first publicly\navailable syntactic treebank for English as a Second Language (ESL). The TLE\nprovides manually annotated POS tags and Universal Dependency (UD) trees for\n5,124 sentences from the Cambridge First Certificate in English (FCE) corpus.\nThe UD annotations are tied to a pre-existing error annotation of the FCE,\nwhereby full syntactic analyses are provided for both the original and error\ncorrected versions of each sentence. Further on, we delineate ESL annotation\nguidelines that allow for consistent syntactic treatment of ungrammatical\nEnglish. Finally, we benchmark POS tagging and dependency parsing performance\non the TLE dataset and measure the effect of grammatical errors on parsing\naccuracy. We envision the treebank to support a wide range of linguistic and\ncomputational research on second language acquisition as well as automatic\nprocessing of ungrammatical language. The treebank is available at\nuniversaldependencies.org. The annotation manual used in this project and a\ngraphical query engine are available at esltreebank.org.", "published": "2016-05-13 18:45:22", "link": "http://arxiv.org/abs/1605.04278v2", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "A Corpus-based Toy Model for DisCoCat", "abstract": "The categorical compositional distributional (DisCoCat) model of meaning\nrigorously connects distributional semantics and pregroup grammars, and has\nfound a variety of applications in computational linguistics. From a more\nabstract standpoint, the DisCoCat paradigm predicates the construction of a\nmapping from syntax to categorical semantics. In this work we present a\nconcrete construction of one such mapping, from a toy model of syntax for\ncorpora annotated with constituent structure trees, to categorical semantics\ntaking place in a category of free R-semimodules over an involutive commutative\nsemiring R.", "published": "2016-05-13 00:32:01", "link": "http://arxiv.org/abs/1605.04013v2", "categories": ["cs.CL", "cs.LO", "math.CT"], "primary_category": "cs.CL"}
{"title": "Towards Empathetic Human-Robot Interactions", "abstract": "Since the late 1990s when speech companies began providing their\ncustomer-service software in the market, people have gotten used to speaking to\nmachines. As people interact more often with voice and gesture controlled\nmachines, they expect the machines to recognize different emotions, and\nunderstand other high level communication features such as humor, sarcasm and\nintention. In order to make such communication possible, the machines need an\nempathy module in them which can extract emotions from human speech and\nbehavior and can decide the correct response of the robot. Although research on\nempathetic robots is still in the early stage, we described our approach using\nsignal processing techniques, sentiment analysis and machine learning\nalgorithms to make robots that can \"understand\" human emotion. We propose Zara\nthe Supergirl as a prototype system of empathetic robots. It is a software\nbased virtual android, with an animated cartoon character to present itself on\nthe screen. She will get \"smarter\" and more empathetic through its deep\nlearning algorithms, and by gathering more data and learning from it. In this\npaper, we present our work so far in the areas of deep learning of emotion and\nsentiment recognition, as well as humor recognition. We hope to explore the\nfuture direction of android development and how it can help improve people's\nlives.", "published": "2016-05-13 07:31:50", "link": "http://arxiv.org/abs/1605.04072v1", "categories": ["cs.CL", "cs.AI", "cs.HC", "cs.RO"], "primary_category": "cs.CL"}
{"title": "Natural Language Semantics and Computability", "abstract": "This paper is a reflexion on the computability of natural language semantics.\nIt does not contain a new model or new results in the formal semantics of\nnatural language: it is rather a computational analysis of the logical models\nand algorithms currently used in natural language semantics, defined as the\nmapping of a statement to logical formulas - formulas, because a statement can\nbe ambiguous. We argue that as long as possible world semantics is left out,\none can compute the semantic representation(s) of a given statement, including\naspects of lexical meaning. We also discuss the algorithmic complexity of this\nprocess.", "published": "2016-05-13 10:46:22", "link": "http://arxiv.org/abs/1605.04122v1", "categories": ["cs.CL", "cs.AI", "cs.CC"], "primary_category": "cs.CL"}
