{"title": "Extracting Temporal and Causal Relations between Events", "abstract": "Structured information resulting from temporal information processing is\ncrucial for a variety of natural language processing tasks, for instance to\ngenerate timeline summarization of events from news documents, or to answer\ntemporal/causal-related questions about some events. In this thesis we present\na framework for an integrated temporal and causal relation extraction system.\nWe first develop a robust extraction component for each type of relations, i.e.\ntemporal order and causality. We then combine the two extraction components\ninto an integrated relation extraction system, CATENA---CAusal and Temporal\nrelation Extraction from NAtural language texts---, by utilizing the\npresumption about event precedence in causality, that causing events must\nhappened BEFORE resulting events. Several resources and techniques to improve\nour relation extraction systems are also discussed, including word embeddings\nand training data expansion. Finally, we report our adaptation efforts of\ntemporal information processing for languages other than English, namely\nItalian and Indonesian.", "published": "2016-04-27 15:52:18", "link": "http://arxiv.org/abs/1604.08120v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "The IBM 2016 English Conversational Telephone Speech Recognition System", "abstract": "We describe a collection of acoustic and language modeling techniques that\nlowered the word error rate of our English conversational telephone LVCSR\nsystem to a record 6.6% on the Switchboard subset of the Hub5 2000 evaluation\ntestset. On the acoustic side, we use a score fusion of three strong models:\nrecurrent nets with maxout activations, very deep convolutional nets with 3x3\nkernels, and bidirectional long short-term memory nets which operate on FMLLR\nand i-vector features. On the language modeling side, we use an updated model\n\"M\" and hierarchical neural network LMs.", "published": "2016-04-27 21:00:03", "link": "http://arxiv.org/abs/1604.08242v2", "categories": ["cs.CL"], "primary_category": "cs.CL"}
