{"title": "Visualizing Linguistic Shift", "abstract": "Neural network based models are a very powerful tool for creating word\nembeddings, the objective of these models is to group similar words together.\nThese embeddings have been used as features to improve results in various\napplications such as document classification, named entity recognition, etc.\nNeural language models are able to learn word representations which have been\nused to capture semantic shifts across time and geography. The objective of\nthis paper is to first identify and then visualize how words change meaning in\ndifferent text corpus. We will train a neural language model on texts from a\ndiverse set of disciplines philosophy, religion, fiction etc. Each text will\nalter the embeddings of the words to represent the meaning of the word inside\nthat text. We will present a computational technique to detect words that\nexhibit significant linguistic shift in meaning and usage. We then use enhanced\nscatterplots and storyline visualization to visualize the linguistic shift.", "published": "2016-11-20 06:50:16", "link": "http://arxiv.org/abs/1611.06478v1", "categories": ["cs.CL", "cs.HC"], "primary_category": "cs.CL"}
{"title": "Recurrent Memory Addressing for describing videos", "abstract": "In this paper, we introduce Key-Value Memory Networks to a multimodal setting\nand a novel key-addressing mechanism to deal with sequence-to-sequence models.\nThe proposed model naturally decomposes the problem of video captioning into\nvision and language segments, dealing with them as key-value pairs. More\nspecifically, we learn a semantic embedding (v) corresponding to each frame (k)\nin the video, thereby creating (k, v) memory slots. We propose to find the next\nstep attention weights conditioned on the previous attention distributions for\nthe key-value memory slots in the memory addressing schema. Exploiting this\nflexibility of the framework, we additionally capture spatial dependencies\nwhile mapping from the visual to semantic embedding. Experiments done on the\nYoutube2Text dataset demonstrate usefulness of recurrent key-addressing, while\nachieving competitive scores on BLEU@4, METEOR metrics against state-of-the-art\nmodels.", "published": "2016-11-20 10:07:54", "link": "http://arxiv.org/abs/1611.06492v2", "categories": ["cs.CV", "cs.CL"], "primary_category": "cs.CV"}
{"title": "A Hierarchical Approach for Generating Descriptive Image Paragraphs", "abstract": "Recent progress on image captioning has made it possible to generate novel\nsentences describing images in natural language, but compressing an image into\na single sentence can describe visual content in only coarse detail. While one\nnew captioning approach, dense captioning, can potentially describe images in\nfiner levels of detail by captioning many regions within an image, it in turn\nis unable to produce a coherent story for an image. In this paper we overcome\nthese limitations by generating entire paragraphs for describing images, which\ncan tell detailed, unified stories. We develop a model that decomposes both\nimages and paragraphs into their constituent parts, detecting semantic regions\nin images and using a hierarchical recurrent neural network to reason about\nlanguage. Linguistic analysis confirms the complexity of the paragraph\ngeneration task, and thorough experiments on a new dataset of image and\nparagraph pairs demonstrate the effectiveness of our approach.", "published": "2016-11-20 23:10:51", "link": "http://arxiv.org/abs/1611.06607v2", "categories": ["cs.CV", "cs.CL"], "primary_category": "cs.CV"}
{"title": "Gendered Conversation in a Social Game-Streaming Platform", "abstract": "Online social media and games are increasingly replacing offline social\nactivities. Social media is now an indispensable mode of communication; online\ngaming is not only a genuine social activity but also a popular spectator\nsport. With support for anonymity and larger audiences, online interaction\nshrinks social and geographical barriers. Despite such benefits, social\ndisparities such as gender inequality persist in online social media. In\nparticular, online gaming communities have been criticized for persistent\ngender disparities and objectification. As gaming evolves into a social\nplatform, persistence of gender disparity is a pressing question. Yet, there\nare few large-scale, systematic studies of gender inequality and\nobjectification in social gaming platforms. Here we analyze more than one\nbillion chat messages from Twitch, a social game-streaming platform, to study\nhow the gender of streamers is associated with the nature of conversation.\nUsing a combination of computational text analysis methods, we show that\ngendered conversation and objectification is prevalent in chats. Female\nstreamers receive significantly more objectifying comments while male streamers\nreceive more game-related comments. This difference is more pronounced for\npopular streamers. There also exists a large number of users who post only on\nfemale or male streams. Employing a neural vector-space embedding (paragraph\nvector) method, we analyze gendered chat messages and create prediction models\nthat (i) identify the gender of streamers based on messages posted in the\nchannel and (ii) identify the gender a viewer prefers to watch based on their\nchat messages. Our findings suggest that disparities in social game-streaming\nplatforms is a nuanced phenomenon that involves the gender of streamers as well\nas those who produce gendered and game-related conversation.", "published": "2016-11-20 01:21:31", "link": "http://arxiv.org/abs/1611.06459v2", "categories": ["cs.SI", "cs.CL", "cs.CY"], "primary_category": "cs.SI"}
{"title": "Generating machine-executable plans from end-user's natural-language\n  instructions", "abstract": "It is critical for advanced manufacturing machines to autonomously execute a\ntask by following an end-user's natural language (NL) instructions. However, NL\ninstructions are usually ambiguous and abstract so that the machines may\nmisunderstand and incorrectly execute the task. To address this NL-based\nhuman-machine communication problem and enable the machines to appropriately\nexecute tasks by following the end-user's NL instructions, we developed a\nMachine-Executable-Plan-Generation (exePlan) method. The exePlan method\nconducts task-centered semantic analysis to extract task-related information\nfrom ambiguous NL instructions. In addition, the method specifies machine\nexecution parameters to generate a machine-executable plan by interpreting\nabstract NL instructions. To evaluate the exePlan method, an industrial robot\nBaxter was instructed by NL to perform three types of industrial tasks {'drill\na hole', 'clean a spot', 'install a screw'}. The experiment results proved that\nthe exePlan method was effective in generating machine-executable plans from\nthe end-user's NL instructions. Such a method has the promise to endow a\nmachine with the ability of NL-instructed task execution.", "published": "2016-11-20 04:06:47", "link": "http://arxiv.org/abs/1611.06468v1", "categories": ["cs.AI", "cs.CL", "cs.RO"], "primary_category": "cs.AI"}
