{"title": "A Semantic Analyzer for the Comprehension of the Spontaneous Arabic\n  Speech", "abstract": "This work is part of a large research project entitled \"Or\\'eodule\" aimed at\ndeveloping tools for automatic speech recognition, translation, and synthesis\nfor Arabic language. Our attention has mainly been focused on an attempt to\nimprove the probabilistic model on which our semantic decoder is based. To\nachieve this goal, we have decided to test the influence of the pertinent\ncontext use, and of the contextual data integration of different types, on the\neffectiveness of the semantic decoder. The findings are quite satisfactory.", "published": "2016-10-08 06:33:35", "link": "http://arxiv.org/abs/1610.02493v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Computational linking theory", "abstract": "A linking theory explains how verbs' semantic arguments are mapped to their\nsyntactic arguments---the inverse of the Semantic Role Labeling task from the\nshallow semantic parsing literature. In this paper, we develop the\nComputational Linking Theory framework as a method for implementing and testing\nlinking theories proposed in the theoretical literature. We deploy this\nframework to assess two cross-cutting types of linking theory: local v. global\nmodels and categorical v. featural models. To further investigate the behavior\nof these models, we develop a measurement model in the spirit of previous work\nin semantic role induction: the Semantic Proto-Role Linking Model. We use this\nmodel, which implements a generalization of Dowty's seminal Proto-Role Theory,\nto induce semantic proto-roles, which we compare to those Dowty proposes.", "published": "2016-10-08 15:24:50", "link": "http://arxiv.org/abs/1610.02544v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Mining the Web for Pharmacovigilance: the Case Study of Duloxetine and\n  Venlafaxine", "abstract": "Adverse reactions caused by drugs following their release into the market are\namong the leading causes of death in many countries. The rapid growth of\nelectronically available health related information, and the ability to process\nlarge volumes of them automatically, using natural language processing (NLP)\nand machine learning algorithms, have opened new opportunities for\npharmacovigilance. Survey found that more than 70% of US Internet users consult\nthe Internet when they require medical information. In recent years, research\nin this area has addressed for Adverse Drug Reaction (ADR) pharmacovigilance\nusing social media, mainly Twitter and medical forums and websites. This paper\nwill show the information which can be collected from a variety of Internet\ndata sources and search engines, mainly Google Trends and Google Correlate.\nWhile considering the case study of two popular Major depressive Disorder (MDD)\ndrugs, Duloxetine and Venlafaxine, we will provide a comparative analysis for\ntheir reactions using publicly-available alternative data sources.", "published": "2016-10-08 19:43:23", "link": "http://arxiv.org/abs/1610.02567v1", "categories": ["cs.CL", "cs.CY"], "primary_category": "cs.CL"}
