{"title": "Automatic Construction of Discourse Corpora for Dialogue Translation", "abstract": "In this paper, a novel approach is proposed to automatically construct\nparallel discourse corpus for dialogue machine translation. Firstly, the\nparallel subtitle data and its corresponding monolingual movie script data are\ncrawled and collected from Internet. Then tags such as speaker and discourse\nboundary from the script data are projected to its subtitle data via an\ninformation retrieval approach in order to map monolingual discourse to\nbilingual texts. We not only evaluate the mapping results, but also integrate\nspeaker information into the translation. Experiments show our proposed method\ncan achieve 81.79% and 98.64% accuracy on speaker and dialogue boundary\nannotation, and speaker-based language model adaptation can obtain around 0.5\nBLEU points improvement in translation qualities. Finally, we publicly release\naround 100K parallel discourse data with manual speaker and dialogue boundary\nannotation.", "published": "2016-05-22 10:50:07", "link": "http://arxiv.org/abs/1605.06770v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Textual Paralanguage and its Implications for Marketing Communications", "abstract": "Both face-to-face communication and communication in online environments\nconvey information beyond the actual verbal message. In a traditional\nface-to-face conversation, paralanguage, or the ancillary meaning- and\nemotion-laden aspects of speech that are not actual verbal prose, gives\ncontextual information that allows interactors to more appropriately understand\nthe message being conveyed. In this paper, we conceptualize textual\nparalanguage (TPL), which we define as written manifestations of nonverbal\naudible, tactile, and visual elements that supplement or replace written\nlanguage and that can be expressed through words, symbols, images, punctuation,\ndemarcations, or any combination of these elements. We develop a typology of\ntextual paralanguage using data from Twitter, Facebook, and Instagram. We\npresent a conceptual framework of antecedents and consequences of brands' use\nof textual paralanguage. Implications for theory and practice are discussed.", "published": "2016-05-22 14:22:03", "link": "http://arxiv.org/abs/1605.06799v1", "categories": ["cs.CL", "cs.SI"], "primary_category": "cs.CL"}
{"title": "openXBOW - Introducing the Passau Open-Source Crossmodal Bag-of-Words\n  Toolkit", "abstract": "We introduce openXBOW, an open-source toolkit for the generation of\nbag-of-words (BoW) representations from multimodal input. In the BoW principle,\nword histograms were first used as features in document classification, but the\nidea was and can easily be adapted to, e.g., acoustic or visual low-level\ndescriptors, introducing a prior step of vector quantisation. The openXBOW\ntoolkit supports arbitrary numeric input features and text input and\nconcatenates computed subbags to a final bag. It provides a variety of\nextensions and options. To our knowledge, openXBOW is the first publicly\navailable toolkit for the generation of crossmodal bags-of-words. The\ncapabilities of the tool are exemplified in two sample scenarios:\ntime-continuous speech-based emotion recognition and sentiment analysis in\ntweets where improved results over other feature representation forms were\nobserved.", "published": "2016-05-22 12:14:55", "link": "http://arxiv.org/abs/1605.06778v1", "categories": ["cs.CV", "cs.CL", "cs.IR"], "primary_category": "cs.CV"}
