{"title": "Speed-Constrained Tuning for Statistical Machine Translation Using\n  Bayesian Optimization", "abstract": "We address the problem of automatically finding the parameters of a\nstatistical machine translation system that maximize BLEU scores while ensuring\nthat decoding speed exceeds a minimum value. We propose the use of Bayesian\nOptimization to efficiently tune the speed-related decoding parameters by\neasily incorporating speed as a noisy constraint function. The obtained\nparameter values are guaranteed to satisfy the speed constraint with an\nassociated confidence margin. Across three language pairs and two speed\nconstraint values, we report overall optimization time reduction compared to\ngrid and random search. We also show that Bayesian Optimization can decouple\nspeed and BLEU measurements, resulting in a further reduction of overall\noptimization time as speed is measured over a small subset of sentences.", "published": "2016-04-18 10:27:49", "link": "http://arxiv.org/abs/1604.05073v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Clustering Comparable Corpora of Russian and Ukrainian Academic Texts:\n  Word Embeddings and Semantic Fingerprints", "abstract": "We present our experience in applying distributional semantics (neural word\nembeddings) to the problem of representing and clustering documents in a\nbilingual comparable corpus. Our data is a collection of Russian and Ukrainian\nacademic texts, for which topics are their academic fields. In order to build\nlanguage-independent semantic representations of these documents, we train\nneural distributional models on monolingual corpora and learn the optimal\nlinear transformation of vectors from one language to another. The resulting\nvectors are then used to produce `semantic fingerprints' of documents, serving\nas input to a clustering algorithm.\n  The presented method is compared to several baselines including `orthographic\ntranslation' with Levenshtein edit distance and outperforms them by a large\nmargin. We also show that language-independent `semantic fingerprints' are\nsuperior to multi-lingual clustering algorithms proposed in the previous work,\nat the same time requiring less linguistic resources.", "published": "2016-04-18 22:56:13", "link": "http://arxiv.org/abs/1604.05372v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Efficient Calculation of Bigram Frequencies in a Corpus of Short Texts", "abstract": "We show that an efficient and popular method for calculating bigram\nfrequencies is unsuitable for bodies of short texts and offer a simple\nalternative. Our method has the same computational complexity as the old method\nand offers an exact count instead of an approximation.", "published": "2016-04-18 18:51:18", "link": "http://arxiv.org/abs/1604.05559v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
