{"title": "A Paradigm for Situated and Goal-Driven Language Learning", "abstract": "A distinguishing property of human intelligence is the ability to flexibly\nuse language in order to communicate complex ideas with other humans in a\nvariety of contexts. Research in natural language dialogue should focus on\ndesigning communicative agents which can integrate themselves into these\ncontexts and productively collaborate with humans. In this abstract, we propose\na general situated language learning paradigm which is designed to bring about\nrobust language agents able to cooperate productively with humans.", "published": "2016-10-12 02:45:45", "link": "http://arxiv.org/abs/1610.03585v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Language Models with Pre-Trained (GloVe) Word Embeddings", "abstract": "In this work we implement a training of a Language Model (LM), using\nRecurrent Neural Network (RNN) and GloVe word embeddings, introduced by\nPennigton et al. in [1]. The implementation is following the general idea of\ntraining RNNs for LM tasks presented in [2], but is rather using Gated\nRecurrent Unit (GRU) [3] for a memory cell, and not the more commonly used LSTM\n[4].", "published": "2016-10-12 15:53:02", "link": "http://arxiv.org/abs/1610.03759v2", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "SentiHood: Targeted Aspect Based Sentiment Analysis Dataset for Urban\n  Neighbourhoods", "abstract": "In this paper, we introduce the task of targeted aspect-based sentiment\nanalysis. The goal is to extract fine-grained information with respect to\nentities mentioned in user comments. This work extends both aspect-based\nsentiment analysis that assumes a single entity per document and targeted\nsentiment analysis that assumes a single sentiment towards a target entity. In\nparticular, we identify the sentiment towards each aspect of one or more\nentities. As a testbed for this task, we introduce the SentiHood dataset,\nextracted from a question answering (QA) platform where urban neighbourhoods\nare discussed by users. In this context units of text often mention several\naspects of one or more neighbourhoods. This is the first time that a generic\nsocial media platform in this case a QA platform, is used for fine-grained\nopinion mining. Text coming from QA platforms is far less constrained compared\nto text from review specific platforms which current datasets are based on. We\ndevelop several strong baselines, relying on logistic regression and\nstate-of-the-art recurrent neural networks.", "published": "2016-10-12 16:23:11", "link": "http://arxiv.org/abs/1610.03771v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Question Generation from a Knowledge Base with Web Exploration", "abstract": "Question generation from a knowledge base (KB) is the task of generating\nquestions related to the domain of the input KB. We propose a system for\ngenerating fluent and natural questions from a KB, which significantly reduces\nthe human effort by leveraging massive web resources. In more detail, a seed\nquestion set is first generated by applying a small number of hand-crafted\ntemplates on the input KB, then more questions are retrieved by iteratively\nforming already obtained questions as search queries into a standard search\nengine, before finally questions are selected by estimating their fluency and\ndomain relevance. Evaluated by human graders on 500 random-selected triples\nfrom Freebase, questions generated by our system are judged to be more fluent\nthan those of \\newcite{serban-EtAl:2016:P16-1} by human graders.", "published": "2016-10-12 17:55:56", "link": "http://arxiv.org/abs/1610.03807v2", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Generating captions without looking beyond objects", "abstract": "This paper explores new evaluation perspectives for image captioning and\nintroduces a noun translation task that achieves comparative image caption\ngeneration performance by translating from a set of nouns to captions. This\nimplies that in image captioning, all word categories other than nouns can be\nevoked by a powerful language model without sacrificing performance on n-gram\nprecision. The paper also investigates lower and upper bounds of how much\nindividual word categories in the captions contribute to the final BLEU score.\nA large possible improvement exists for nouns, verbs, and prepositions.", "published": "2016-10-12 13:42:03", "link": "http://arxiv.org/abs/1610.03708v2", "categories": ["cs.CV", "cs.CL"], "primary_category": "cs.CV"}
{"title": "Semi-supervised Discovery of Informative Tweets During the Emerging\n  Disasters", "abstract": "The first objective towards the effective use of microblogging services such\nas Twitter for situational awareness during the emerging disasters is discovery\nof the disaster-related postings. Given the wide range of possible disasters,\nusing a pre-selected set of disaster-related keywords for the discovery is\nsuboptimal. An alternative that we focus on in this work is to train a\nclassifier using a small set of labeled postings that are becoming available as\na disaster is emerging. Our hypothesis is that utilizing large quantities of\nhistorical microblogs could improve the quality of classification, as compared\nto training a classifier only on the labeled data. We propose to use unlabeled\nmicroblogs to cluster words into a limited number of clusters and use the word\nclusters as features for classification. To evaluate the proposed\nsemi-supervised approach, we used Twitter data from 6 different disasters. Our\nresults indicate that when the number of labeled tweets is 100 or less, the\nproposed approach is superior to the standard classification based on the bag\nor words feature representation. Our results also reveal that the choice of the\nunlabeled corpus, the choice of word clustering algorithm, and the choice of\nhyperparameters can have a significant impact on the classification accuracy.", "published": "2016-10-12 15:26:30", "link": "http://arxiv.org/abs/1610.03750v1", "categories": ["cs.CL", "cs.SI"], "primary_category": "cs.CL"}
