{"title": "Concept Transfer Learning for Adaptive Language Understanding", "abstract": "Concept definition is important in language understanding (LU) adaptation\nsince literal definition difference can easily lead to data sparsity even if\ndifferent data sets are actually semantically correlated. To address this\nissue, in this paper, a novel concept transfer learning approach is proposed.\nHere, substructures within literal concept definition are investigated to\nreveal the relationship between concepts. A hierarchical semantic\nrepresentation for concepts is proposed, where a semantic slot is represented\nas a composition of {\\em atomic concepts}. Based on this new hierarchical\nrepresentation, transfer learning approaches are developed for adaptive LU. The\napproaches are applied to two tasks: value set mismatch and domain adaptation,\nand evaluated on two LU benchmarks: ATIS and DSTC 2\\&3. Thorough empirical\nstudies validate both the efficiency and effectiveness of the proposed method.\nIn particular, we achieve state-of-the-art performance ($F_1$-score 96.08\\%) on\nATIS by only using lexicon features.", "published": "2017-06-03 10:46:50", "link": "http://arxiv.org/abs/1706.00927v3", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Task-specific Word Identification from Short Texts Using a Convolutional\n  Neural Network", "abstract": "Task-specific word identification aims to choose the task-related words that\nbest describe a short text. Existing approaches require well-defined seed words\nor lexical dictionaries (e.g., WordNet), which are often unavailable for many\napplications such as social discrimination detection and fake review detection.\nHowever, we often have a set of labeled short texts where each short text has a\ntask-related class label, e.g., discriminatory or non-discriminatory, specified\nby users or learned by classification algorithms. In this paper, we focus on\nidentifying task-specific words and phrases from short texts by exploiting\ntheir class labels rather than using seed words or lexical dictionaries. We\nconsider the task-specific word and phrase identification as feature learning.\nWe train a convolutional neural network over a set of labeled texts and use\nscore vectors to localize the task-specific words and phrases. Experimental\nresults on sentiment word identification show that our approach significantly\noutperforms existing methods. We further conduct two case studies to show the\neffectiveness of our approach. One case study on a crawled tweets dataset\ndemonstrates that our approach can successfully capture the\ndiscrimination-related words/phrases. The other case study on fake review\ndetection shows that our approach can identify the fake-review words/phrases.", "published": "2017-06-03 02:15:44", "link": "http://arxiv.org/abs/1706.00884v1", "categories": ["cs.CL", "cs.IR", "cs.LG"], "primary_category": "cs.CL"}
{"title": "Wikipedia Vandal Early Detection: from User Behavior to User Embedding", "abstract": "Wikipedia is the largest online encyclopedia that allows anyone to edit\narticles. In this paper, we propose the use of deep learning to detect vandals\nbased on their edit history. In particular, we develop a multi-source\nlong-short term memory network (M-LSTM) to model user behaviors by using a\nvariety of user edit aspects as inputs, including the history of edit reversion\ninformation, edit page titles and categories. With M-LSTM, we can encode each\nuser into a low dimensional real vector, called user embedding. Meanwhile, as a\nsequential model, M-LSTM updates the user embedding each time after the user\ncommits a new edit. Thus, we can predict whether a user is benign or vandal\ndynamically based on the up-to-date user embedding. Furthermore, those user\nembeddings are crucial to discover collaborative vandals.", "published": "2017-06-03 02:42:40", "link": "http://arxiv.org/abs/1706.00887v1", "categories": ["cs.CR", "cs.CL", "cs.CY"], "primary_category": "cs.CR"}
