{"title": "A Lightweight Regression Method to Infer Psycholinguistic Properties for\n  Brazilian Portuguese", "abstract": "Psycholinguistic properties of words have been used in various approaches to\nNatural Language Processing tasks, such as text simplification and readability\nassessment. Most of these properties are subjective, involving costly and\ntime-consuming surveys to be gathered. Recent approaches use the limited\ndatasets of psycholinguistic properties to extend them automatically to large\nlexicons. However, some of the resources used by such approaches are not\navailable to most languages. This study presents a method to infer\npsycholinguistic properties for Brazilian Portuguese (BP) using regressors\nbuilt with a light set of features usually available for less resourced\nlanguages: word length, frequency lists, lexical databases composed of school\ndictionaries and word embedding models. The correlations between the properties\ninferred are close to those obtained by related works. The resulting resource\ncontains 26,874 words in BP annotated with concreteness, age of acquisition,\nimageability and subjective frequency.", "published": "2017-05-19 14:17:31", "link": "http://arxiv.org/abs/1705.07008v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Softmax Q-Distribution Estimation for Structured Prediction: A\n  Theoretical Interpretation for RAML", "abstract": "Reward augmented maximum likelihood (RAML), a simple and effective learning\nframework to directly optimize towards the reward function in structured\nprediction tasks, has led to a number of impressive empirical successes. RAML\nincorporates task-specific reward by performing maximum-likelihood updates on\ncandidate outputs sampled according to an exponentiated payoff distribution,\nwhich gives higher probabilities to candidates that are close to the reference\noutput. While RAML is notable for its simplicity, efficiency, and its\nimpressive empirical successes, the theoretical properties of RAML, especially\nthe behavior of the exponentiated payoff distribution, has not been examined\nthoroughly. In this work, we introduce softmax Q-distribution estimation, a\nnovel theoretical interpretation of RAML, which reveals the relation between\nRAML and Bayesian decision theory. The softmax Q-distribution can be regarded\nas a smooth approximation of the Bayes decision boundary, and the Bayes\ndecision rule is achieved by decoding with this Q-distribution. We further show\nthat RAML is equivalent to approximately estimating the softmax Q-distribution,\nwith the temperature $\\tau$ controlling approximation error. We perform two\nexperiments, one on synthetic data of multi-class classification and one on\nreal data of image captioning, to demonstrate the relationship between RAML and\nthe proposed softmax Q-distribution estimation method, verifying our\ntheoretical analysis. Additional experiments on three structured prediction\ntasks with rewards defined on sequential (named entity recognition), tree-based\n(dependency parsing) and irregular (machine translation) structures show\nnotable improvements over maximum likelihood baselines.", "published": "2017-05-19 18:17:00", "link": "http://arxiv.org/abs/1705.07136v3", "categories": ["cs.LG", "cs.CL", "stat.ML"], "primary_category": "cs.LG"}
