{"title": "Subregular Complexity and Deep Learning", "abstract": "This paper argues that the judicial use of formal language theory and\ngrammatical inference are invaluable tools in understanding how deep neural\nnetworks can and cannot represent and learn long-term dependencies in temporal\nsequences. Learning experiments were conducted with two types of Recurrent\nNeural Networks (RNNs) on six formal languages drawn from the Strictly Local\n(SL) and Strictly Piecewise (SP) classes. The networks were Simple RNNs\n(s-RNNs) and Long Short-Term Memory RNNs (LSTMs) of varying sizes. The SL and\nSP classes are among the simplest in a mathematically well-understood hierarchy\nof subregular classes. They encode local and long-term dependencies,\nrespectively. The grammatical inference algorithm Regular Positive and Negative\nInference (RPNI) provided a baseline. According to earlier research, the LSTM\narchitecture should be capable of learning long-term dependencies and should\noutperform s-RNNs. The results of these experiments challenge this narrative.\nFirst, the LSTMs' performance was generally worse in the SP experiments than in\nthe SL ones. Second, the s-RNNs out-performed the LSTMs on the most complex SP\nexperiment and performed comparably to them on the others.", "published": "2017-05-16 22:13:45", "link": "http://arxiv.org/abs/1705.05940v3", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "A Novel Neural Network Model for Joint POS Tagging and Graph-based\n  Dependency Parsing", "abstract": "We present a novel neural network model that learns POS tagging and\ngraph-based dependency parsing jointly. Our model uses bidirectional LSTMs to\nlearn feature representations shared for both POS tagging and dependency\nparsing tasks, thus handling the feature-engineering problem. Our extensive\nexperiments, on 19 languages from the Universal Dependencies project, show that\nour model outperforms the state-of-the-art neural network-based\nStack-propagation model for joint POS tagging and transition-based dependency\nparsing, resulting in a new state of the art. Our code is open-source and\navailable together with pre-trained models at:\nhttps://github.com/datquocnguyen/jPTDP", "published": "2017-05-16 23:09:00", "link": "http://arxiv.org/abs/1705.05952v2", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "NeuroNER: an easy-to-use program for named-entity recognition based on\n  neural networks", "abstract": "Named-entity recognition (NER) aims at identifying entities of interest in a\ntext. Artificial neural networks (ANNs) have recently been shown to outperform\nexisting NER systems. However, ANNs remain challenging to use for non-expert\nusers. In this paper, we present NeuroNER, an easy-to-use named-entity\nrecognition tool based on ANNs. Users can annotate entities using a graphical\nweb-based user interface (BRAT): the annotations are then used to train an ANN,\nwhich in turn predict entities' locations and categories in new texts. NeuroNER\nmakes this annotation-training-prediction flow smooth and accessible to anyone.", "published": "2017-05-16 00:03:19", "link": "http://arxiv.org/abs/1705.05487v1", "categories": ["cs.CL", "cs.NE", "stat.ML"], "primary_category": "cs.CL"}
{"title": "Social Media-based Substance Use Prediction", "abstract": "In this paper, we demonstrate how the state-of-the-art machine learning and\ntext mining techniques can be used to build effective social media-based\nsubstance use detection systems. Since a substance use ground truth is\ndifficult to obtain on a large scale, to maximize system performance, we\nexplore different feature learning methods to take advantage of a large amount\nof unsupervised social media data. We also demonstrate the benefit of using\nmulti-view unsupervised feature learning to combine heterogeneous user\ninformation such as Facebook `\"likes\" and \"status updates\" to enhance system\nperformance. Based on our evaluation, our best models achieved 86% AUC for\npredicting tobacco use, 81% for alcohol use and 84% for drug use, all of which\nsignificantly outperformed existing methods. Our investigation has also\nuncovered interesting relations between a user's social media behavior (e.g.,\nword usage) and substance use.", "published": "2017-05-16 10:37:52", "link": "http://arxiv.org/abs/1705.05633v2", "categories": ["cs.CL", "cs.LG", "cs.SI"], "primary_category": "cs.CL"}
{"title": "Know-Evolve: Deep Temporal Reasoning for Dynamic Knowledge Graphs", "abstract": "The availability of large scale event data with time stamps has given rise to\ndynamically evolving knowledge graphs that contain temporal information for\neach edge. Reasoning over time in such dynamic knowledge graphs is not yet well\nunderstood. To this end, we present Know-Evolve, a novel deep evolutionary\nknowledge network that learns non-linearly evolving entity representations over\ntime. The occurrence of a fact (edge) is modeled as a multivariate point\nprocess whose intensity function is modulated by the score for that fact\ncomputed based on the learned entity embeddings. We demonstrate significantly\nimproved performance over various relational learning approaches on two large\nscale real-world datasets. Further, our method effectively predicts occurrence\nor recurrence time of a fact which is novel compared to prior reasoning\napproaches in multi-relational setting.", "published": "2017-05-16 14:53:02", "link": "http://arxiv.org/abs/1705.05742v3", "categories": ["cs.AI", "cs.CL", "cs.LG"], "primary_category": "cs.AI"}
{"title": "A decentralized route to the origins of scaling in human language", "abstract": "The Zipf's law establishes that if the words of a (large) text are ordered by\ndecreasing frequency, the frequency versus the rank decreases as a power law\nwith exponent close to $-1$. Previous work has stressed that this pattern\narises from a conflict of interests of the participants of communication. The\nchallenge here is to define a computational multi-agent language game, mainly\nbased on a parameter that measures the relative participant's interests.\nNumerical simulations suggest that at critical values of the parameter a\nhuman-like vocabulary, exhibiting scaling properties, seems to appear. The\nappearance of an intermediate distribution of frequencies at some critical\nvalues of the parameter suggests that on a population of artificial agents the\nemergence of scaling partly arises as a self-organized process only from local\ninteractions between agents.", "published": "2017-05-16 15:23:14", "link": "http://arxiv.org/abs/1705.05762v2", "categories": ["physics.soc-ph", "cs.CL", "nlin.AO"], "primary_category": "physics.soc-ph"}
