{"title": "Hierarchical Gated Recurrent Neural Tensor Network for Answer Triggering", "abstract": "In this paper, we focus on the problem of answer triggering ad-dressed by\nYang et al. (2015), which is a critical component for a real-world question\nanswering system. We employ a hierarchical gated recurrent neural tensor\n(HGRNT) model to capture both the context information and the deep\nin-teractions between the candidate answers and the question. Our result on F\nval-ue achieves 42.6%, which surpasses the baseline by over 10 %.", "published": "2017-09-17 02:56:40", "link": "http://arxiv.org/abs/1709.05599v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Unwritten Languages Demand Attention Too! Word Discovery with\n  Encoder-Decoder Models", "abstract": "Word discovery is the task of extracting words from unsegmented text. In this\npaper we examine to what extent neural networks can be applied to this task in\na realistic unwritten language scenario, where only small corpora and limited\nannotations are available. We investigate two scenarios: one with no\nsupervision and another with limited supervision with access to the most\nfrequent words. Obtained results show that it is possible to retrieve at least\n27% of the gold standard vocabulary by training an encoder-decoder neural\nmachine translation system with only 5,157 sentences. This result is close to\nthose obtained with a task-specific Bayesian nonparametric model. Moreover, our\napproach has the advantage of generating translation alignments, which could be\nused to create a bilingual lexicon. As a future perspective, this approach is\nalso well suited to work directly from speech.", "published": "2017-09-17 09:36:40", "link": "http://arxiv.org/abs/1709.05631v2", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Character Distributions of Classical Chinese Literary Texts: Zipf's Law,\n  Genres, and Epochs", "abstract": "We collect 14 representative corpora for major periods in Chinese history in\nthis study. These corpora include poetic works produced in several dynasties,\nnovels of the Ming and Qing dynasties, and essays and news reports written in\nmodern Chinese. The time span of these corpora ranges between 1046 BCE and 2007\nCE. We analyze their character and word distributions from the viewpoint of the\nZipf's law, and look for factors that affect the deviations and similarities\nbetween their Zipfian curves. Genres and epochs demonstrated their influences\nin our analyses. Specifically, the character distributions for poetic works of\nbetween 618 CE and 1644 CE exhibit striking similarity. In addition, although\ntexts of the same dynasty may tend to use the same set of characters, their\ncharacter distributions still deviate from each other.", "published": "2017-09-17 01:15:03", "link": "http://arxiv.org/abs/1709.05587v1", "categories": ["cs.CL", "cs.DL"], "primary_category": "cs.CL"}
{"title": "Morphology-based Entity and Relational Entity Extraction Framework for\n  Arabic", "abstract": "Rule-based techniques to extract relational entities from documents allow\nusers to specify desired entities with natural language questions, finite state\nautomata, regular expressions and structured query language. They require\nlinguistic and programming expertise and lack support for Arabic morphological\nanalysis. We present a morphology-based entity and relational entity extraction\nframework for Arabic (MERF). MERF requires basic knowledge of linguistic\nfeatures and regular expressions, and provides the ability to interactively\nspecify Arabic morphological and synonymity features, tag types associated with\nregular expressions, and relations and code actions defined over matches of\nsubexpressions. MERF constructs entities and relational entities from matches\nof the specifications. We evaluated MERF with several case studies. The results\nshow that MERF requires shorter development time and effort compared to\nexisting application specific techniques and produces reasonably accurate\nresults within a reasonable overhead in run time.", "published": "2017-09-17 17:56:24", "link": "http://arxiv.org/abs/1709.05700v2", "categories": ["cs.IR", "cs.CL"], "primary_category": "cs.IR"}
