{"title": "SMPOST: Parts of Speech Tagger for Code-Mixed Indic Social Media Text", "abstract": "Use of social media has grown dramatically during the last few years. Users\nfollow informal languages in communicating through social media. The language\nof communication is often mixed in nature, where people transcribe their\nregional language with English and this technique is found to be extremely\npopular. Natural language processing (NLP) aims to infer the information from\nthese text where Part-of-Speech (PoS) tagging plays an important role in\ngetting the prosody of the written text. For the task of PoS tagging on\nCode-Mixed Indian Social Media Text, we develop a supervised system based on\nConditional Random Field classifier. In order to tackle the problem\neffectively, we have focused on extracting rich linguistic features. We\nparticipate in three different language pairs, ie. English-Hindi,\nEnglish-Bengali and English-Telugu on three different social media platforms,\nTwitter, Facebook & WhatsApp. The proposed system is able to successfully\nassign coarse as well as fine-grained PoS tag labels for a given a code-mixed\nsentence. Experiments show that our system is quite generic that shows\nencouraging performance levels on all the three language pairs in all the\ndomains.", "published": "2017-02-01 09:04:54", "link": "http://arxiv.org/abs/1702.00167v2", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "AMR-to-text Generation with Synchronous Node Replacement Grammar", "abstract": "This paper addresses the task of AMR-to-text generation by leveraging\nsynchronous node replacement grammar. During training, graph-to-string rules\nare learned using a heuristic extraction algorithm. At test time, a graph\ntransducer is applied to collapse input AMRs and generate output sentences.\nEvaluated on SemEval-2016 Task 8, our method gives a BLEU score of 25.62, which\nis the best reported so far.", "published": "2017-02-01 23:36:33", "link": "http://arxiv.org/abs/1702.00500v4", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Foreign-language Reviews: Help or Hindrance?", "abstract": "The number and quality of user reviews greatly affects consumer purchasing\ndecisions. While reviews in all languages are increasing, it is still often the\ncase (especially for non-English speakers) that there are only a few reviews in\na person's first language. Using an online experiment, we examine the value\nthat potential purchasers receive from interfaces showing additional reviews in\na second language. The results paint a complicated picture with both positive\nand negative reactions to the inclusion of foreign-language reviews. Roughly\n26-28% of subjects clicked to see translations of the foreign-language content\nwhen given the opportunity, and those who did so were more likely to select the\nproduct with foreign-language reviews than those who did not.", "published": "2017-02-01 11:18:47", "link": "http://arxiv.org/abs/1702.00210v1", "categories": ["cs.HC", "cs.CL", "cs.CY", "H.5.m"], "primary_category": "cs.HC"}
