{"title": "A Joint Framework for Argumentative Text Analysis Incorporating Domain\n  Knowledge", "abstract": "For argumentation mining, there are several sub-tasks such as argumentation\ncomponent type classification, relation classification. Existing research tends\nto solve such sub-tasks separately, but ignore the close relation between them.\nIn this paper, we present a joint framework incorporating logical relation\nbetween sub-tasks to improve the performance of argumentation structure\ngeneration. We design an objective function to combine the predictions from\nindividual models for each sub-task and solve the problem with some constraints\nconstructed from background knowledge. We evaluate our proposed model on two\npublic corpora and the experiment results show that our model can outperform\nthe baseline that uses a separate model significantly for each sub-task. Our\nmodel also shows advantages on component-related sub-tasks compared to a\nstate-of-the-art joint model based on the evidence graph.", "published": "2017-01-19 09:32:08", "link": "http://arxiv.org/abs/1701.05343v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Harnessing Cognitive Features for Sarcasm Detection", "abstract": "In this paper, we propose a novel mechanism for enriching the feature vector,\nfor the task of sarcasm detection, with cognitive features extracted from\neye-movement patterns of human readers. Sarcasm detection has been a\nchallenging research problem, and its importance for NLP applications such as\nreview summarization, dialog systems and sentiment analysis is well recognized.\nSarcasm can often be traced to incongruity that becomes apparent as the full\nsentence unfolds. This presence of incongruity- implicit or explicit- affects\nthe way readers eyes move through the text. We observe the difference in the\nbehaviour of the eye, while reading sarcastic and non sarcastic sentences.\nMotivated by his observation, we augment traditional linguistic and stylistic\nfeatures for sarcasm detection with the cognitive features obtained from\nreaders eye movement data. We perform statistical classification using the\nenhanced feature set so obtained. The augmented cognitive features improve\nsarcasm detection by 3.7% (in terms of F-score), over the performance of the\nbest reported system.", "published": "2017-01-19 19:32:06", "link": "http://arxiv.org/abs/1701.05574v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Leveraging Cognitive Features for Sentiment Analysis", "abstract": "Sentiments expressed in user-generated short text and sentences are nuanced\nby subtleties at lexical, syntactic, semantic and pragmatic levels. To address\nthis, we propose to augment traditional features used for sentiment analysis\nand sarcasm detection, with cognitive features derived from the eye-movement\npatterns of readers. Statistical classification using our enhanced feature set\nimproves the performance (F-score) of polarity detection by a maximum of 3.7%\nand 9.3% on two datasets, over the systems that use only traditional features.\nWe perform feature significance analysis, and experiment on a held-out dataset,\nshowing that cognitive features indeed empower sentiment analyzers to handle\ncomplex constructs.", "published": "2017-01-19 19:58:26", "link": "http://arxiv.org/abs/1701.05581v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "CEVO: Comprehensive EVent Ontology Enhancing Cognitive Annotation", "abstract": "While the general analysis of named entities has received substantial\nresearch attention on unstructured as well as structured data, the analysis of\nrelations among named entities has received limited focus. In fact, a review of\nthe literature revealed a deficiency in research on the abstract\nconceptualization required to organize relations. We believe that such an\nabstract conceptualization can benefit various communities and applications\nsuch as natural language processing, information extraction, machine learning,\nand ontology engineering. In this paper, we present Comprehensive EVent\nOntology (CEVO), built on Levin's conceptual hierarchy of English verbs that\ncategorizes verbs with shared meaning, and syntactic behavior. We present the\nfundamental concepts and requirements for this ontology. Furthermore, we\npresent three use cases employing the CEVO ontology on annotation tasks: (i)\nannotating relations in plain text, (ii) annotating ontological properties, and\n(iii) linking textual relations to ontological properties. These use-cases\ndemonstrate the benefits of using CEVO for annotation: (i) annotating English\nverbs from an abstract conceptualization, (ii) playing the role of an upper\nontology for organizing ontological properties, and (iii) facilitating the\nannotation of text relations using any underlying vocabulary. This resource is\navailable at https://shekarpour.github.io/cevo.io/ using https://w3id.org/cevo\nnamespace.", "published": "2017-01-19 22:14:25", "link": "http://arxiv.org/abs/1701.05625v2", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Fuzzy Ontology-Based Sentiment Analysis of Transportation and City\n  Feature Reviews for Safe Traveling", "abstract": "Traffic congestion is rapidly increasing in urban areas, particularly in mega\ncities. To date, there exist a few sensor network based systems to address this\nproblem. However, these techniques are not suitable enough in terms of\nmonitoring an entire transportation system and delivering emergency services\nwhen needed. These techniques require real-time data and intelligent ways to\nquickly determine traffic activity from useful information. In addition, these\nexisting systems and websites on city transportation and travel rely on rating\nscores for different factors (e.g., safety, low crime rate, cleanliness, etc.).\nThese rating scores are not efficient enough to deliver precise information,\nwhereas reviews or tweets are significant, because they help travelers and\ntransportation administrators to know about each aspect of the city. However,\nit is difficult for travelers to read, and for transportation systems to\nprocess, all reviews and tweets to obtain expressive sentiments regarding the\nneeds of the city. The optimum solution for this kind of problem is analyzing\nthe information available on social network platforms and performing sentiment\nanalysis. On the other hand, crisp ontology-based frameworks cannot extract\nblurred information from tweets and reviews; therefore, they produce inadequate\nresults. In this regard, this paper proposes fuzzy ontology-based sentiment\nanalysis and SWRL rule-based decision-making to monitor transportation\nactivities and to make a city- feature polarity map for travelers. This system\nretrieves reviews and tweets related to city features and transportation\nactivities. The feature opinions are extracted from these retrieved data, and\nthen fuzzy ontology is used to determine the transportation and city-feature\npolarity. A fuzzy ontology and an intelligent system prototype are developed by\nusing Prot\\'eg\\'e OWL and Java, respectively.", "published": "2017-01-19 08:50:37", "link": "http://arxiv.org/abs/1701.05334v1", "categories": ["cs.AI", "cs.CL"], "primary_category": "cs.AI"}
{"title": "Semantic Evolutionary Concept Distances for Effective Information\n  Retrieval in Query Expansion", "abstract": "In this work several semantic approaches to concept-based query expansion and\nreranking schemes are studied and compared with different ontology-based\nexpansion methods in web document search and retrieval. In particular, we focus\non concept-based query expansion schemes, where, in order to effectively\nincrease the precision of web document retrieval and to decrease the users\nbrowsing time, the main goal is to quickly provide users with the most suitable\nquery expansion. Two key tasks for query expansion in web document retrieval\nare to find the expansion candidates, as the closest concepts in web document\ndomain, and to rank the expanded queries properly. The approach we propose aims\nat improving the expansion phase for better web document retrieval and\nprecision. The basic idea is to measure the distance between candidate concepts\nusing the PMING distance, a collaborative semantic proximity measure, i.e. a\nmeasure which can be computed by using statistical results from web search\nengine. Experiments show that the proposed technique can provide users with\nmore satisfying expansion results and improve the quality of web document\nretrieval.", "published": "2017-01-19 06:38:33", "link": "http://arxiv.org/abs/1701.05311v1", "categories": ["cs.IR", "cs.AI", "cs.CL", "math.PR", "68Uxx, 37A50", "H.3.5"], "primary_category": "cs.IR"}
