{"title": "Classification of Questions and Learning Outcome Statements (LOS) Into\n  Blooms Taxonomy (BT) By Similarity Measurements Towards Extracting Of\n  Learning Outcome from Learning Material", "abstract": "Blooms Taxonomy (BT) have been used to classify the objectives of learning\noutcome by dividing the learning into three different domains; the cognitive\ndomain, the effective domain and the psychomotor domain. In this paper, we are\nintroducing a new approach to classify the questions and learning outcome\nstatements (LOS) into Blooms taxonomy (BT) and to verify BT verb lists, which\nare being cited and used by academicians to write questions and (LOS). An\nexperiment was designed to investigate the semantic relationship between the\naction verbs used in both questions and LOS to obtain more accurate\nclassification of the levels of BT. A sample of 775 different action verbs\ncollected from different universities allows us to measure an accurate and\nclear-cut cognitive level for the action verb. It is worth mentioning that\nnatural language processing techniques were used to develop our rules as to\ninduce the questions into chunks in order to extract the action verbs. Our\nproposed solution was able to classify the action verb into a precise level of\nthe cognitive domain. We, on our side, have tested and evaluated our proposed\nsolution using confusion matrix. The results of evaluation tests yielded 97%\nfor the macro average of precision and 90% for F1. Thus, the outcome of the\nresearch suggests that it is crucial to analyse and verify the action verbs\ncited and used by academicians to write LOS and classify their questions based\non blooms taxonomy in order to obtain a definite and more accurate\nclassification.", "published": "2017-06-10 07:02:57", "link": "http://arxiv.org/abs/1706.03191v2", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Articulation rate in Swedish child-directed speech increases as a\n  function of the age of the child even when surprisal is controlled for", "abstract": "In earlier work, we have shown that articulation rate in Swedish\nchild-directed speech (CDS) increases as a function of the age of the child,\neven when utterance length and differences in articulation rate between\nsubjects are controlled for. In this paper we show on utterance level in\nspontaneous Swedish speech that i) for the youngest children, articulation rate\nin CDS is lower than in adult-directed speech (ADS), ii) there is a significant\nnegative correlation between articulation rate and surprisal (the negative log\nprobability) in ADS, and iii) the increase in articulation rate in Swedish CDS\nas a function of the age of the child holds, even when surprisal along with\nutterance length and differences in articulation rate between speakers are\ncontrolled for. These results indicate that adults adjust their articulation\nrate to make it fit the linguistic capacity of the child.", "published": "2017-06-10 10:25:20", "link": "http://arxiv.org/abs/1706.03216v2", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Online Learning for Neural Machine Translation Post-editing", "abstract": "Neural machine translation has meant a revolution of the field. Nevertheless,\npost-editing the outputs of the system is mandatory for tasks requiring high\ntranslation quality. Post-editing offers a unique opportunity for improving\nneural machine translation systems, using online learning techniques and\ntreating the post-edited translations as new, fresh training data. We review\nclassical learning methods and propose a new optimization algorithm. We\nthoroughly compare online learning algorithms in a post-editing scenario.\nResults show significant improvements in translation quality and effort\nreduction.", "published": "2017-06-10 07:41:22", "link": "http://arxiv.org/abs/1706.03196v1", "categories": ["cs.LG", "cs.CL"], "primary_category": "cs.LG"}
