{"title": "Clickbait Detection in Tweets Using Self-attentive Network", "abstract": "Clickbait detection in tweets remains an elusive challenge. In this paper, we\ndescribe the solution for the Zingel Clickbait Detector at the Clickbait\nChallenge 2017, which is capable of evaluating each tweet's level of click\nbaiting. We first reformat the regression problem as a multi-classification\nproblem, based on the annotation scheme. To perform multi-classification, we\napply a token-level, self-attentive mechanism on the hidden states of\nbi-directional Gated Recurrent Units (biGRU), which enables the model to\ngenerate tweets' task-specific vector representations by attending to important\ntokens. The self-attentive neural network can be trained end-to-end, without\ninvolving any manual feature engineering. Our detector ranked first in the\nfinal evaluation of Clickbait Challenge 2017.", "published": "2017-10-15 17:32:59", "link": "http://arxiv.org/abs/1710.05364v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "NoReC: The Norwegian Review Corpus", "abstract": "This paper presents the Norwegian Review Corpus (NoReC), created for training\nand evaluating models for document-level sentiment analysis. The full-text\nreviews have been collected from major Norwegian news sources and cover a range\nof different domains, including literature, movies, video games, restaurants,\nmusic and theater, in addition to product reviews across a range of categories.\nEach review is labeled with a manually assigned score of 1-6, as provided by\nthe rating of the original author. This first release of the corpus comprises\nmore than 35,000 reviews. It is distributed using the CoNLL-U format,\npre-processed using UDPipe, along with a rich set of metadata. The work\nreported in this paper forms part of the SANT initiative (Sentiment Analysis\nfor Norwegian Text), a project seeking to provide resources and tools for\nsentiment analysis and opinion mining for Norwegian. As resources for sentiment\nanalysis have so far been unavailable for Norwegian, NoReC represents a highly\nvaluable and sought-after addition to Norwegian language technology.", "published": "2017-10-15 18:15:35", "link": "http://arxiv.org/abs/1710.05370v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Text2Action: Generative Adversarial Synthesis from Language to Action", "abstract": "In this paper, we propose a generative model which learns the relationship\nbetween language and human action in order to generate a human action sequence\ngiven a sentence describing human behavior. The proposed generative model is a\ngenerative adversarial network (GAN), which is based on the sequence to\nsequence (SEQ2SEQ) model. Using the proposed generative network, we can\nsynthesize various actions for a robot or a virtual agent using a text encoder\nrecurrent neural network (RNN) and an action decoder RNN. The proposed\ngenerative network is trained from 29,770 pairs of actions and sentence\nannotations extracted from MSR-Video-to-Text (MSR-VTT), a large-scale video\ndataset. We demonstrate that the network can generate human-like actions which\ncan be transferred to a Baxter robot, such that the robot performs an action\nbased on a provided sentence. Results show that the proposed generative network\ncorrectly models the relationship between language and action and can generate\na diverse set of actions from the same sentence.", "published": "2017-10-15 07:51:01", "link": "http://arxiv.org/abs/1710.05298v2", "categories": ["cs.LG", "cs.CL", "cs.RO"], "primary_category": "cs.LG"}
