{"title": "Towards Speech Emotion Recognition \"in the wild\" using Aggregated\n  Corpora and Deep Multi-Task Learning", "abstract": "One of the challenges in Speech Emotion Recognition (SER) \"in the wild\" is\nthe large mismatch between training and test data (e.g. speakers and tasks). In\norder to improve the generalisation capabilities of the emotion models, we\npropose to use Multi-Task Learning (MTL) and use gender and naturalness as\nauxiliary tasks in deep neural networks. This method was evaluated in\nwithin-corpus and various cross-corpus classification experiments that simulate\nconditions \"in the wild\". In comparison to Single-Task Learning (STL) based\nstate of the art methods, we found that our MTL method proposed improved\nperformance significantly. Particularly, models using both gender and\nnaturalness achieved more gains than those using either gender or naturalness\nseparately. This benefit was also found in the high-level representations of\nthe feature space, obtained from our method proposed, where discriminative\nemotional clusters could be observed.", "published": "2017-08-13 15:09:47", "link": "http://arxiv.org/abs/1708.03920v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "EmoTxt: A Toolkit for Emotion Recognition from Text", "abstract": "We present EmoTxt, a toolkit for emotion recognition from text, trained and\ntested on a gold standard of about 9K question, answers, and comments from\nonline interactions. We provide empirical evidence of the performance of\nEmoTxt. To the best of our knowledge, EmoTxt is the first open-source toolkit\nsupporting both emotion recognition from text and training of custom emotion\nclassification models.", "published": "2017-08-13 11:55:02", "link": "http://arxiv.org/abs/1708.03892v2", "categories": ["cs.HC", "cs.CL"], "primary_category": "cs.HC"}
{"title": "Semi-supervised emotion lexicon expansion with label propagation and\n  specialized word embeddings", "abstract": "There exist two main approaches to automatically extract affective\norientation: lexicon-based and corpus-based. In this work, we argue that these\ntwo methods are compatible and show that combining them can improve the\naccuracy of emotion classifiers. In particular, we introduce a novel variant of\nthe Label Propagation algorithm that is tailored to distributed word\nrepresentations, we apply batch gradient descent to accelerate the optimization\nof label propagation and to make the optimization feasible for large graphs,\nand we propose a reproducible method for emotion lexicon expansion. We conclude\nthat label propagation can expand an emotion lexicon in a meaningful way and\nthat the expanded emotion lexicon can be leveraged to improve the accuracy of\nan emotion classifier.", "published": "2017-08-13 14:09:22", "link": "http://arxiv.org/abs/1708.03910v1", "categories": ["cs.CL", "cs.AI", "cs.NE"], "primary_category": "cs.CL"}
{"title": "Leveraging Sparse and Dense Feature Combinations for Sentiment\n  Classification", "abstract": "Neural networks are one of the most popular approaches for many natural\nlanguage processing tasks such as sentiment analysis. They often outperform\ntraditional machine learning models and achieve the state-of-art results on\nmost tasks. However, many existing deep learning models are complex, difficult\nto train and provide a limited improvement over simpler methods. We propose a\nsimple, robust and powerful model for sentiment classification. This model\noutperforms many deep learning models and achieves comparable results to other\ndeep learning models with complex architectures on sentiment analysis datasets.\nWe publish the code online.", "published": "2017-08-13 17:38:17", "link": "http://arxiv.org/abs/1708.03940v1", "categories": ["cs.CL", "cs.IR", "cs.LG"], "primary_category": "cs.CL"}
