{"title": "Cross-Sentence N-ary Relation Extraction with Graph LSTMs", "abstract": "Past work in relation extraction has focused on binary relations in single\nsentences. Recent NLP inroads in high-value domains have sparked interest in\nthe more general setting of extracting n-ary relations that span multiple\nsentences. In this paper, we explore a general relation extraction framework\nbased on graph long short-term memory networks (graph LSTMs) that can be easily\nextended to cross-sentence n-ary relation extraction. The graph formulation\nprovides a unified way of exploring different LSTM approaches and incorporating\nvarious intra-sentential and inter-sentential dependencies, such as sequential,\nsyntactic, and discourse relations. A robust contextual representation is\nlearned for the entities, which serves as input to the relation classifier.\nThis simplifies handling of relations with arbitrary arity, and enables\nmulti-task learning with related relations. We evaluate this framework in two\nimportant precision medicine settings, demonstrating its effectiveness with\nboth conventional supervised learning and distant supervision. Cross-sentence\nextraction produced larger knowledge bases. and multi-task learning\nsignificantly improved extraction accuracy. A thorough analysis of various LSTM\napproaches yielded useful insight the impact of linguistic analysis on\nextraction accuracy.", "published": "2017-08-12 04:33:52", "link": "http://arxiv.org/abs/1708.03743v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Statistical Vs Rule Based Machine Translation; A Case Study on Indian\n  Language Perspective", "abstract": "In this paper we present our work on a case study between Statistical Machien\nTransaltion (SMT) and Rule-Based Machine Translation (RBMT) systems on\nEnglish-Indian langugae and Indian to Indian langugae perspective. Main\nobjective of our study is to make a five way performance compariosn; such as,\na) SMT and RBMT b) SMT on English-Indian langugae c) RBMT on English-Indian\nlangugae d) SMT on Indian to Indian langugae perspective e) RBMT on Indian to\nIndian langugae perspective. Through a detailed analysis we describe the Rule\nBased and the Statistical Machine Translation system developments and its\nevaluations. Through a detailed error analysis, we point out the relative\nstrengths and weaknesses of both systems. The observations based on our study\nare: a) SMT systems outperforms RBMT b) In the case of SMT, English to Indian\nlanguage MT systmes performs better than Indian to English langugae MT systems\nc) In the case of RBMT, English to Indian langugae MT systems perofrms better\nthan Indian to Englsih Language MT systems d) SMT systems performs better for\nIndian to Indian language MT systems compared to RBMT. Effectively, we shall\nsee that even with a small amount of training corpus a statistical machine\ntranslation system has many advantages for high quality domain specific machine\ntranslation over that of a rule-based counterpart.", "published": "2017-08-12 18:55:12", "link": "http://arxiv.org/abs/1708.04559v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
