{"title": "Adversarial Multi-Criteria Learning for Chinese Word Segmentation", "abstract": "Different linguistic perspectives causes many diverse segmentation criteria\nfor Chinese word segmentation (CWS). Most existing methods focus on improve the\nperformance for each single criterion. However, it is interesting to exploit\nthese different criteria and mining their common underlying knowledge. In this\npaper, we propose adversarial multi-criteria learning for CWS by integrating\nshared knowledge from multiple heterogeneous segmentation criteria. Experiments\non eight corpora with heterogeneous segmentation criteria show that the\nperformance of each corpus obtains a significant improvement, compared to\nsingle-criterion learning. Source codes of this paper are available on Github.", "published": "2017-04-25 06:42:24", "link": "http://arxiv.org/abs/1704.07556v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Joint POS Tagging and Dependency Parsing with Transition-based Neural\n  Networks", "abstract": "While part-of-speech (POS) tagging and dependency parsing are observed to be\nclosely related, existing work on joint modeling with manually crafted feature\ntemplates suffers from the feature sparsity and incompleteness problems. In\nthis paper, we propose an approach to joint POS tagging and dependency parsing\nusing transition-based neural networks. Three neural network based classifiers\nare designed to resolve shift/reduce, tagging, and labeling conflicts.\nExperiments show that our approach significantly outperforms previous methods\nfor joint POS tagging and dependency parsing across a variety of natural\nlanguages.", "published": "2017-04-25 10:22:57", "link": "http://arxiv.org/abs/1704.07616v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Automatic Compositor Attribution in the First Folio of Shakespeare", "abstract": "Compositor attribution, the clustering of pages in a historical printed\ndocument by the individual who set the type, is a bibliographic task that\nrelies on analysis of orthographic variation and inspection of visual details\nof the printed page. In this paper, we introduce a novel unsupervised model\nthat jointly describes the textual and visual features needed to distinguish\ncompositors. Applied to images of Shakespeare's First Folio, our model predicts\nattributions that agree with the manual judgements of bibliographers with an\naccuracy of 87%, even on text that is the output of OCR.", "published": "2017-04-25 19:26:36", "link": "http://arxiv.org/abs/1704.07875v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Email Babel: Does Language Affect Criminal Activity in Compromised\n  Webmail Accounts?", "abstract": "We set out to understand the effects of differing language on the ability of\ncybercriminals to navigate webmail accounts and locate sensitive information in\nthem. To this end, we configured thirty Gmail honeypot accounts with English,\nRomanian, and Greek language settings. We populated the accounts with email\nmessages in those languages by subscribing them to selected online newsletters.\nWe hid email messages about fake bank accounts in fifteen of the accounts to\nmimic real-world webmail users that sometimes store sensitive information in\ntheir accounts. We then leaked credentials to the honey accounts via paste\nsites on the Surface Web and the Dark Web, and collected data for fifteen days.\nOur statistical analyses on the data show that cybercriminals are more likely\nto discover sensitive information (bank account information) in the Greek\naccounts than the remaining accounts, contrary to the expectation that Greek\nought to constitute a barrier to the understanding of non-Greek visitors to the\nGreek accounts. We also extracted the important words among the emails that\ncybercriminals accessed (as an approximation of the keywords that they searched\nfor within the honey accounts), and found that financial terms featured among\nthe top words. In summary, we show that language plays a significant role in\nthe ability of cybercriminals to access sensitive information hidden in\ncompromised webmail accounts.", "published": "2017-04-25 16:07:34", "link": "http://arxiv.org/abs/1704.07759v1", "categories": ["cs.CY", "cs.CL"], "primary_category": "cs.CY"}
{"title": "Abstract Syntax Networks for Code Generation and Semantic Parsing", "abstract": "Tasks like code generation and semantic parsing require mapping unstructured\n(or partially structured) inputs to well-formed, executable outputs. We\nintroduce abstract syntax networks, a modeling framework for these problems.\nThe outputs are represented as abstract syntax trees (ASTs) and constructed by\na decoder with a dynamically-determined modular structure paralleling the\nstructure of the output tree. On the benchmark Hearthstone dataset for code\ngeneration, our model obtains 79.2 BLEU and 22.7% exact match accuracy,\ncompared to previous state-of-the-art values of 67.1 and 6.1%. Furthermore, we\nperform competitively on the Atis, Jobs, and Geo semantic parsing datasets with\nno task-specific engineering.", "published": "2017-04-25 04:37:35", "link": "http://arxiv.org/abs/1704.07535v1", "categories": ["cs.CL", "cs.AI", "cs.LG", "stat.ML"], "primary_category": "cs.CL"}
{"title": "280 Birds with One Stone: Inducing Multilingual Taxonomies from\n  Wikipedia using Character-level Classification", "abstract": "We propose a simple, yet effective, approach towards inducing multilingual\ntaxonomies from Wikipedia. Given an English taxonomy, our approach leverages\nthe interlanguage links of Wikipedia followed by character-level classifiers to\ninduce high-precision, high-coverage taxonomies in other languages. Through\nexperiments, we demonstrate that our approach significantly outperforms the\nstate-of-the-art, heuristics-heavy approaches for six languages. As a\nconsequence of our work, we release presumably the largest and the most\naccurate multilingual taxonomic resource spanning over 280 languages.", "published": "2017-04-25 10:45:43", "link": "http://arxiv.org/abs/1704.07624v2", "categories": ["cs.CL", "cs.AI", "cs.IR"], "primary_category": "cs.CL"}
{"title": "Taxonomy Induction using Hypernym Subsequences", "abstract": "We propose a novel, semi-supervised approach towards domain taxonomy\ninduction from an input vocabulary of seed terms. Unlike all previous\napproaches, which typically extract direct hypernym edges for terms, our\napproach utilizes a novel probabilistic framework to extract hypernym\nsubsequences. Taxonomy induction from extracted subsequences is cast as an\ninstance of the minimumcost flow problem on a carefully designed directed\ngraph. Through experiments, we demonstrate that our approach outperforms\nstateof- the-art taxonomy induction approaches across four languages.\nImportantly, we also show that our approach is robust to the presence of noise\nin the input vocabulary. To the best of our knowledge, no previous approaches\nhave been empirically proven to manifest noise-robustness in the input\nvocabulary.", "published": "2017-04-25 10:49:53", "link": "http://arxiv.org/abs/1704.07626v4", "categories": ["cs.AI", "cs.CL", "cs.IR"], "primary_category": "cs.AI"}
{"title": "DeepAM: Migrate APIs with Multi-modal Sequence to Sequence Learning", "abstract": "Computer programs written in one language are often required to be ported to\nother languages to support multiple devices and environments. When programs use\nlanguage specific APIs (Application Programming Interfaces), it is very\nchallenging to migrate these APIs to the corresponding APIs written in other\nlanguages. Existing approaches mine API mappings from projects that have\ncorresponding versions in two languages. They rely on the sparse availability\nof bilingual projects, thus producing a limited number of API mappings. In this\npaper, we propose an intelligent system called DeepAM for automatically mining\nAPI mappings from a large-scale code corpus without bilingual projects. The key\ncomponent of DeepAM is based on the multimodal sequence to sequence learning\narchitecture that aims to learn joint semantic representations of bilingual API\nsequences from big source code data. Experimental results indicate that DeepAM\nsignificantly increases the accuracy of API mappings as well as the number of\nAPI mappings, when compared with the state-of-the-art approaches.", "published": "2017-04-25 15:09:51", "link": "http://arxiv.org/abs/1704.07734v1", "categories": ["cs.SE", "cs.CL", "cs.NE"], "primary_category": "cs.SE"}
{"title": "Friendships, Rivalries, and Trysts: Characterizing Relations between\n  Ideas in Texts", "abstract": "Understanding how ideas relate to each other is a fundamental question in\nmany domains, ranging from intellectual history to public communication.\nBecause ideas are naturally embedded in texts, we propose the first framework\nto systematically characterize the relations between ideas based on their\noccurrence in a corpus of documents, independent of how these ideas are\nrepresented. Combining two statistics --- cooccurrence within documents and\nprevalence correlation over time --- our approach reveals a number of different\nways in which ideas can cooperate and compete. For instance, two ideas can\nclosely track each other's prevalence over time, and yet rarely cooccur, almost\nlike a \"cold war\" scenario. We observe that pairwise cooccurrence and\nprevalence correlation exhibit different distributions. We further demonstrate\nthat our approach is able to uncover intriguing relations between ideas through\nin-depth case studies on news articles and research papers.", "published": "2017-04-25 18:00:01", "link": "http://arxiv.org/abs/1704.07828v2", "categories": ["cs.SI", "cs.CL", "physics.soc-ph"], "primary_category": "cs.SI"}
{"title": "Fine-Grained Entity Typing with High-Multiplicity Assignments", "abstract": "As entity type systems become richer and more fine-grained, we expect the\nnumber of types assigned to a given entity to increase. However, most\nfine-grained typing work has focused on datasets that exhibit a low degree of\ntype multiplicity. In this paper, we consider the high-multiplicity regime\ninherent in data sources such as Wikipedia that have semi-open type systems. We\nintroduce a set-prediction approach to this problem and show that our model\noutperforms unstructured baselines on a new Wikipedia-based fine-grained typing\ncorpus.", "published": "2017-04-25 15:52:52", "link": "http://arxiv.org/abs/1704.07751v1", "categories": ["cs.CL", "cs.AI", "cs.IR", "cs.LG", "stat.ML"], "primary_category": "cs.CL"}
