{"title": "Sentiment Analysis of Citations Using Word2vec", "abstract": "Citation sentiment analysis is an important task in scientific paper\nanalysis. Existing machine learning techniques for citation sentiment analysis\nare focusing on labor-intensive feature engineering, which requires large\nannotated corpus. As an automatic feature extraction tool, word2vec has been\nsuccessfully applied to sentiment analysis of short texts. In this work, I\nconducted empirical research with the question: how well does word2vec work on\nthe sentiment analysis of citations? The proposed method constructed sentence\nvectors (sent2vec) by averaging the word embeddings, which were learned from\nAnthology Collections (ACL-Embeddings). I also investigated polarity-specific\nword embeddings (PS-Embeddings) for classifying positive and negative\ncitations. The sentence vectors formed a feature space, to which the examined\ncitation sentence was mapped to. Those features were input into classifiers\n(support vector machines) for supervised classification. Using\n10-cross-validation scheme, evaluation was conducted on a set of annotated\ncitations. The results showed that word embeddings are effective on classifying\npositive and negative citations. However, hand-crafted features performed\nbetter for the overall classification.", "published": "2017-04-01 14:53:54", "link": "http://arxiv.org/abs/1704.00177v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Towards Building Large Scale Multimodal Domain-Aware Conversation\n  Systems", "abstract": "While multimodal conversation agents are gaining importance in several\ndomains such as retail, travel etc., deep learning research in this area has\nbeen limited primarily due to the lack of availability of large-scale, open\nchatlogs. To overcome this bottleneck, in this paper we introduce the task of\nmultimodal, domain-aware conversations, and propose the MMD benchmark dataset.\nThis dataset was gathered by working in close coordination with large number of\ndomain experts in the retail domain. These experts suggested various\nconversations flows and dialog states which are typically seen in multimodal\nconversations in the fashion domain. Keeping these flows and states in mind, we\ncreated a dataset consisting of over 150K conversation sessions between\nshoppers and sales agents, with the help of in-house annotators using a\nsemi-automated manually intense iterative process. With this dataset, we\npropose 5 new sub-tasks for multimodal conversations along with their\nevaluation methodology. We also propose two multimodal neural models in the\nencode-attend-decode paradigm and demonstrate their performance on two of the\nsub-tasks, namely text response generation and best image response selection.\nThese experiments serve to establish baseline performance and open new research\ndirections for each of these sub-tasks. Further, for each of the sub-tasks, we\npresent a `per-state evaluation' of 9 most significant dialog states, which\nwould enable more focused research into understanding the challenges and\ncomplexities involved in each of these states.", "published": "2017-04-01 17:05:35", "link": "http://arxiv.org/abs/1704.00200v3", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Topic modeling of public repositories at scale using names in source\n  code", "abstract": "Programming languages themselves have a limited number of reserved keywords\nand character based tokens that define the language specification. However,\nprogrammers have a rich use of natural language within their code through\ncomments, text literals and naming entities. The programmer defined names that\ncan be found in source code are a rich source of information to build a high\nlevel understanding of the project. The goal of this paper is to apply topic\nmodeling to names used in over 13.6 million repositories and perceive the\ninferred topics. One of the problems in such a study is the occurrence of\nduplicate repositories not officially marked as forks (obscure forks). We show\nhow to address it using the same identifiers which are extracted for topic\nmodeling.\n  We open with a discussion on naming in source code, we then elaborate on our\napproach to remove exact duplicate and fuzzy duplicate repositories using\nLocality Sensitive Hashing on the bag-of-words model and then discuss our work\non topic modeling; and finally present the results from our data analysis\ntogether with open-access to the source code, tools and datasets.", "published": "2017-04-01 08:16:20", "link": "http://arxiv.org/abs/1704.00135v2", "categories": ["cs.PL", "cs.CL"], "primary_category": "cs.PL"}
{"title": "Psychological and Personality Profiles of Political Extremists", "abstract": "Global recruitment into radical Islamic movements has spurred renewed\ninterest in the appeal of political extremism. Is the appeal a rational\nresponse to material conditions or is it the expression of psychological and\npersonality disorders associated with aggressive behavior, intolerance,\nconspiratorial imagination, and paranoia? Empirical answers using surveys have\nbeen limited by lack of access to extremist groups, while field studies have\nlacked psychological measures and failed to compare extremists with contrast\ngroups. We revisit the debate over the appeal of extremism in the U.S. context\nby comparing publicly available Twitter messages written by over 355,000\npolitical extremist followers with messages written by non-extremist U.S.\nusers. Analysis of text-based psychological indicators supports the moral\nfoundation theory which identifies emotion as a critical factor in determining\npolitical orientation of individuals. Extremist followers also differ from\nothers in four of the Big Five personality traits.", "published": "2017-04-01 04:31:37", "link": "http://arxiv.org/abs/1704.00119v1", "categories": ["cs.CL", "cs.CY", "cs.SI", "physics.soc-ph"], "primary_category": "cs.CL"}
{"title": "Adversarial Connective-exploiting Networks for Implicit Discourse\n  Relation Classification", "abstract": "Implicit discourse relation classification is of great challenge due to the\nlack of connectives as strong linguistic cues, which motivates the use of\nannotated implicit connectives to improve the recognition. We propose a feature\nimitation framework in which an implicit relation network is driven to learn\nfrom another neural network with access to connectives, and thus encouraged to\nextract similarly salient features for accurate classification. We develop an\nadversarial model to enable an adaptive imitation scheme through competition\nbetween the implicit network and a rival feature discriminator. Our method\neffectively transfers discriminability of connectives to the implicit features,\nand achieves state-of-the-art performance on the PDTB benchmark.", "published": "2017-04-01 19:29:21", "link": "http://arxiv.org/abs/1704.00217v1", "categories": ["cs.CL", "cs.AI", "cs.LG", "stat.ML"], "primary_category": "cs.CL"}
