{"title": "The Character Thinks Ahead: creative writing with deep learning nets and\n  its stylistic assessment", "abstract": "We discuss how to control outputs from deep learning models of text corpora\nso as to create contemporary poetic works. We assess whether these controls are\nsuccessful in the immediate sense of creating stylo- metric distinctiveness.\nThe specific context is our piece The Character Thinks Ahead (2016/17); the\npotential applications are broad.", "published": "2017-12-21 05:16:51", "link": "http://arxiv.org/abs/1712.07794v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Variational Attention for Sequence-to-Sequence Models", "abstract": "The variational encoder-decoder (VED) encodes source information as a set of\nrandom variables using a neural network, which in turn is decoded into target\ndata using another neural network. In natural language processing,\nsequence-to-sequence (Seq2Seq) models typically serve as encoder-decoder\nnetworks. When combined with a traditional (deterministic) attention mechanism,\nthe variational latent space may be bypassed by the attention model, and thus\nbecomes ineffective. In this paper, we propose a variational attention\nmechanism for VED, where the attention vector is also modeled as Gaussian\ndistributed random variables. Results on two experiments show that, without\nloss of quality, our proposed method alleviates the bypassing phenomenon as it\nincreases the diversity of generated sentences.", "published": "2017-12-21 20:47:27", "link": "http://arxiv.org/abs/1712.08207v3", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Rate-Distributed Spatial Filtering Based Noise Reduction in Wireless\n  Acoustic Sensor Networks", "abstract": "In wireless acoustic sensor networks (WASNs), sensors typically have a\nlimited energy budget as they are often battery driven. Energy efficiency is\ntherefore essential to the design of algorithms in WASNs. One way to reduce\nenergy costs is to only select the sensors which are most informative, a\nproblem known as {\\it sensor selection}. In this way, only sensors that\nsignificantly contribute to the task at hand will be involved. In this work, we\nconsider a more general approach, which is based on rate-distributed spatial\nfiltering. Together with the distance over which transmission takes place, bit\nrate directly influences the energy consumption. We try to minimize the battery\nusage due to transmission, while constraining the noise reduction performance.\nThis results in an efficient rate allocation strategy, which depends on the\nunderlying signal statistics, as well as the distance from sensors to a fusion\ncenter (FC). Under the utilization of a linearly constrained minimum variance\n(LCMV) beamformer, the problem is derived as a semi-definite program.\nFurthermore, we show that rate allocation is more general than sensor\nselection, and sensor selection can be seen as a special case of the presented\nrate-allocation solution, e.g., the best microphone subset can be determined by\nthresholding the rates. Finally, numerical simulations for the application of\nestimating several target sources in a WASN demonstrate that the proposed\nmethod outperforms the microphone subset selection based approaches in the\nsense of energy usage, and we find that the sensors close to the FC and close\nto point sources are allocated with higher rates.", "published": "2017-12-21 13:54:45", "link": "http://arxiv.org/abs/1712.07941v1", "categories": ["cs.SD", "eess.AS"], "primary_category": "cs.SD"}
{"title": "On the Use of a Spectral Glottal Model for the Source-filter Separation\n  of Speech", "abstract": "The estimation of glottal flow from a speech waveform is a key method for\nspeech analysis and parameterization. Significant research effort has been made\nto dissociate the first vocal tract resonance from the glottal formant (the\nlow-frequency resonance describing the open-phase of the vocal fold vibration).\nHowever few methods cope with estimation of high-frequency spectral tilt to\ndescribe the return-phase of the vocal fold vibration, which is crucial to the\nperception of vocal effort. This paper proposes an improved version of the\nwell-known Iterative Adaptive Inverse Filtering (IAIF) called GFM-IAIF.\nGFM-IAIF includes a full spectral model of the glottis that incorporates both\nglottal formant and spectral tilt features. Comparisons with the standard IAIF\nmethod show that while GFM-IAIF maintains good performance on vocal tract\nremoval, it significantly improves the perceptive timbral variations associated\nto vocal effort.", "published": "2017-12-21 16:01:37", "link": "http://arxiv.org/abs/1712.08034v1", "categories": ["eess.AS", "cs.SD"], "primary_category": "eess.AS"}
{"title": "Towards a Deep Improviser: a prototype deep learning post-tonal free\n  music generator", "abstract": "Two modest-sized symbolic corpora of post-tonal and post-metric keyboard\nmusic have been constructed, one algorithmic, the other improvised. Deep\nlearning models of each have been trained and largely optimised. Our purpose is\nto obtain a model with sufficient generalisation capacity that in response to a\nsmall quantity of separate fresh input seed material, it can generate outputs\nthat are distinctive, rather than recreative of the learned corpora or the seed\nmaterial. This objective has been first assessed statistically, and as judged\nby k-sample Anderson-Darling and Cramer tests, has been achieved. Music has\nbeen generated using the approach, and informal judgements place it roughly on\na par with algorithmic and composed music in related forms. Future work will\naim to enhance the model such that it can be evaluated in relation to\nexpression, meaning and utility in real-time performance.", "published": "2017-12-21 05:28:15", "link": "http://arxiv.org/abs/1712.07799v1", "categories": ["cs.SD", "cs.LG", "eess.AS"], "primary_category": "cs.SD"}
{"title": "Indoor Sound Source Localization with Probabilistic Neural Network", "abstract": "It is known that adverse environments such as high reverberation and low\nsignal-to-noise ratio (SNR) pose a great challenge to indoor sound source\nlocalization. To address this challenge, in this paper, we propose a sound\nsource localization algorithm based on probabilistic neural network, namely\nGeneralized cross correlation Classification Algorithm (GCA). Experimental\nresults for adverse environments with high reverberation time T60 up to 600ms\nand low SNR such as -10dB show that, the average azimuth angle error and\nelevation angle error by GCA are only 4.6 degrees and 3.1 degrees respectively.\nCompared with three recently published algorithms, GCA has increased the\nsuccess rate on direction of arrival estimation significantly with good\nrobustness to environmental changes. These results show that the proposed GCA\ncan localize accurately and robustly for diverse indoor applications where the\nsite acoustic features can be studied prior to the localization stage.", "published": "2017-12-21 07:26:53", "link": "http://arxiv.org/abs/1712.07814v1", "categories": ["cs.SD", "cs.LG", "eess.AS"], "primary_category": "cs.SD"}
