{"title": "Scalable Multi-Domain Dialogue State Tracking", "abstract": "Dialogue state tracking (DST) is a key component of task-oriented dialogue\nsystems. DST estimates the user's goal at each user turn given the interaction\nuntil then. State of the art approaches for state tracking rely on deep\nlearning methods, and represent dialogue state as a distribution over all\npossible slot values for each slot present in the ontology. Such a\nrepresentation is not scalable when the set of possible values are unbounded\n(e.g., date, time or location) or dynamic (e.g., movies or usernames).\nFurthermore, training of such models requires labeled data, where each user\nturn is annotated with the dialogue state, which makes building models for new\ndomains challenging. In this paper, we present a scalable multi-domain deep\nlearning based approach for DST. We introduce a novel framework for state\ntracking which is independent of the slot value set, and represent the dialogue\nstate as a distribution over a set of values of interest (candidate set)\nderived from the dialogue history or knowledge. Restricting these candidate\nsets to be bounded in size addresses the problem of slot-scalability.\nFurthermore, by leveraging the slot-independent architecture and transfer\nlearning, we show that our proposed approach facilitates quick adaptation to\nnew domains.", "published": "2017-12-29 13:34:46", "link": "http://arxiv.org/abs/1712.10224v2", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Personal Names in Modern Turkey", "abstract": "We analyzed the most common 5000 male and 5000 female Turkish names based on\ntheir etymological, morphological, and semantic attributes. The name statistics\nare based on all Turkish citizens who were alive in 2014 and they cover 90% of\nall population. To the best of our knowledge, this study is the most\ncomprehensive data-driven analysis of Turkish personal names. Female names have\na greater diversity than male names (e.g., top 15 male names cover 25% of the\nmale population, whereas top 28 female names cover 25% of the female\npopulation). Despite their diversity, female names exhibit predictable\npatterns. For example, certain roots such as g\\\"ul and nar (rose and\npomegranate/red, respectively) are used to generate hundreds of unique female\nnames. Turkish personal names have their origins mainly in Arabic, followed by\nTurkish and Persian. We computed overall frequencies of names according to\nbroad semantic themes that were identified in previous studies. We found that\nforeign-origin names such as olga and khaled, pastoral names such as ya\\u{g}mur\nand deniz (rain and sea, respectively), and names based on fruits and plants\nsuch as filiz and menek\\c{s}e (sprout and violet, respectively) are more\nfrequently observed among females. Among males, names based on animals such as\narslan and yunus (lion and dolphin, respectively) and names based on famous\nand/or historical figures such as mustafa kemal and o\\u{g}uz ka\\u{g}an (founder\nof the Turkish Republic and the founder of the Turks in Turkish mythology,\nrespectively) are observed more frequently.", "published": "2017-12-29 22:21:39", "link": "http://arxiv.org/abs/1801.00049v2", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "The CAPIO 2017 Conversational Speech Recognition System", "abstract": "In this paper we show how we have achieved the state-of-the-art performance\non the industry-standard NIST 2000 Hub5 English evaluation set. We explore\ndensely connected LSTMs, inspired by the densely connected convolutional\nnetworks recently introduced for image classification tasks. We also propose an\nacoustic model adaptation scheme that simply averages the parameters of a seed\nneural network acoustic model and its adapted version. This method was applied\nwith the CallHome training corpus and improved individual system performances\nby on average 6.1% (relative) against the CallHome portion of the evaluation\nset with no performance loss on the Switchboard portion. With RNN-LM rescoring\nand lattice combination on the 5 systems trained across three different phone\nsets, our 2017 speech recognition system has obtained 5.0% and 9.1% on\nSwitchboard and CallHome, respectively, both of which are the best word error\nrates reported thus far. According to IBM in their latest work to compare human\nand machine transcriptions, our reported Switchboard word error rate can be\nconsidered to surpass the human parity (5.1%) of transcribing conversational\ntelephone speech.", "published": "2017-12-29 23:31:05", "link": "http://arxiv.org/abs/1801.00059v2", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Detecting Cross-Lingual Plagiarism Using Simulated Word Embeddings", "abstract": "Cross-lingual plagiarism (CLP) occurs when texts written in one language are\ntranslated into a different language and used without acknowledging the\noriginal sources. One of the most common methods for detecting CLP requires\nonline machine translators (such as Google or Microsoft translate) which are\nnot always available, and given that plagiarism detection typically involves\nlarge document comparison, the amount of translations required would overwhelm\nan online machine translator, especially when detecting plagiarism over the\nweb. In addition, when translated texts are replaced with their synonyms, using\nonline machine translators to detect CLP would result in poor performance. This\npaper addresses the problem of cross-lingual plagiarism detection (CLPD) by\nproposing a model that uses simulated word embeddings to reproduce the\npredictions of an online machine translator (Google translate) when detecting\nCLP. The simulated embeddings comprise of translated words in different\nlanguages mapped in a common space, and replicated to increase the prediction\nprobability of retrieving the translations of a word (and their synonyms) from\nthe model. Unlike most existing models, the proposed model does not require\nparallel corpora, and accommodates multiple languages (multi-lingual). We\ndemonstrated the effectiveness of the proposed model in detecting CLP in\nstandard datasets that contain CLP cases, and evaluated its performance against\na state-of-the-art baseline that relies on online machine translator (T+MA\nmodel). Evaluation results revealed that the proposed model is not only\neffective in detecting CLP, it outperformed the baseline. The results indicate\nthat CLP could be detected with state-of-the-art performances by leveraging the\nprediction accuracy of an internet translator with word embeddings, without\nrelying on internet translators.", "published": "2017-12-29 11:46:13", "link": "http://arxiv.org/abs/1712.10190v2", "categories": ["cs.CL", "cs.IR"], "primary_category": "cs.CL"}
{"title": "Methods for Detecting Paraphrase Plagiarism", "abstract": "Paraphrase plagiarism is one of the difficult challenges facing plagiarism\ndetection systems. Paraphrasing occur when texts are lexically or syntactically\naltered to look different, but retain their original meaning. Most plagiarism\ndetection systems (many of which are commercial based) are designed to detect\nword co-occurrences and light modifications, but are unable to detect severe\nsemantic and structural alterations such as what is seen in many academic\ndocuments. Hence many paraphrase plagiarism cases go undetected. In this paper,\nwe approached the problem of paraphrase plagiarism by proposing methods for\ndetecting the most common techniques (phenomena) used in paraphrasing texts\n(namely; lexical substitution, insertion/deletion and word and phrase\nreordering), and combined the methods into a paraphrase detection model. We\nevaluated our proposed methods and model on collections containing paraphrase\ntexts. Experimental results show significant improvement in performance when\nthe methods were combined (the proposed model) as opposed to running them\nindividually. The results also show that the proposed paraphrase detection\nmodel outperformed a standard baseline (based on greedy string tilling), and\nprevious studies.", "published": "2017-12-29 18:53:12", "link": "http://arxiv.org/abs/1712.10309v1", "categories": ["cs.IR", "cs.CL"], "primary_category": "cs.IR"}
{"title": "Spectral analysis for nonstationary audio", "abstract": "A new approach for the analysis of nonstationary signals is proposed, with a\nfocus on audio applications. Following earlier contributions, nonstationarity\nis modeled via stationarity-breaking operators acting on Gaussian stationary\nrandom signals. The focus is on time warping and amplitude modulation, and an\napproximate maximum-likelihood approach based on suitable approximations in the\nwavelet transform domain is developed. This paper provides theoretical analysis\nof the approximations, and introduces JEFAS, a corresponding estimation\nalgorithm. The latter is tested and validated on synthetic as well as real\naudio signal.", "published": "2017-12-29 15:12:28", "link": "http://arxiv.org/abs/1712.10252v3", "categories": ["eess.AS", "cs.SD", "math.ST", "stat.TH"], "primary_category": "eess.AS"}
