{"title": "A Corpus of Deep Argumentative Structures as an Explanation to\n  Argumentative Relations", "abstract": "In this paper, we compose a new task for deep argumentative structure\nanalysis that goes beyond shallow discourse structure analysis. The idea is\nthat argumentative relations can reasonably be represented with a small set of\npredefined patterns. For example, using value judgment and bipolar causality,\nwe can explain a support relation between two argumentative segments as\nfollows: Segment 1 states that something is good, and Segment 2 states that it\nis good because it promotes something good when it happens. We are motivated by\nthe following questions: (i) how do we formulate the task?, (ii) can a\nreasonable pattern set be created?, and (iii) do the patterns work? To examine\nthe task feasibility, we conduct a three-stage, detailed annotation study using\n357 argumentative relations from the argumentative microtext corpus, a small,\nbut highly reliable corpus. We report the coverage of explanations captured by\nour patterns on a test set composed of 270 relations. Our coverage result of\n74.6% indicates that argumentative relations can reasonably be explained by our\nsmall pattern set. Our agreement result of 85.9% shows that a reasonable\ninter-annotator agreement can be achieved. To assist with future work in\ncomputational argumentation, the annotated corpus is made publicly available.", "published": "2017-12-07 03:17:51", "link": "http://arxiv.org/abs/1712.02480v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Hungarian Layer: Logics Empowered Neural Architecture", "abstract": "Neural architecture is a purely numeric framework, which fits the data as a\ncontinuous function. However, lacking of logic flow (e.g. \\textit{if, for,\nwhile}), traditional algorithms (e.g. \\textit{Hungarian algorithm, A$^*$\nsearching, decision tress algorithm}) could not be embedded into this paradigm,\nwhich limits the theories and applications. In this paper, we reform the\ncalculus graph as a dynamic process, which is guided by logic flow. Within our\nnovel methodology, traditional algorithms could empower numerical neural\nnetwork. Specifically, regarding the subject of sentence matching, we\nreformulate this issue as the form of task-assignment, which is solved by\nHungarian algorithm. First, our model applies BiLSTM to parse the sentences.\nThen Hungarian layer aligns the matching positions. Last, we transform the\nmatching results for soft-max regression by another BiLSTM. Extensive\nexperiments show that our model outperforms other state-of-the-art baselines\nsubstantially.", "published": "2017-12-07 10:02:56", "link": "http://arxiv.org/abs/1712.02555v3", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Effective Neural Solution for Multi-Criteria Word Segmentation", "abstract": "We present a simple yet elegant solution to train a single joint model on\nmulti-criteria corpora for Chinese Word Segmentation (CWS). Our novel design\nrequires no private layers in model architecture, instead, introduces two\nartificial tokens at the beginning and ending of input sentence to specify the\nrequired target criteria. The rest of the model including Long Short-Term\nMemory (LSTM) layer and Conditional Random Fields (CRFs) layer remains\nunchanged and is shared across all datasets, keeping the size of parameter\ncollection minimal and constant. On Bakeoff 2005 and Bakeoff 2008 datasets, our\ninnovative design has surpassed both single-criterion and multi-criteria\nstate-of-the-art learning results. To the best knowledge, our design is the\nfirst one that has achieved the latest high performance on such large scale\ndatasets. Source codes and corpora of this paper are available on GitHub.", "published": "2017-12-07 20:48:15", "link": "http://arxiv.org/abs/1712.02856v2", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "A Deep Network Model for Paraphrase Detection in Short Text Messages", "abstract": "This paper is concerned with paraphrase detection. The ability to detect\nsimilar sentences written in natural language is crucial for several\napplications, such as text mining, text summarization, plagiarism detection,\nauthorship authentication and question answering. Given two sentences, the\nobjective is to detect whether they are semantically identical. An important\ninsight from this work is that existing paraphrase systems perform well when\napplied on clean texts, but they do not necessarily deliver good performance\nagainst noisy texts. Challenges with paraphrase detection on user generated\nshort texts, such as Twitter, include language irregularity and noise. To cope\nwith these challenges, we propose a novel deep neural network-based approach\nthat relies on coarse-grained sentence modeling using a convolutional neural\nnetwork and a long short-term memory model, combined with a specific\nfine-grained word-level similarity matching model. Our experimental results\nshow that the proposed approach outperforms existing state-of-the-art\napproaches on user-generated noisy social media data, such as Twitter texts,\nand achieves highly competitive performance on a cleaner corpus.", "published": "2017-12-07 19:10:45", "link": "http://arxiv.org/abs/1712.02820v1", "categories": ["cs.IR", "cs.AI", "cs.CL"], "primary_category": "cs.IR"}
{"title": "End-to-End Offline Goal-Oriented Dialog Policy Learning via Policy\n  Gradient", "abstract": "Learning a goal-oriented dialog policy is generally performed offline with\nsupervised learning algorithms or online with reinforcement learning (RL).\nAdditionally, as companies accumulate massive quantities of dialog transcripts\nbetween customers and trained human agents, encoder-decoder methods have gained\npopularity as agent utterances can be directly treated as supervision without\nthe need for utterance-level annotations. However, one potential drawback of\nsuch approaches is that they myopically generate the next agent utterance\nwithout regard for dialog-level considerations. To resolve this concern, this\npaper describes an offline RL method for learning from unannotated corpora that\ncan optimize a goal-oriented policy at both the utterance and dialog level. We\nintroduce a novel reward function and use both on-policy and off-policy policy\ngradient to learn a policy offline without requiring online user interaction or\nan explicit state space definition.", "published": "2017-12-07 19:52:50", "link": "http://arxiv.org/abs/1712.02838v1", "categories": ["cs.AI", "cs.CL", "cs.LG"], "primary_category": "cs.AI"}
{"title": "On Musical Onset Detection via the S-Transform", "abstract": "Musical onset detection is a key component in any beat tracking system.\nExisting onset detection methods are based on temporal/spectral analysis, or\nmethods that integrate temporal and spectral information together with\nstatistical estimation and machine learning models. In this paper, we propose a\nmethod to localize onset components in music by using the S-transform, and\nthus, the method is purely based on temporal/spectral data. Unlike the other\nmethods based on temporal/spectral data, which usually rely short time Fourier\ntransform (STFT), our method enables effective isolation of crucial frequency\nsubbands due to the frequency dependent resolution of S-transform. Moreover,\nnumerical results show, even with less computationally intensive steps, the\nproposed method can closely resemble the performance of more resource intensive\nstatistical estimation based approaches.", "published": "2017-12-07 11:22:55", "link": "http://arxiv.org/abs/1712.02567v2", "categories": ["eess.AS", "cs.SD"], "primary_category": "eess.AS"}
