{"title": "Critical Survey of the Freely Available Arabic Corpora", "abstract": "The availability of corpora is a major factor in building natural language\nprocessing applications. However, the costs of acquiring corpora can prevent\nsome researchers from going further in their endeavours. The ease of access to\nfreely available corpora is urgent needed in the NLP research community\nespecially for language such as Arabic. Currently, there is not easy was to\naccess to a comprehensive and updated list of freely available Arabic corpora.\nWe present in this paper, the results of a recent survey conducted to identify\nthe list of the freely available Arabic corpora and language resources. Our\npreliminary results showed an initial list of 66 sources. We presents our\nfindings in the various categories studied and we provided the direct links to\nget the data when possible.", "published": "2017-02-25 05:16:15", "link": "http://arxiv.org/abs/1702.07835v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Deep Voice: Real-time Neural Text-to-Speech", "abstract": "We present Deep Voice, a production-quality text-to-speech system constructed\nentirely from deep neural networks. Deep Voice lays the groundwork for truly\nend-to-end neural speech synthesis. The system comprises five major building\nblocks: a segmentation model for locating phoneme boundaries, a\ngrapheme-to-phoneme conversion model, a phoneme duration prediction model, a\nfundamental frequency prediction model, and an audio synthesis model. For the\nsegmentation model, we propose a novel way of performing phoneme boundary\ndetection with deep neural networks using connectionist temporal classification\n(CTC) loss. For the audio synthesis model, we implement a variant of WaveNet\nthat requires fewer parameters and trains faster than the original. By using a\nneural network for each component, our system is simpler and more flexible than\ntraditional text-to-speech systems, where each component requires laborious\nfeature engineering and extensive domain expertise. Finally, we show that\ninference with our system can be performed faster than real time and describe\noptimized WaveNet inference kernels on both CPU and GPU that achieve up to 400x\nspeedups over existing implementations.", "published": "2017-02-25 03:11:04", "link": "http://arxiv.org/abs/1702.07825v2", "categories": ["cs.CL", "cs.LG", "cs.NE", "cs.SD"], "primary_category": "cs.CL"}
{"title": "Rationalization: A Neural Machine Translation Approach to Generating\n  Natural Language Explanations", "abstract": "We introduce AI rationalization, an approach for generating explanations of\nautonomous system behavior as if a human had performed the behavior. We\ndescribe a rationalization technique that uses neural machine translation to\ntranslate internal state-action representations of an autonomous agent into\nnatural language. We evaluate our technique in the Frogger game environment,\ntraining an autonomous game playing agent to rationalize its action choices\nusing natural language. A natural language training corpus is collected from\nhuman players thinking out loud as they play the game. We motivate the use of\nrationalization as an approach to explanation generation and show the results\nof two experiments evaluating the effectiveness of rationalization. Results of\nthese evaluations show that neural machine translation is able to accurately\ngenerate rationalizations that describe agent behavior, and that\nrationalizations are more satisfying to humans than other alternative methods\nof explanation.", "published": "2017-02-25 03:20:49", "link": "http://arxiv.org/abs/1702.07826v2", "categories": ["cs.AI", "cs.CL", "cs.HC", "cs.LG"], "primary_category": "cs.AI"}
