{"title": "Including Dialects and Language Varieties in Author Profiling", "abstract": "This paper presents a computational approach to author profiling taking\ngender and language variety into account. We apply an ensemble system with the\noutput of multiple linear SVM classifiers trained on character and word\n$n$-grams. We evaluate the system using the dataset provided by the organizers\nof the 2017 PAN lab on author profiling. Our approach achieved 75% average\naccuracy on gender identification on tweets written in four languages and 97%\naccuracy on language variety identification for Portuguese.", "published": "2017-07-03 16:06:16", "link": "http://arxiv.org/abs/1707.00621v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Improving LSTM-CTC based ASR performance in domains with limited\n  training data", "abstract": "This paper addresses the observed performance gap between automatic speech\nrecognition (ASR) systems based on Long Short Term Memory (LSTM) neural\nnetworks trained with the connectionist temporal classification (CTC) loss\nfunction and systems based on hybrid Deep Neural Networks (DNNs) trained with\nthe cross entropy (CE) loss function on domains with limited data. We step\nthrough a number of experiments that show incremental improvements on a\nbaseline EESEN toolkit based LSTM-CTC ASR system trained on the Librispeech\n100hr (train-clean-100) corpus. Our results show that with effective\ncombination of data augmentation and regularization, a LSTM-CTC based system\ncan exceed the performance of a strong Kaldi based baseline trained on the same\ndata.", "published": "2017-07-03 18:25:51", "link": "http://arxiv.org/abs/1707.00722v2", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Mapping the Americanization of English in Space and Time", "abstract": "As global political preeminence gradually shifted from the United Kingdom to\nthe United States, so did the capacity to culturally influence the rest of the\nworld. In this work, we analyze how the world-wide varieties of written English\nare evolving. We study both the spatial and temporal variations of vocabulary\nand spelling of English using a large corpus of geolocated tweets and the\nGoogle Books datasets corresponding to books published in the US and the UK.\nThe advantage of our approach is that we can address both standard written\nlanguage (Google Books) and the more colloquial forms of microblogging messages\n(Twitter). We find that American English is the dominant form of English\noutside the UK and that its influence is felt even within the UK borders.\nFinally, we analyze how this trend has evolved over time and the impact that\nsome cultural events have had in shaping it.", "published": "2017-07-03 23:32:55", "link": "http://arxiv.org/abs/1707.00781v2", "categories": ["cs.CL", "cond-mat.stat-mech", "cs.CY", "physics.soc-ph", "stat.AP"], "primary_category": "cs.CL"}
