{"title": "A Study of Metrics of Distance and Correlation Between Ranked Lists for\n  Compositionality Detection", "abstract": "Compositionality in language refers to how much the meaning of some phrase\ncan be decomposed into the meaning of its constituents and the way these\nconstituents are combined. Based on the premise that substitution by synonyms\nis meaning-preserving, compositionality can be approximated as the semantic\nsimilarity between a phrase and a version of that phrase where words have been\nreplaced by their synonyms. Different ways of representing such phrases exist\n(e.g., vectors [1] or language models [2]), and the choice of representation\naffects the measurement of semantic similarity.\n  We propose a new compositionality detection method that represents phrases as\nranked lists of term weights. Our method approximates the semantic similarity\nbetween two ranked list representations using a range of well-known distance\nand correlation metrics. In contrast to most state-of-the-art approaches in\ncompositionality detection, our method is completely unsupervised. Experiments\nwith a publicly available dataset of 1048 human-annotated phrases shows that,\ncompared to strong supervised baselines, our approach provides superior\nmeasurement of compositionality using any of the distance and correlation\nmetrics considered.", "published": "2017-03-10 11:58:48", "link": "http://arxiv.org/abs/1703.03640v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Comparison of SMT and RBMT; The Requirement of Hybridization for\n  Marathi-Hindi MT", "abstract": "We present in this paper our work on comparison between Statistical Machine\nTranslation (SMT) and Rule-based machine translation for translation from\nMarathi to Hindi. Rule Based systems although robust take lots of time to\nbuild. On the other hand statistical machine translation systems are easier to\ncreate, maintain and improve upon. We describe the development of a basic\nMarathi-Hindi SMT system and evaluate its performance. Through a detailed error\nanalysis, we, point out the relative strengths and weaknesses of both systems.\nEffectively, we shall see that even with a small amount of training corpus a\nstatistical machine translation system has many advantages for high quality\ndomain specific machine translation over that of a rule-based counterpart.", "published": "2017-03-10 12:59:52", "link": "http://arxiv.org/abs/1703.03666v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Coping with Construals in Broad-Coverage Semantic Annotation of\n  Adpositions", "abstract": "We consider the semantics of prepositions, revisiting a broad-coverage\nannotation scheme used for annotating all 4,250 preposition tokens in a 55,000\nword corpus of English. Attempts to apply the scheme to adpositions and case\nmarkers in other languages, as well as some problematic cases in English, have\nled us to reconsider the assumption that a preposition's lexical contribution\nis equivalent to the role/relation that it mediates. Our proposal is to embrace\nthe potential for construal in adposition use, expressing such phenomena\ndirectly at the token level to manage complexity and avoid sense proliferation.\nWe suggest a framework to represent both the scene role and the adposition's\nlexical function so they can be annotated at scale---supporting automatic,\nstatistical processing of domain-general language---and sketch how this\nrepresentation would inform a constructional analysis.", "published": "2017-03-10 17:27:38", "link": "http://arxiv.org/abs/1703.03771v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Effects of Limiting Memory Capacity on the Behaviour of Exemplar\n  Dynamics", "abstract": "Exemplar models are a popular class of models used to describe language\nchange. Here we study how limiting the memory capacity of an individual in\nthese models affects the system's behaviour. In particular we demonstrate the\neffect this change has on the extinction of categories. Previous work in\nexemplar dynamics has not addressed this question. In order to investigate\nthis, we will inspect a simplified exemplar model. We will prove for the\nsimplified model that all the sound categories but one will always become\nextinct, whether memory storage is limited or not. However, computer\nsimulations show that changing the number of stored memories alters how fast\ncategories become extinct.", "published": "2017-03-10 20:54:11", "link": "http://arxiv.org/abs/1703.03842v2", "categories": ["cs.CL", "91F20"], "primary_category": "cs.CL"}
{"title": "NetSpam: a Network-based Spam Detection Framework for Reviews in Online\n  Social Media", "abstract": "Nowadays, a big part of people rely on available content in social media in\ntheir decisions (e.g. reviews and feedback on a topic or product). The\npossibility that anybody can leave a review provide a golden opportunity for\nspammers to write spam reviews about products and services for different\ninterests. Identifying these spammers and the spam content is a hot topic of\nresearch and although a considerable number of studies have been done recently\ntoward this end, but so far the methodologies put forth still barely detect\nspam reviews, and none of them show the importance of each extracted feature\ntype. In this study, we propose a novel framework, named NetSpam, which\nutilizes spam features for modeling review datasets as heterogeneous\ninformation networks to map spam detection procedure into a classification\nproblem in such networks. Using the importance of spam features help us to\nobtain better results in terms of different metrics experimented on real-world\nreview datasets from Yelp and Amazon websites. The results show that NetSpam\noutperforms the existing methods and among four categories of features;\nincluding review-behavioral, user-behavioral, reviewlinguistic,\nuser-linguistic, the first type of features performs better than the other\ncategories.", "published": "2017-03-10 10:17:27", "link": "http://arxiv.org/abs/1703.03609v1", "categories": ["cs.SI", "cs.CL", "cs.IR", "physics.soc-ph"], "primary_category": "cs.SI"}
{"title": "Applying the Wizard-of-Oz Technique to Multimodal Human-Robot Dialogue", "abstract": "Our overall program objective is to provide more natural ways for soldiers to\ninteract and communicate with robots, much like how soldiers communicate with\nother soldiers today. We describe how the Wizard-of-Oz (WOz) method can be\napplied to multimodal human-robot dialogue in a collaborative exploration task.\nWhile the WOz method can help design robot behaviors, traditional approaches\nplace the burden of decisions on a single wizard. In this work, we consider two\nwizards to stand in for robot navigation and dialogue management software\ncomponents. The scenario used to elicit data is one in which a human-robot team\nis tasked with exploring an unknown environment: a human gives verbal\ninstructions from a remote location and the robot follows them, clarifying\npossible misunderstandings as needed via dialogue. We found the division of\nlabor between wizards to be workable, which holds promise for future software\ndevelopment.", "published": "2017-03-10 15:27:45", "link": "http://arxiv.org/abs/1703.03714v1", "categories": ["cs.CL", "cs.AI", "cs.HC", "cs.RO"], "primary_category": "cs.CL"}
