{"title": "Aspect-augmented Adversarial Networks for Domain Adaptation", "abstract": "We introduce a neural method for transfer learning between two (source and\ntarget) classification tasks or aspects over the same domain. Rather than\ntraining on target labels, we use a few keywords pertaining to source and\ntarget aspects indicating sentence relevance instead of document class labels.\nDocuments are encoded by learning to embed and softly select relevant sentences\nin an aspect-dependent manner. A shared classifier is trained on the source\nencoded documents and labels, and applied to target encoded documents. We\nensure transfer through aspect-adversarial training so that encoded documents\nare, as sets, aspect-invariant. Experimental results demonstrate that our\napproach outperforms different baselines and model variants on two datasets,\nyielding an improvement of 27% on a pathology dataset and 5% on a review\ndataset.", "published": "2017-01-01 03:04:33", "link": "http://arxiv.org/abs/1701.00188v2", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Self-Taught Convolutional Neural Networks for Short Text Clustering", "abstract": "Short text clustering is a challenging problem due to its sparseness of text\nrepresentation. Here we propose a flexible Self-Taught Convolutional neural\nnetwork framework for Short Text Clustering (dubbed STC^2), which can flexibly\nand successfully incorporate more useful semantic features and learn non-biased\ndeep text representation in an unsupervised manner. In our framework, the\noriginal raw text features are firstly embedded into compact binary codes by\nusing one existing unsupervised dimensionality reduction methods. Then, word\nembeddings are explored and fed into convolutional neural networks to learn\ndeep feature representations, meanwhile the output units are used to fit the\npre-trained binary codes in the training process. Finally, we get the optimal\nclusters by employing K-means to cluster the learned representations. Extensive\nexperimental results demonstrate that the proposed framework is effective,\nflexible and outperform several popular clustering methods when tested on three\npublic short text datasets.", "published": "2017-01-01 01:57:59", "link": "http://arxiv.org/abs/1701.00185v1", "categories": ["cs.IR", "cs.CL"], "primary_category": "cs.IR"}
{"title": "Integrating sentiment and social structure to determine preference\n  alignments: The Irish Marriage Referendum", "abstract": "We examine the relationship between social structure and sentiment through\nthe analysis of a large collection of tweets about the Irish Marriage\nReferendum of 2015. We obtain the sentiment of every tweet with the hashtags\n#marref and #marriageref that was posted in the days leading to the referendum,\nand construct networks to aggregate sentiment and use it to study the\ninteractions among users. Our results show that the sentiment of mention tweets\nposted by users is correlated with the sentiment of received mentions, and\nthere are significantly more connections between users with similar sentiment\nscores than among users with opposite scores in the mention and follower\nnetworks. We combine the community structure of the two networks with the\nactivity level of the users and sentiment scores to find groups of users who\nsupport voting `yes' or `no' in the referendum. There were numerous\nconversations between users on opposing sides of the debate in the absence of\nfollower connections, which suggests that there were efforts by some users to\nestablish dialogue and debate across ideological divisions. Our analysis shows\nthat social structure can be integrated successfully with sentiment to analyse\nand understand the disposition of social media users. These results have\npotential applications in the integration of data and meta-data to study\nopinion dynamics, public opinion modelling, and polling.", "published": "2017-01-01 20:54:52", "link": "http://arxiv.org/abs/1701.00289v2", "categories": ["cs.SI", "cs.CL", "cs.IR", "physics.soc-ph"], "primary_category": "cs.SI"}
