{"title": "Winning on the Merits: The Joint Effects of Content and Style on Debate\n  Outcomes", "abstract": "Debate and deliberation play essential roles in politics and government, but\nmost models presume that debates are won mainly via superior style or agenda\ncontrol. Ideally, however, debates would be won on the merits, as a function of\nwhich side has the stronger arguments. We propose a predictive model of debate\nthat estimates the effects of linguistic features and the latent persuasive\nstrengths of different topics, as well as the interactions between the two.\nUsing a dataset of 118 Oxford-style debates, our model's combination of content\n(as latent topics) and style (as linguistic features) allows us to predict\naudience-adjudicated winners with 74% accuracy, significantly outperforming\nlinguistic features alone (66%). Our model finds that winning sides employ\nstronger arguments, and allows us to identify the linguistic features\nassociated with strong or weak arguments.", "published": "2017-05-15 00:21:03", "link": "http://arxiv.org/abs/1705.05040v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Representation learning of drug and disease terms for drug repositioning", "abstract": "Drug repositioning (DR) refers to identification of novel indications for the\napproved drugs. The requirement of huge investment of time as well as money and\nrisk of failure in clinical trials have led to surge in interest in drug\nrepositioning. DR exploits two major aspects associated with drugs and\ndiseases: existence of similarity among drugs and among diseases due to their\nshared involved genes or pathways or common biological effects. Existing\nmethods of identifying drug-disease association majorly rely on the information\navailable in the structured databases only. On the other hand, abundant\ninformation available in form of free texts in biomedical research articles are\nnot being fully exploited. Word-embedding or obtaining vector representation of\nwords from a large corpora of free texts using neural network methods have been\nshown to give significant performance for several natural language processing\ntasks. In this work we propose a novel way of representation learning to obtain\nfeatures of drugs and diseases by combining complementary information available\nin unstructured texts and structured datasets. Next we use matrix completion\napproach on these feature vectors to learn projection matrix between drug and\ndisease vector spaces. The proposed method has shown competitive performance\nwith state-of-the-art methods. Further, the case studies on Alzheimer's and\nHypertension diseases have shown that the predicted associations are matching\nwith the existing knowledge.", "published": "2017-05-15 12:29:52", "link": "http://arxiv.org/abs/1705.05183v2", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Key-Value Retrieval Networks for Task-Oriented Dialogue", "abstract": "Neural task-oriented dialogue systems often struggle to smoothly interface\nwith a knowledge base. In this work, we seek to address this problem by\nproposing a new neural dialogue agent that is able to effectively sustain\ngrounded, multi-domain discourse through a novel key-value retrieval mechanism.\nThe model is end-to-end differentiable and does not need to explicitly model\ndialogue state or belief trackers. We also release a new dataset of 3,031\ndialogues that are grounded through underlying knowledge bases and span three\ndistinct tasks in the in-car personal assistant space: calendar scheduling,\nweather information retrieval, and point-of-interest navigation. Our\narchitecture is simultaneously trained on data from all domains and\nsignificantly outperforms a competitive rule-based system and other existing\nneural dialogue architectures on the provided domains according to both\nautomatic and human evaluation metrics.", "published": "2017-05-15 19:11:12", "link": "http://arxiv.org/abs/1705.05414v2", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Using Titles vs. Full-text as Source for Automated Semantic Document\n  Annotation", "abstract": "A significant part of the largest Knowledge Graph today, the Linked Open Data\ncloud, consists of metadata about documents such as publications, news reports,\nand other media articles. While the widespread access to the document metadata\nis a tremendous advancement, it is yet not so easy to assign semantic\nannotations and organize the documents along semantic concepts. Providing\nsemantic annotations like concepts in SKOS thesauri is a classical research\ntopic, but typically it is conducted on the full-text of the documents. For the\nfirst time, we offer a systematic comparison of classification approaches to\ninvestigate how far semantic annotations can be conducted using just the\nmetadata of the documents such as titles published as labels on the Linked Open\nData cloud. We compare the classifications obtained from analyzing the\ndocuments' titles with semantic annotations obtained from analyzing the\nfull-text. Apart from the prominent text classification baselines kNN and SVM,\nwe also compare recent techniques of Learning to Rank and neural networks and\nrevisit the traditional methods logistic regression, Rocchio, and Naive Bayes.\nThe results show that across three of our four datasets, the performance of the\nclassifications using only titles reaches over 90% of the quality compared to\nthe classification performance when using the full-text. Thus, conducting\ndocument classification by just using the titles is a reasonable approach for\nautomated semantic annotation and opens up new possibilities for enriching\nKnowledge Graphs.", "published": "2017-05-15 16:07:35", "link": "http://arxiv.org/abs/1705.05311v2", "categories": ["cs.DL", "cs.CL"], "primary_category": "cs.DL"}
{"title": "Understanding MIDI: A Painless Tutorial on Midi Format", "abstract": "A short overview demystifying the midi audio format is presented. The goal is\nto explain the file structure and how the instructions are used to produce a\nmusic signal, both in the case of monophonic signals as for polyphonic signals.", "published": "2017-05-15 16:34:20", "link": "http://arxiv.org/abs/1705.05322v1", "categories": ["cs.SD", "eess.AS", "H.5.5"], "primary_category": "cs.SD"}
