{"title": "Scaffolding Networks: Incremental Learning and Teaching Through\n  Questioning", "abstract": "We introduce a new paradigm of learning for reasoning, understanding, and\nprediction, as well as the scaffolding network to implement this paradigm. The\nscaffolding network embodies an incremental learning approach that is\nformulated as a teacher-student network architecture to teach machines how to\nunderstand text and do reasoning. The key to our computational scaffolding\napproach is the interactions between the teacher and the student through\nsequential questioning. The student observes each sentence in the text\nincrementally, and it uses an attention-based neural net to discover and\nregister the key information in relation to its current memory. Meanwhile, the\nteacher asks questions about the observed text, and the student network gets\nrewarded by correctly answering these questions. The entire network is updated\ncontinually using reinforcement learning. Our experimental results on synthetic\nand real datasets show that the scaffolding network not only outperforms\nstate-of-the-art methods but also learns to do reasoning in a scalable way even\nwith little human generated input.", "published": "2017-02-28 05:43:10", "link": "http://arxiv.org/abs/1702.08653v2", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "A Joint Identification Approach for Argumentative Writing Revisions", "abstract": "Prior work on revision identification typically uses a pipeline method:\nrevision extraction is first conducted to identify the locations of revisions\nand revision classification is then conducted on the identified revisions. Such\na setting propagates the errors of the revision extraction step to the revision\nclassification step. This paper proposes an approach that identifies the\nrevision location and the revision type jointly to solve the issue of error\npropagation. It utilizes a sequence representation of revisions and conducts\nsequence labeling for revision identification. A mutation-based approach is\nutilized to update identification sequences. Results demonstrate that our\nproposed approach yields better performance on both revision location\nextraction and revision type classification compared to a pipeline baseline.", "published": "2017-02-28 23:54:57", "link": "http://arxiv.org/abs/1703.00089v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "SceneSeer: 3D Scene Design with Natural Language", "abstract": "Designing 3D scenes is currently a creative task that requires significant\nexpertise and effort in using complex 3D design interfaces. This effortful\ndesign process starts in stark contrast to the easiness with which people can\nuse language to describe real and imaginary environments. We present SceneSeer:\nan interactive text to 3D scene generation system that allows a user to design\n3D scenes using natural language. A user provides input text from which we\nextract explicit constraints on the objects that should appear in the scene.\nGiven these explicit constraints, the system then uses a spatial knowledge base\nlearned from an existing database of 3D scenes and 3D object models to infer an\narrangement of the objects forming a natural scene matching the input\ndescription. Using textual commands the user can then iteratively refine the\ncreated scene by adding, removing, replacing, and manipulating objects. We\nevaluate the quality of 3D scenes generated by SceneSeer in a perceptual\nevaluation experiment where we compare against manually designed scenes and\nsimpler baselines for 3D scene generation. We demonstrate how the generated\nscenes can be iteratively refined through simple natural language commands.", "published": "2017-02-28 20:47:47", "link": "http://arxiv.org/abs/1703.00050v1", "categories": ["cs.GR", "cs.CL", "cs.HC"], "primary_category": "cs.GR"}
