{"title": "Evolution of holonic control architectures towards Industry 4.0: A short overview", "abstract": "The flexibility claimed by the next generation production systems induces a deep modification of the behavior and the core itself of the control systems. Overconnectivity and data management abilities targeted by Industry 4.0 paradigm enable the emergence of more flexible and reactive control systems, based on the cooperation of autonomous and connected entities in the decision making process. For the last 20 years, holonic paradigm has become the core paradigm of those evolutions, and evolved in itself. This contribution aims at emphasizing the conceptual evolutions in the application of holonic paradigm in the control architectures of manufacturing systems and highlighting the current research trends in this field.", "published": "2018-10-22 06:49:57", "link": "http://arxiv.org/abs/1810.09109v1", "categories": ["cs.MA"], "primary_category": "cs.MA"}
{"title": "Multi-Agent Actor-Critic with Generative Cooperative Policy Network", "abstract": "We propose an efficient multi-agent reinforcement learning approach to derive equilibrium strategies for multi-agents who are participating in a Markov game. Mainly, we are focused on obtaining decentralized policies for agents to maximize the performance of a collaborative task by all the agents, which is similar to solving a decentralized Markov decision process. We propose to use two different policy networks: (1) decentralized greedy policy network used to generate greedy action during training and execution period and (2) generative cooperative policy network (GCPN) used to generate action samples to make other agents improve their objectives during training period. We show that the samples generated by GCPN enable other agents to explore the policy space more effectively and favorably to reach a better policy in terms of achieving the collaborative tasks.", "published": "2018-10-22 12:24:11", "link": "http://arxiv.org/abs/1810.09206v1", "categories": ["cs.MA", "cs.AI"], "primary_category": "cs.MA"}
{"title": "Quantifying the Model Risk Inherent in the Calibration and Recalibration of Option Pricing Models", "abstract": "We focus on two particular aspects of model risk: the inability of a chosen model to fit observed market prices at a given point in time (calibration error) and the model risk due to recalibration of model parameters (in contradiction to the model assumptions). In this context, we follow the approach of Glasserman and Xu (2014) and use relative entropy as a pre-metric in order to quantify these two sources of model risk in a common framework, and consider the trade-offs between them when choosing a model and the frequency with which to recalibrate to the market. We illustrate this approach applied to the models of Black and Scholes (1973) and Heston (1993), using option data for Apple (AAPL) and Google (GOOG). We find that recalibrating a model more frequently simply shifts model risk from one type to another, without any substantial reduction of aggregate model risk. Furthermore, moving to a more complicated stochastic model is seen to be counterproductive if one requires a high degree of robustness, for example as quantified by a 99 percent quantile of aggregate model risk.", "published": "2018-10-22 07:02:45", "link": "http://arxiv.org/abs/1810.09112v1", "categories": ["q-fin.RM", "q-fin.CP", "q-fin.MF"], "primary_category": "q-fin.RM"}
