{"title": "Deep learning for affective computing: text-based emotion recognition in\n  decision support", "abstract": "Emotions widely affect human decision-making. This fact is taken into account\nby affective computing with the goal of tailoring decision support to the\nemotional states of individuals. However, the accurate recognition of emotions\nwithin narrative documents presents a challenging undertaking due to the\ncomplexity and ambiguity of language. Performance improvements can be achieved\nthrough deep learning; yet, as demonstrated in this paper, the specific nature\nof this task requires the customization of recurrent neural networks with\nregard to bidirectional processing, dropout layers as a means of\nregularization, and weighted loss functions. In addition, we propose\nsent2affect, a tailored form of transfer learning for affective computing: here\nthe network is pre-trained for a different task (i.e. sentiment analysis),\nwhile the output layer is subsequently tuned to the task of emotion\nrecognition. The resulting performance is evaluated in a holistic setting\nacross 6 benchmark datasets, where we find that both recurrent neural networks\nand transfer learning consistently outperform traditional machine learning.\nAltogether, the findings have considerable implications for the use of\naffective computing.", "published": "2018-03-16 21:05:13", "link": "http://arxiv.org/abs/1803.06397v6", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "A Meaning-based Statistical English Math Word Problem Solver", "abstract": "We introduce MeSys, a meaning-based approach, for solving English math word\nproblems (MWPs) via understanding and reasoning in this paper. It first\nanalyzes the text, transforms both body and question parts into their\ncorresponding logic forms, and then performs inference on them. The associated\ncontext of each quantity is represented with proposed role-tags (e.g., nsubj,\nverb, etc.), which provides the flexibility for annotating an extracted math\nquantity with its associated context information (i.e., the physical meaning of\nthis quantity). Statistical models are proposed to select the operator and\noperands. A noisy dataset is designed to assess if a solver solves MWPs mainly\nvia understanding or mechanical pattern matching. Experimental results show\nthat our approach outperforms existing systems on both benchmark datasets and\nthe noisy dataset, which demonstrates that the proposed approach understands\nthe meaning of each quantity in the text more.", "published": "2018-03-16 03:07:06", "link": "http://arxiv.org/abs/1803.06064v2", "categories": ["cs.AI", "cs.CL"], "primary_category": "cs.AI"}
{"title": "Joint Recognition of Handwritten Text and Named Entities with a Neural\n  End-to-end Model", "abstract": "When extracting information from handwritten documents, text transcription\nand named entity recognition are usually faced as separate subsequent tasks.\nThis has the disadvantage that errors in the first module affect heavily the\nperformance of the second module. In this work we propose to do both tasks\njointly, using a single neural network with a common architecture used for\nplain text recognition. Experimentally, the work has been tested on a\ncollection of historical marriage records. Results of experiments are presented\nto show the effect on the performance for different configurations: different\nways of encoding the information, doing or not transfer learning and processing\nat text line or multi-line region level. The results are comparable to state of\nthe art reported in the ICDAR 2017 Information Extraction competition, even\nthough the proposed technique does not use any dictionaries, language modeling\nor post processing.", "published": "2018-03-16 14:47:58", "link": "http://arxiv.org/abs/1803.06252v2", "categories": ["cs.CV", "cs.CL"], "primary_category": "cs.CV"}
{"title": "Corpus Statistics in Text Classification of Online Data", "abstract": "Transformation of Machine Learning (ML) from a boutique science to a\ngenerally accepted technology has increased importance of reproduction and\ntransportability of ML studies. In the current work, we investigate how corpus\ncharacteristics of textual data sets correspond to text classification results.\nWe work with two data sets gathered from sub-forums of an online health-related\nforum. Our empirical results are obtained for a multi-class sentiment analysis\napplication.", "published": "2018-03-16 20:19:56", "link": "http://arxiv.org/abs/1803.06390v1", "categories": ["cs.CL", "cs.IR", "cs.LG", "68T05, 68T50"], "primary_category": "cs.CL"}
{"title": "Tensor2Tensor for Neural Machine Translation", "abstract": "Tensor2Tensor is a library for deep learning models that is well-suited for\nneural machine translation and includes the reference implementation of the\nstate-of-the-art Transformer model.", "published": "2018-03-16 18:49:22", "link": "http://arxiv.org/abs/1803.07416v1", "categories": ["cs.LG", "cs.CL", "stat.ML"], "primary_category": "cs.LG"}
