{"title": "Character-Level Feature Extraction with Densely Connected Networks", "abstract": "Generating character-level features is an important step for achieving good\nresults in various natural language processing tasks. To alleviate the need for\nhuman labor in generating hand-crafted features, methods that utilize neural\narchitectures such as Convolutional Neural Network (CNN) or Recurrent Neural\nNetwork (RNN) to automatically extract such features have been proposed and\nhave shown great results. However, CNN generates position-independent features,\nand RNN is slow since it needs to process the characters sequentially. In this\npaper, we propose a novel method of using a densely connected network to\nautomatically extract character-level features. The proposed method does not\nrequire any language or task specific assumptions, and shows robustness and\neffectiveness while being faster than CNN- or RNN-based methods. Evaluating\nthis method on three sequence labeling tasks - slot tagging, Part-of-Speech\n(POS) tagging, and Named-Entity Recognition (NER) - we obtain state-of-the-art\nperformance with a 96.62 F1-score and 97.73% accuracy on slot tagging and POS\ntagging, respectively, and comparable performance to the state-of-the-art 91.13\nF1-score on NER.", "published": "2018-06-24 05:54:45", "link": "http://arxiv.org/abs/1806.09089v2", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Modeling Multi-turn Conversation with Deep Utterance Aggregation", "abstract": "Multi-turn conversation understanding is a major challenge for building\nintelligent dialogue systems. This work focuses on retrieval-based response\nmatching for multi-turn conversation whose related work simply concatenates the\nconversation utterances, ignoring the interactions among previous utterances\nfor context modeling. In this paper, we formulate previous utterances into\ncontext using a proposed deep utterance aggregation model to form a\nfine-grained context representation. In detail, a self-matching attention is\nfirst introduced to route the vital information in each utterance. Then the\nmodel matches a response with each refined utterance and the final matching\nscore is obtained after attentive turns aggregation. Experimental results show\nour model outperforms the state-of-the-art methods on three multi-turn\nconversation benchmarks, including a newly introduced e-commerce dialogue\ncorpus.", "published": "2018-06-24 08:15:54", "link": "http://arxiv.org/abs/1806.09102v2", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Subword-augmented Embedding for Cloze Reading Comprehension", "abstract": "Representation learning is the foundation of machine reading comprehension.\nIn state-of-the-art models, deep learning methods broadly use word and\ncharacter level representations. However, character is not naturally the\nminimal linguistic unit. In addition, with a simple concatenation of character\nand word embedding, previous models actually give suboptimal solution. In this\npaper, we propose to use subword rather than character for word embedding\nenhancement. We also empirically explore different augmentation strategies on\nsubword-augmented embedding to enhance the cloze-style reading comprehension\nmodel reader. In detail, we present a reader that uses subword-level\nrepresentation to augment word embedding with a short list to handle rare words\neffectively. A thorough examination is conducted to evaluate the comprehensive\nperformance and generalization ability of the proposed reader. Experimental\nresults show that the proposed approach helps the reader significantly\noutperform the state-of-the-art baselines on various public datasets.", "published": "2018-06-24 08:18:12", "link": "http://arxiv.org/abs/1806.09103v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "One-shot Learning for Question-Answering in Gaokao History Challenge", "abstract": "Answering questions from university admission exams (Gaokao in Chinese) is a\nchallenging AI task since it requires effective representation to capture\ncomplicated semantic relations between questions and answers. In this work, we\npropose a hybrid neural model for deep question-answering task from history\nexaminations. Our model employs a cooperative gated neural network to retrieve\nanswers with the assistance of extra labels given by a neural turing machine\nlabeler. Empirical study shows that the labeler works well with only a small\ntraining dataset and the gated mechanism is good at fetching the semantic\nrepresentation of lengthy answers. Experiments on question answering\ndemonstrate the proposed model obtains substantial performance gains over\nvarious neural model baselines in terms of multiple evaluation metrics.", "published": "2018-06-24 08:36:23", "link": "http://arxiv.org/abs/1806.09105v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "DARTS: Differentiable Architecture Search", "abstract": "This paper addresses the scalability challenge of architecture search by\nformulating the task in a differentiable manner. Unlike conventional approaches\nof applying evolution or reinforcement learning over a discrete and\nnon-differentiable search space, our method is based on the continuous\nrelaxation of the architecture representation, allowing efficient search of the\narchitecture using gradient descent. Extensive experiments on CIFAR-10,\nImageNet, Penn Treebank and WikiText-2 show that our algorithm excels in\ndiscovering high-performance convolutional architectures for image\nclassification and recurrent architectures for language modeling, while being\norders of magnitude faster than state-of-the-art non-differentiable techniques.\nOur implementation has been made publicly available to facilitate further\nresearch on efficient architecture search algorithms.", "published": "2018-06-24 00:06:13", "link": "http://arxiv.org/abs/1806.09055v2", "categories": ["cs.LG", "cs.CL", "cs.CV", "stat.ML"], "primary_category": "cs.LG"}
{"title": "Balanced News Using Constrained Bandit-based Personalization", "abstract": "We present a prototype for a news search engine that presents balanced\nviewpoints across liberal and conservative articles with the goal of\nde-polarizing content and allowing users to escape their filter bubble. The\nbalancing is done according to flexible user-defined constraints, and leverages\nrecent advances in constrained bandit optimization. We showcase our balanced\nnews feed by displaying it side-by-side with the news feed produced by a\ntraditional (polarized) feed.", "published": "2018-06-24 20:02:25", "link": "http://arxiv.org/abs/1806.09202v1", "categories": ["cs.CY", "cs.CL", "cs.SI"], "primary_category": "cs.CY"}
{"title": "Perceptually Relevant Preservation of Interaural Time Differences in\n  Binaural Hearing Aids", "abstract": "This work presents a noise reduction method with perceptually relevant\npreservation of the interaural time difference (ITD) of the residual noise in\nbinaural hearing aids. The interaural coherence (IC) concept, previously\napplied to the Multichannel Wiener Filter (MWF) for preservation of the spatial\nsubjective sensation of diffuse noise fields, is proposed here to both preserve\nand emphasize the ITD binaural cues of a directional acoustic noise source. It\nis demonstrated that the previously developed MWF-ITD technique may decrease\nthe original IC magnitude of the processed noise, consequently increasing the\nvariance of the interaural phase difference (IPD) of the output signals. It is\nshown that the MWF-IC technique concomitantly minimizes a nonlinear function of\nthe difference between input and output IPD, which is strictly related to ITD,\nand preserves the natural coherence of the directional noise captured by the\nreference microphones. Objective measures and psychoacoustic experiments\ncorroborate the theoretical findings, showing the MWF-IC technique provides\nrelevant noise reduction, while preserving the original ITD subjective\nperception and original lateralization for a directional noise source. These\nresults are especially relevant for hearing aid designers, since they indicate\nthe MWF-IC as a noise reduction technique that provides resid-ual noise spatial\npreservation for both diffuse and directional noise sources in frequencies\nbelow 1.5 kHz.", "published": "2018-06-24 15:53:33", "link": "http://arxiv.org/abs/1806.09169v1", "categories": ["eess.AS", "cs.SD"], "primary_category": "eess.AS"}
