{"title": "Joint Learning of Domain Classification and Out-of-Domain Detection with\n  Dynamic Class Weighting for Satisficing False Acceptance Rates", "abstract": "In domain classification for spoken dialog systems, correct detection of\nout-of-domain (OOD) utterances is crucial because it reduces confusion and\nunnecessary interaction costs between users and the systems. Previous work\nusually utilizes OOD detectors that are trained separately from in-domain (IND)\nclassifiers, and confidence thresholding for OOD detection given target\nevaluation scores. In this paper, we introduce a neural joint learning model\nfor domain classification and OOD detection, where dynamic class weighting is\nused during the model training to satisfice a given OOD false acceptance rate\n(FAR) while maximizing the domain classification accuracy. Evaluating on two\ndomain classification tasks for the utterances from a large spoken dialogue\nsystem, we show that our approach significantly improves the domain\nclassification performance with satisficing given target FARs.", "published": "2018-06-29 21:27:05", "link": "http://arxiv.org/abs/1807.00072v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Neural Machine Translation with Key-Value Memory-Augmented Attention", "abstract": "Although attention-based Neural Machine Translation (NMT) has achieved\nremarkable progress in recent years, it still suffers from issues of repeating\nand dropping translations. To alleviate these issues, we propose a novel\nkey-value memory-augmented attention model for NMT, called KVMEMATT.\nSpecifically, we maintain a timely updated keymemory to keep track of attention\nhistory and a fixed value-memory to store the representation of source sentence\nthroughout the whole translation process. Via nontrivial transformations and\niterative interactions between the two memories, the decoder focuses on more\nappropriate source word(s) for predicting the next target word at each decoding\nstep, therefore can improve the adequacy of translations. Experimental results\non Chinese=>English and WMT17 German<=>English translation tasks demonstrate\nthe superiority of the proposed model.", "published": "2018-06-29 02:06:00", "link": "http://arxiv.org/abs/1806.11249v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Bias in Semantic and Discourse Interpretation", "abstract": "In this paper, we show how game-theoretic work on conversation combined with\na theory of discourse structure provides a framework for studying interpretive\nbias. Interpretive bias is an essential feature of learning and understanding\nbut also something that can be used to pervert or subvert the truth. The\nframework we develop here provides tools for understanding and analyzing the\nrange of interpretive biases and the factors that contribute to them.", "published": "2018-06-29 09:51:26", "link": "http://arxiv.org/abs/1806.11322v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Using General Adversarial Networks for Marketing: A Case Study of Airbnb", "abstract": "In this paper, we examine the use case of general adversarial networks (GANs)\nin the field of marketing. In particular, we analyze how GAN models can\nreplicate text patterns from successful product listings on Airbnb, a\npeer-to-peer online market for short-term apartment rentals. To do so, we\ndefine the Diehl-Martinez-Kamalu (DMK) loss function as a new class of\nfunctions that forces the model's generated output to include a set of\nuser-defined keywords. This allows the general adversarial network to recommend\na way of rewording the phrasing of a listing description to increase the\nlikelihood that it is booked. Although we tailor our analysis to Airbnb data,\nwe believe this framework establishes a more general model for how generative\nalgorithms can be used to produce text samples for the purposes of marketing.", "published": "2018-06-29 14:19:20", "link": "http://arxiv.org/abs/1806.11432v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Investigating Speech Features for Continuous Turn-Taking Prediction\n  Using LSTMs", "abstract": "For spoken dialog systems to conduct fluid conversational interactions with\nusers, the systems must be sensitive to turn-taking cues produced by a user.\nModels should be designed so that effective decisions can be made as to when it\nis appropriate, or not, for the system to speak. Traditional end-of-turn\nmodels, where decisions are made at utterance end-points, are limited in their\nability to model fast turn-switches and overlap. A more flexible approach is to\nmodel turn-taking in a continuous manner using RNNs, where the system predicts\nspeech probability scores for discrete frames within a future window. The\ncontinuous predictions represent generalized turn-taking behaviors observed in\nthe training data and can be applied to make decisions that are not just\nlimited to end-of-turn detection. In this paper, we investigate optimal\nspeech-related feature sets for making predictions at pauses and overlaps in\nconversation. We find that while traditional acoustic features perform well,\npart-of-speech features generally perform worse than word features. We show\nthat our current models outperform previously reported baselines.", "published": "2018-06-29 15:07:17", "link": "http://arxiv.org/abs/1806.11461v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Fake News Identification on Twitter with Hybrid CNN and RNN Models", "abstract": "The problem associated with the propagation of fake news continues to grow at\nan alarming scale. This trend has generated much interest from politics to\nacademia and industry alike. We propose a framework that detects and classifies\nfake news messages from Twitter posts using hybrid of convolutional neural\nnetworks and long-short term recurrent neural network models. The proposed work\nusing this deep learning approach achieves 82% accuracy. Our approach\nintuitively identifies relevant features associated with fake news stories\nwithout previous knowledge of the domain.", "published": "2018-06-29 09:36:46", "link": "http://arxiv.org/abs/1806.11316v1", "categories": ["cs.SI", "cs.CL"], "primary_category": "cs.SI"}
{"title": "Counting to Explore and Generalize in Text-based Games", "abstract": "We propose a recurrent RL agent with an episodic exploration mechanism that\nhelps discovering good policies in text-based game environments. We show\npromising results on a set of generated text-based games of varying difficulty\nwhere the goal is to collect a coin located at the end of a chain of rooms. In\ncontrast to previous text-based RL approaches, we observe that our agent learns\npolicies that generalize to unseen games of greater difficulty.", "published": "2018-06-29 16:40:29", "link": "http://arxiv.org/abs/1806.11525v2", "categories": ["cs.CL", "cs.LG"], "primary_category": "cs.CL"}
{"title": "Discourse-Wizard: Discovering Deep Discourse Structure in your\n  Conversation with RNNs", "abstract": "Spoken language understanding is one of the key factors in a dialogue system,\nand a context in a conversation plays an important role to understand the\ncurrent utterance. In this work, we demonstrate the importance of context\nwithin the dialogue for neural network models through an online web interface\nlive demo. We developed two different neural models: a model that does not use\ncontext and a context-based model. The no-context model classifies dialogue\nacts at an utterance-level whereas the context-based model takes some preceding\nutterances into account. We make these trained neural models available as a\nlive demo called Discourse-Wizard using a modular server architecture. The live\ndemo provides an easy to use interface for conversational analysis and for\ndiscovering deep discourse structures in a conversation.", "published": "2018-06-29 14:02:04", "link": "http://arxiv.org/abs/1806.11420v1", "categories": ["cs.CL", "cs.HC", "cs.LG", "cs.NE"], "primary_category": "cs.CL"}
{"title": "TextWorld: A Learning Environment for Text-based Games", "abstract": "We introduce TextWorld, a sandbox learning environment for the training and\nevaluation of RL agents on text-based games. TextWorld is a Python library that\nhandles interactive play-through of text games, as well as backend functions\nlike state tracking and reward assignment. It comes with a curated list of\ngames whose features and challenges we have analyzed. More significantly, it\nenables users to handcraft or automatically generate new games. Its generative\nmechanisms give precise control over the difficulty, scope, and language of\nconstructed games, and can be used to relax challenges inherent to commercial\ntext games like partial observability and sparse rewards. By generating sets of\nvaried but similar games, TextWorld can also be used to study generalization\nand transfer learning. We cast text-based games in the Reinforcement Learning\nformalism, use our framework to develop a set of benchmark games, and evaluate\nseveral baseline agents on this set and the curated list.", "published": "2018-06-29 16:56:07", "link": "http://arxiv.org/abs/1806.11532v2", "categories": ["cs.LG", "cs.CL", "stat.ML"], "primary_category": "cs.LG"}
{"title": "Exploratory Analysis of a Large Flamenco Corpus using an Ensemble of\n  Convolutional Neural Networks as a Structural Annotation Backend", "abstract": "We present computational tools that we developed for the analysis of a large\ncorpus of flamenco music recordings, along with the related exploratory\nfindings. The proposed computational backend is based on a set of Convolutional\nNeural Networks that provide the structural annotation of each music recording\nwith respect to the presence of vocals, guitar and hand-clapping (\"palmas\").\nThe resulting, automatically extracted annotations, allowed for the\nvisualization of music recordings in structurally meaningful ways, the\nextraction of global statistics related to the instrumentation of flamenco\nmusic, the detection of a cappella and instrumental recordings for which no\nsuch information existed, the investigation of differences in structure and\ninstrumentation across styles and the study of tonality across instrumentation\nand styles. The reported findings show that it is feasible to perform a large\nscale analysis of flamenco music with state-of-the-art classification\ntechnology and produce automatically extracted descriptors that are both\nmusicologically valid and useful, in the sense that they can enhance\nconventional metadata schemes and assist bridging the semantic gap between\naudio recordings and high-level musicological concepts.", "published": "2018-06-29 21:05:19", "link": "http://arxiv.org/abs/1807.00069v1", "categories": ["cs.SD", "eess.AS"], "primary_category": "cs.SD"}
