{"title": "AI in Game Playing: Sokoban Solver", "abstract": "Artificial Intelligence is becoming instrumental in a variety of applications. Games serve as a good breeding ground for trying and testing these algorithms in a sandbox with simpler constraints in comparison to real life. In this project, we aim to develop an AI agent that can solve the classical Japanese game of Sokoban using various algorithms and heuristics and compare their performances through standard metrics.", "published": "2018-06-29 19:49:09", "link": "http://arxiv.org/abs/1807.00049v1", "categories": ["cs.AI"], "primary_category": "cs.AI"}
{"title": "Mammographic Image Enhancement using Digital Image Processing Technique", "abstract": "Abstract PURPOSES this study aims to perform microcalsification detection by performing image enhancement in mammography image by using transformation of negative image and histogram equalization. image mammography with .pgm format changed to. jpg format then processed into negative image result then processed again using histogram equalization. the results of the image enhancement process using negative image techniques and equalization histograms are compared and validated with MSE and PSNR on each mammographic image. CONCLUSION: Image enhancement process on mammography image can be done, however there are only some image that have improved quality, this affected by threshold usage, which have important role to get better visualization on mammographic image. Keywords-component; Image enhancement, image negative, histogram equalization, mammographic, breast cancer", "published": "2018-06-29 15:54:51", "link": "http://arxiv.org/abs/1806.11496v1", "categories": ["eess.IV", "cs.CV"], "primary_category": "eess.IV"}
{"title": "Robust Heartbeat Detection from Multimodal Data via CNN-based Generalizable Information Fusion", "abstract": "Objective: Heartbeat detection remains central to cardiac disease diagnosis and management, and is traditionally performed based on electrocardiogram (ECG). To improve robustness and accuracy of detection, especially, in certain critical-care scenarios, the use of additional physiological signals such as arterial blood pressure (BP) has recently been suggested. There, estimation of heartbeat location requires information fusion from multiple signals. However, reported efforts in this direction often obtain multimodal estimates somewhat indirectly, by voting among separately obtained signal-specific intermediate estimates. In contrast, we propose to directly fuse information from multiple signals without requiring intermediate estimates, and thence estimate heartbeat location in a robust manner. Method: We propose as a heartbeat detector, a convolutional neural network (CNN) that learns fused features from multiple physiological signals. This method eliminates the need for hand-picked signal-specific features and ad hoc fusion schemes. Further, being data-driven, the same algorithm learns suitable features from arbitrary set of signals. Results: Using ECG and BP signals of PhysioNet 2014 Challenge database, we obtained a score of 94%. Further, using two ECG channels of MIT-BIH arrhythmia database, we scored 99.92\\%. Both those scores compare favourably with previously reported database-specific results. Also, our detector achieved high accuracy in a variety of clinical conditions. Conclusion: The proposed CNN-based information fusion (CIF) algorithm is generalizable, robust and efficient in detecting heartbeat location from multiple signals. Significance: In medical signal monitoring systems, our technique would accurately estimate heartbeat locations even when only a subset of channels are reliable.", "published": "2018-06-29 06:47:16", "link": "http://arxiv.org/abs/1807.03232v1", "categories": ["eess.SP", "cs.CV", "physics.med-ph"], "primary_category": "eess.SP"}
{"title": "Measuring the quality of Synthetic data for use in competitions", "abstract": "Machine learning has the potential to assist many communities in using the large datasets that are becoming more and more available. Unfortunately, much of that potential is not being realized because it would require sharing data in a way that compromises privacy. In order to overcome this hurdle, several methods have been proposed that generate synthetic data while preserving the privacy of the real data. In this paper we consider a key characteristic that synthetic data should have in order to be useful for machine learning researchers - the relative performance of two algorithms (trained and tested) on the synthetic dataset should be the same as their relative performance (when trained and tested) on the original dataset.", "published": "2018-06-29 10:39:59", "link": "http://arxiv.org/abs/1806.11345v1", "categories": ["cs.LG", "stat.ML"], "primary_category": "cs.LG"}
{"title": "Convergence Problems with Generative Adversarial Networks (GANs)", "abstract": "Generative adversarial networks (GANs) are a novel approach to generative modelling, a task whose goal it is to learn a distribution of real data points. They have often proved difficult to train: GANs are unlike many techniques in machine learning, in that they are best described as a two-player game between a discriminator and generator. This has yielded both unreliability in the training process, and a general lack of understanding as to how GANs converge, and if so, to what. The purpose of this dissertation is to provide an account of the theory of GANs suitable for the mathematician, highlighting both positive and negative results. This involves identifying the problems when training GANs, and how topological and game-theoretic perspectives of GANs have contributed to our understanding and improved our techniques in recent years.", "published": "2018-06-29 12:41:12", "link": "http://arxiv.org/abs/1806.11382v1", "categories": ["cs.LG", "stat.ML"], "primary_category": "cs.LG"}
{"title": "Adversarial Examples in Deep Learning: Characterization and Divergence", "abstract": "The burgeoning success of deep learning has raised the security and privacy concerns as more and more tasks are accompanied with sensitive data. Adversarial attacks in deep learning have emerged as one of the dominating security threat to a range of mission-critical deep learning systems and applications. This paper takes a holistic and principled approach to perform statistical characterization of adversarial examples in deep learning. We provide a general formulation of adversarial examples and elaborate on the basic principle for adversarial attack algorithm design. We introduce easy and hard categorization of adversarial attacks to analyze the effectiveness of adversarial examples in terms of attack success rate, degree of change in adversarial perturbation, average entropy of prediction qualities, and fraction of adversarial examples that lead to successful attacks. We conduct extensive experimental study on adversarial behavior in easy and hard attacks under deep learning models with different hyperparameters and different deep learning frameworks. We show that the same adversarial attack behaves differently under different hyperparameters and across different frameworks due to the different features learned under different deep learning model training process. Our statistical characterization with strong empirical evidence provides a transformative enlightenment on mitigation strategies towards effective countermeasures against present and future adversarial attacks.", "published": "2018-06-29 19:50:25", "link": "http://arxiv.org/abs/1807.00051v3", "categories": ["cs.LG", "stat.ML"], "primary_category": "cs.LG"}
{"title": "A Probabilistic Modeling Approach to One-Shot Gesture Recognition", "abstract": "Gesture recognition enables a natural extension of the way we currently interact with devices. Commercially available gesture recognition systems are usually pre-trained and offer no option for customization by the user. In order to improve the user experience, it is desirable to allow end users to define their own gestures. This scenario requires learning from just a few training examples if we want to impose only a light training load on the user. To this end, we propose a gesture classifier based on a hierarchical probabilistic modeling approach. In this framework, high-level features that are shared among different gestures can be extracted from a large labeled data set, yielding a prior distribution for gestures. When learning new types of gestures, the learned shared prior reduces the number of required training examples for individual gestures. We implemented the proposed gesture classifier for a Myo sensor bracelet and show favorable results for the tested system on a database of 17 different gesture types. Furthermore, we propose and implement two methods to incorporate the gesture classifier in a real-time gesture recognition system.", "published": "2018-06-29 13:36:41", "link": "http://arxiv.org/abs/1806.11408v3", "categories": ["eess.SP"], "primary_category": "eess.SP"}
