{"title": "Tübingen-Oslo system: Linear regression works the best at Predicting\n  Current and Future Psychological Health from Childhood Essays in the CLPsych\n  2018 Shared Task", "abstract": "This paper describes our efforts in predicting current and future\npsychological health from childhood essays within the scope of the CLPsych-2018\nShared Task. We experimented with a number of different models, including\nrecurrent and convolutional networks, Poisson regression, support vector\nregression, and L1 and L2 regularized linear regression. We obtained the best\nresults on the training/development data with L2 regularized linear regression\n(ridge regression) which also got the best scores on main metrics in the\nofficial testing for task A (predicting psychological health from essays\nwritten at the age of 11 years) and task B (predicting later psychological\nhealth from essays written at the age of 11).", "published": "2018-09-13 08:53:14", "link": "http://arxiv.org/abs/1809.04838v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "LiveBot: Generating Live Video Comments Based on Visual and Textual\n  Contexts", "abstract": "We introduce the task of automatic live commenting. Live commenting, which is\nalso called `video barrage', is an emerging feature on online video sites that\nallows real-time comments from viewers to fly across the screen like bullets or\nroll at the right side of the screen. The live comments are a mixture of\nopinions for the video and the chit chats with other comments. Automatic live\ncommenting requires AI agents to comprehend the videos and interact with human\nviewers who also make the comments, so it is a good testbed of an AI agent's\nability of dealing with both dynamic vision and language. In this work, we\nconstruct a large-scale live comment dataset with 2,361 videos and 895,929 live\ncomments. Then, we introduce two neural models to generate live comments based\non the visual and textual contexts, which achieve better performance than\nprevious neural baselines such as the sequence-to-sequence model. Finally, we\nprovide a retrieval-based evaluation protocol for automatic live commenting\nwhere the model is asked to sort a set of candidate comments based on the\nlog-likelihood score, and evaluated on metrics such as mean-reciprocal-rank.\nPutting it all together, we demonstrate the first `LiveBot'.", "published": "2018-09-13 13:27:52", "link": "http://arxiv.org/abs/1809.04938v2", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Unsupervised Machine Commenting with Neural Variational Topic Model", "abstract": "Article comments can provide supplementary opinions and facts for readers,\nthereby increase the attraction and engagement of articles. Therefore,\nautomatically commenting is helpful in improving the activeness of the\ncommunity, such as online forums and news websites. Previous work shows that\ntraining an automatic commenting system requires large parallel corpora.\nAlthough part of articles are naturally paired with the comments on some\nwebsites, most articles and comments are unpaired on the Internet. To fully\nexploit the unpaired data, we completely remove the need for parallel data and\npropose a novel unsupervised approach to train an automatic article commenting\nmodel, relying on nothing but unpaired articles and comments. Our model is\nbased on a retrieval-based commenting framework, which uses news to retrieve\ncomments based on the similarity of their topics. The topic representation is\nobtained from a neural variational topic model, which is trained in an\nunsupervised manner. We evaluate our model on a news comment dataset.\nExperiments show that our proposed topic-based approach significantly\noutperforms previous lexicon-based models. The model also profits from paired\ncorpora and achieves state-of-the-art performance under semi-supervised\nscenarios.", "published": "2018-09-13 13:48:42", "link": "http://arxiv.org/abs/1809.04960v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "SafeCity: Understanding Diverse Forms of Sexual Harassment Personal\n  Stories", "abstract": "With the recent rise of #MeToo, an increasing number of personal stories\nabout sexual harassment and sexual abuse have been shared online. In order to\npush forward the fight against such harassment and abuse, we present the task\nof automatically categorizing and analyzing various forms of sexual harassment,\nbased on stories shared on the online forum SafeCity. For the labels of\ngroping, ogling, and commenting, our single-label CNN-RNN model achieves an\naccuracy of 86.5%, and our multi-label model achieves a Hamming score of 82.5%.\nFurthermore, we present analysis using LIME, first-derivative saliency\nheatmaps, activation clustering, and embedding visualization to interpret\nneural model predictions and demonstrate how this extracts features that can\nhelp automatically fill out incident reports, identify unsafe areas, avoid\nunsafe practices, and 'pin the creeps'.", "published": "2018-09-13 02:00:23", "link": "http://arxiv.org/abs/1809.04739v2", "categories": ["cs.CL", "cs.AI"], "primary_category": "cs.CL"}
{"title": "On the Strength of Character Language Models for Multilingual Named\n  Entity Recognition", "abstract": "Character-level patterns have been widely used as features in English Named\nEntity Recognition (NER) systems. However, to date there has been no direct\ninvestigation of the inherent differences between name and non-name tokens in\ntext, nor whether this property holds across multiple languages. This paper\nanalyzes the capabilities of corpus-agnostic Character-level Language Models\n(CLMs) in the binary task of distinguishing name tokens from non-name tokens.\nWe demonstrate that CLMs provide a simple and powerful model for capturing\nthese differences, identifying named entity tokens in a diverse set of\nlanguages at close to the performance of full NER systems. Moreover, by adding\nvery simple CLM-based features we can significantly improve the performance of\nan off-the-shelf NER system for multiple languages.", "published": "2018-09-13 20:01:20", "link": "http://arxiv.org/abs/1809.05157v2", "categories": ["cs.CL", "cs.IR"], "primary_category": "cs.CL"}
{"title": "XNLI: Evaluating Cross-lingual Sentence Representations", "abstract": "State-of-the-art natural language processing systems rely on supervision in\nthe form of annotated data to learn competent models. These models are\ngenerally trained on data in a single language (usually English), and cannot be\ndirectly used beyond that language. Since collecting data in every language is\nnot realistic, there has been a growing interest in cross-lingual language\nunderstanding (XLU) and low-resource cross-language transfer. In this work, we\nconstruct an evaluation set for XLU by extending the development and test sets\nof the Multi-Genre Natural Language Inference Corpus (MultiNLI) to 15\nlanguages, including low-resource languages such as Swahili and Urdu. We hope\nthat our dataset, dubbed XNLI, will catalyze research in cross-lingual sentence\nunderstanding by providing an informative standard evaluation task. In\naddition, we provide several baselines for multilingual sentence understanding,\nincluding two based on machine translation systems, and two that use parallel\ndata to train aligned multilingual bag-of-words and LSTM encoders. We find that\nXNLI represents a practical and challenging evaluation suite, and that directly\ntranslating the test data yields the best performance among available\nbaselines.", "published": "2018-09-13 16:39:53", "link": "http://arxiv.org/abs/1809.05053v1", "categories": ["cs.CL", "cs.AI", "cs.LG"], "primary_category": "cs.CL"}
{"title": "IncSQL: Training Incremental Text-to-SQL Parsers with Non-Deterministic\n  Oracles", "abstract": "We present a sequence-to-action parsing approach for the natural language to\nSQL task that incrementally fills the slots of a SQL query with feasible\nactions from a pre-defined inventory. To account for the fact that typically\nthere are multiple correct SQL queries with the same or very similar semantics,\nwe draw inspiration from syntactic parsing techniques and propose to train our\nsequence-to-action models with non-deterministic oracles. We evaluate our\nmodels on the WikiSQL dataset and achieve an execution accuracy of 83.7% on the\ntest set, a 2.1% absolute improvement over the models trained with traditional\nstatic oracles assuming a single correct target SQL query. When further\ncombined with the execution-guided decoding strategy, our model sets a new\nstate-of-the-art performance at an execution accuracy of 87.1%.", "published": "2018-09-13 16:42:21", "link": "http://arxiv.org/abs/1809.05054v2", "categories": ["cs.CL", "cs.AI", "cs.DB", "cs.LG"], "primary_category": "cs.CL"}
