{"title": "Improving Mild Cognitive Impairment Prediction via Reinforcement\n  Learning and Dialogue Simulation", "abstract": "Mild cognitive impairment (MCI) is a prodromal phase in the progression from\nnormal aging to dementia, especially Alzheimers disease. Even though there is\nmild cognitive decline in MCI patients, they have normal overall cognition and\nthus is challenging to distinguish from normal aging. Using transcribed data\nobtained from recorded conversational interactions between participants and\ntrained interviewers, and applying supervised learning models to these data, a\nrecent clinical trial has shown a promising result in differentiating MCI from\nnormal aging. However, the substantial amount of interactions with medical\nstaff can still incur significant medical care expenses in practice. In this\npaper, we propose a novel reinforcement learning (RL) framework to train an\nefficient dialogue agent on existing transcripts from clinical trials.\nSpecifically, the agent is trained to sketch disease-specific lexical\nprobability distribution, and thus to converse in a way that maximizes the\ndiagnosis accuracy and minimizes the number of conversation turns. We evaluate\nthe performance of the proposed reinforcement learning framework on the MCI\ndiagnosis from a real clinical trial. The results show that while using only a\nfew turns of conversation, our framework can significantly outperform\nstate-of-the-art supervised learning approaches.", "published": "2018-02-18 19:27:24", "link": "http://arxiv.org/abs/1802.06428v1", "categories": ["cs.LG", "cs.CL", "stat.ML"], "primary_category": "cs.LG"}
{"title": "Improved TDNNs using Deep Kernels and Frequency Dependent Grid-RNNs", "abstract": "Time delay neural networks (TDNNs) are an effective acoustic model for large\nvocabulary speech recognition. The strength of the model can be attributed to\nits ability to effectively model long temporal contexts. However, current TDNN\nmodels are relatively shallow, which limits the modelling capability. This\npaper proposes a method of increasing the network depth by deepening the kernel\nused in the TDNN temporal convolutions. The best performing kernel consists of\nthree fully connected layers with a residual (ResNet) connection from the\noutput of the first to the output of the third. The addition of\nspectro-temporal processing as the input to the TDNN in the form of a\nconvolutional neural network (CNN) and a newly designed Grid-RNN was\ninvestigated. The Grid-RNN strongly outperforms a CNN if different sets of\nparameters for different frequency bands are used and can be further enhanced\nby using a bi-directional Grid-RNN. Experiments using the multi-genre broadcast\n(MGB3) English data (275h) show that deep kernel TDNNs reduces the word error\nrate (WER) by 6% relative and when combined with the frequency dependent\nGrid-RNN gives a relative WER reduction of 9%.", "published": "2018-02-18 17:54:19", "link": "http://arxiv.org/abs/1802.06412v2", "categories": ["cs.CL", "cs.AI", "cs.SD", "eess.AS", "stat.ML"], "primary_category": "cs.CL"}
{"title": "Directional and Causal Information Flow in EEG for Assessing Perceived\n  Audio Quality", "abstract": "In this paper, electroencephalography (EEG) measurements are used to infer\nchange in cortical functional connectivity in response to change in audio\nstimulus. Experiments are conducted wherein the EEG activity of human subjects\nis recorded as they listen to audio sequences whose quality varies with time. A\ncausal information theoretic framework is then proposed to measure the\ninformation flow between EEG sensors appropriately grouped into different\nregions of interest (ROI) over the cortex. A new causal bidirectional\ninformation (CBI) measure is defined as an improvement over standard directed\ninformation measures for the purposes of identifying connectivity between ROIs\nin a generalized cortical network setting. CBI can be intuitively interpreted\nas a causal bidirectional modification of directed information, and inherently\ncalculates the divergence of the observed data from a multiple access channel\nwith feedback. Further, we determine the analytical relationship between the\ndifferent causal measures and compare how well they are able to distinguish\nbetween the perceived audio quality. The connectivity results inferred indicate\na significant change in the rate of information flow between ROIs as the\nsubjects listen to different audio qualities, with CBI being the best in\ndiscriminating between the perceived audio quality, compared to using standard\ndirected information measures.", "published": "2018-02-18 03:37:32", "link": "http://arxiv.org/abs/1802.06327v1", "categories": ["eess.SP", "eess.AS", "q-bio.NC"], "primary_category": "eess.SP"}
