{"title": "Sentence Object Notation: Multilingual sentence notation based on\n  Wordnet", "abstract": "The representation of sentences is a very important task. It can be used as a\nway to exchange data inter-applications. One main characteristic, that a\nnotation must have, is a minimal size and a representative form. This can\nreduce the transfer time, and hopefully the processing time as well.\n  Usually, sentence representation is associated to the processed language. The\ngrammar of this language affects how we represent the sentence. To avoid\nlanguage-dependent notations, we have to come up with a new representation\nwhich don't use words, but their meanings. This can be done using a lexicon\nlike wordnet, instead of words we use their synsets. As for syntactic\nrelations, they have to be universal as much as possible.\n  Our new notation is called STON \"SenTences Object Notation\", which somehow\nhas similarities to JSON. It is meant to be minimal, representative and\nlanguage-independent syntactic representation. Also, we want it to be readable\nand easy to be created. This simplifies developing simple automatic generators\nand creating test banks manually. Its benefit is to be used as a medium between\ndifferent parts of applications like: text summarization, language translation,\netc. The notation is based on 4 languages: Arabic, English, Franch and\nJapanese; and there are some cases where these languages don't agree on one\nrepresentation. Also, given the diversity of grammatical structure of different\nworld languages, this annotation may fail for some languages which allows more\nfuture improvements.", "published": "2018-01-03 13:02:25", "link": "http://arxiv.org/abs/1801.00984v2", "categories": ["cs.CL", "cs.AI"], "primary_category": "cs.CL"}
{"title": "Social Media Analysis based on Semanticity of Streaming and Batch Data", "abstract": "Languages shared by people differ in different regions based on their\naccents, pronunciation and word usages. In this era sharing of language takes\nplace mainly through social media and blogs. Every second swing of such a micro\nposts exist which induces the need of processing those micro posts, in-order to\nextract knowledge out of it. Knowledge extraction differs with respect to the\napplication in which the research on cognitive science fed the necessities for\nthe same. This work further moves forward such a research by extracting\nsemantic information of streaming and batch data in applications like Named\nEntity Recognition and Author Profiling. In the case of Named Entity\nRecognition context of a single micro post has been utilized and context that\nlies in the pool of micro posts were utilized to identify the sociolect aspects\nof the author of those micro posts. In this work Conditional Random Field has\nbeen utilized to do the entity recognition and a novel approach has been\nproposed to find the sociolect aspects of the author (Gender, Age group).", "published": "2018-01-03 18:23:41", "link": "http://arxiv.org/abs/1801.01102v2", "categories": ["cs.CL", "cs.AI", "cs.SI", "68T50"], "primary_category": "cs.CL"}
{"title": "DeepJ: Style-Specific Music Generation", "abstract": "Recent advances in deep neural networks have enabled algorithms to compose\nmusic that is comparable to music composed by humans. However, few algorithms\nallow the user to generate music with tunable parameters. The ability to tune\nproperties of generated music will yield more practical benefits for aiding\nartists, filmmakers, and composers in their creative tasks. In this paper, we\nintroduce DeepJ - an end-to-end generative model that is capable of composing\nmusic conditioned on a specific mixture of composer styles. Our innovations\ninclude methods to learn musical style and music dynamics. We use our model to\ndemonstrate a simple technique for controlling the style of generated music as\na proof of concept. Evaluation of our model using human raters shows that we\nhave improved over the Biaxial LSTM approach.", "published": "2018-01-03 02:54:08", "link": "http://arxiv.org/abs/1801.00887v1", "categories": ["cs.SD", "eess.AS"], "primary_category": "cs.SD"}
