{"title": "We Built a Fake News & Click-bait Filter: What Happened Next Will Blow\n  Your Mind!", "abstract": "It is completely amazing! Fake news and click-baits have totally invaded the\ncyber space. Let us face it: everybody hates them for three simple reasons.\nReason #2 will absolutely amaze you. What these can achieve at the time of\nelection will completely blow your mind! Now, we all agree, this cannot go on,\nyou know, somebody has to stop it. So, we did this research on fake\nnews/click-bait detection and trust us, it is totally great research, it really\nis! Make no mistake. This is the best research ever! Seriously, come have a\nlook, we have it all: neural networks, attention mechanism, sentiment lexicons,\nauthor profiling, you name it. Lexical features, semantic features, we\nabsolutely have it all. And we have totally tested it, trust us! We have\nresults, and numbers, really big numbers. The best numbers ever! Oh, and\nanalysis, absolutely top notch analysis. Interested? Come read the shocking\ntruth about fake news and click-bait in the Bulgarian cyber space. You won't\nbelieve what we have found!", "published": "2018-03-10 10:09:13", "link": "http://arxiv.org/abs/1803.03786v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Language Identification of Bengali-English Code-Mixed data using\n  Character & Phonetic based LSTM Models", "abstract": "Language identification of social media text still remains a challenging task\ndue to properties like code-mixing and inconsistent phonetic transliterations.\nIn this paper, we present a supervised learning approach for language\nidentification at the word level of low resource Bengali-English code-mixed\ndata taken from social media. We employ two methods of word encoding, namely\ncharacter based and root phone based to train our deep LSTM models. Utilizing\nthese two models we created two ensemble models using stacking and threshold\ntechnique which gave 91.78% and 92.35% accuracies respectively on our testing\ndata.", "published": "2018-03-10 20:38:55", "link": "http://arxiv.org/abs/1803.03859v2", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Face2Text: Collecting an Annotated Image Description Corpus for the\n  Generation of Rich Face Descriptions", "abstract": "The past few years have witnessed renewed interest in NLP tasks at the\ninterface between vision and language. One intensively-studied problem is that\nof automatically generating text from images. In this paper, we extend this\nproblem to the more specific domain of face description. Unlike scene\ndescriptions, face descriptions are more fine-grained and rely on attributes\nextracted from the image, rather than objects and relations. Given that no data\nexists for this task, we present an ongoing crowdsourcing study to collect a\ncorpus of descriptions of face images taken `in the wild'. To gain a better\nunderstanding of the variation we find in face description and the possible\nissues that this may raise, we also conducted an annotation study on a subset\nof the corpus. Primarily, we found descriptions to refer to a mixture of\nattributes, not only physical, but also emotional and inferential, which is\nbound to create further challenges for current image-to-text methods.", "published": "2018-03-10 15:52:08", "link": "http://arxiv.org/abs/1803.03827v2", "categories": ["cs.CL", "cs.AI", "cs.CV"], "primary_category": "cs.CL"}
