{"title": "Query2Vec: An Evaluation of NLP Techniques for Generalized Workload\n  Analytics", "abstract": "We consider methods for learning vector representations of SQL queries to\nsupport generalized workload analytics tasks, including workload summarization\nfor index selection and predicting queries that will trigger memory errors. We\nconsider vector representations of both raw SQL text and optimized query plans,\nand evaluate these methods on synthetic and real SQL workloads. We find that\ngeneral algorithms based on vector representations can outperform existing\napproaches that rely on specialized features. For index recommendation, we\ncluster the vector representations to compress large workloads with no loss in\nperformance from the recommended index. For error prediction, we train a\nclassifier over learned vectors that can automatically relate subtle syntactic\npatterns with specific errors raised during query execution. Surprisingly, we\nalso find that these methods enable transfer learning, where a model trained on\none SQL corpus can be applied to an unrelated corpus and still enable good\nperformance. We find that these general approaches, when trained on a large\ncorpus of SQL queries, provides a robust foundation for a variety of workload\nanalysis tasks and database features, without requiring application-specific\nfeature engineering.", "published": "2018-01-17 10:21:49", "link": "http://arxiv.org/abs/1801.05613v2", "categories": ["cs.DB", "cs.CL"], "primary_category": "cs.DB"}
{"title": "Automatic Detection of Cyberbullying in Social Media Text", "abstract": "While social media offer great communication opportunities, they also\nincrease the vulnerability of young people to threatening situations online.\nRecent studies report that cyberbullying constitutes a growing problem among\nyoungsters. Successful prevention depends on the adequate detection of\npotentially harmful messages and the information overload on the Web requires\nintelligent systems to identify potential risks automatically. The focus of\nthis paper is on automatic cyberbullying detection in social media text by\nmodelling posts written by bullies, victims, and bystanders of online bullying.\nWe describe the collection and fine-grained annotation of a training corpus for\nEnglish and Dutch and perform a series of binary classification experiments to\ndetermine the feasibility of automatic cyberbullying detection. We make use of\nlinear support vector machines exploiting a rich feature set and investigate\nwhich information sources contribute the most for this particular task.\nExperiments on a holdout test set reveal promising results for the detection of\ncyberbullying-related posts. After optimisation of the hyperparameters, the\nclassifier yields an F1-score of 64% and 61% for English and Dutch\nrespectively, and considerably outperforms baseline systems based on keywords\nand word unigrams.", "published": "2018-01-17 10:38:20", "link": "http://arxiv.org/abs/1801.05617v1", "categories": ["cs.CL", "cs.CY", "cs.SI", "68T50", "I.2.7; J.4"], "primary_category": "cs.CL"}
{"title": "NELS -- Never-Ending Learner of Sounds", "abstract": "Sounds are essential to how humans perceive and interact with the world and\nare captured in recordings and shared on the Internet on a minute-by-minute\nbasis. These recordings, which are predominantly videos, constitute the largest\narchive of sounds we know. However, most of these recordings have undescribed\ncontent making necessary methods for automatic sound analysis, indexing and\nretrieval. These methods have to address multiple challenges, such as the\nrelation between sounds and language, numerous and diverse sound classes, and\nlarge-scale evaluation. We propose a system that continuously learns from the\nweb relations between sounds and language, improves sound recognition models\nover time and evaluates its learning competency in the large-scale without\nreferences. We introduce the Never-Ending Learner of Sounds (NELS), a project\nfor continuously learning of sounds and their associated knowledge, available\non line in nels.cs.cmu.edu", "published": "2018-01-17 04:29:12", "link": "http://arxiv.org/abs/1801.05544v2", "categories": ["cs.SD", "eess.AS"], "primary_category": "cs.SD"}
{"title": "A Kotel'nikov Representation for Wavelets", "abstract": "This paper presents a wavelet representation using baseband signals, by\nexploiting Kotel'nikov results. Details of how to obtain the processes of\nenvelope and phase at low frequency are shown. The archetypal interpretation of\nwavelets as an analysis with a filter bank of constant quality factor is\nrevisited on these bases. It is shown that if the wavelet spectral support is\nlimited into the band $[f_m,f_M]$, then an orthogonal analysis is guaranteed\nprovided that $f_M \\leq 3f_m$, a quite simple result, but that invokes some\nparallel with the Nyquist rate. Nevertheless, in cases of orthogonal wavelets\nwhose spectrum does not verify this condition, it is shown how to construct an\n\"equivalent\" filter bank with no spectral overlapping.", "published": "2018-01-17 20:33:16", "link": "http://arxiv.org/abs/1801.05859v1", "categories": ["math.CA", "eess.AS", "eess.SP", "math.NA", "stat.ME", "42C40, 62G08"], "primary_category": "math.CA"}
