{"title": "BLEU is Not Suitable for the Evaluation of Text Simplification", "abstract": "BLEU is widely considered to be an informative metric for text-to-text\ngeneration, including Text Simplification (TS). TS includes both lexical and\nstructural aspects. In this paper we show that BLEU is not suitable for the\nevaluation of sentence splitting, the major structural simplification\noperation. We manually compiled a sentence splitting gold standard corpus\ncontaining multiple structural paraphrases, and performed a correlation\nanalysis with human judgments. We find low or no correlation between BLEU and\nthe grammaticality and meaning preservation parameters where sentence splitting\nis involved. Moreover, BLEU often negatively correlates with simplicity,\nessentially penalizing simpler sentences.", "published": "2018-10-14 08:32:35", "link": "http://arxiv.org/abs/1810.05995v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Robust Neural Abstractive Summarization Systems and Evaluation against\n  Adversarial Information", "abstract": "Sequence-to-sequence (seq2seq) neural models have been actively investigated\nfor abstractive summarization. Nevertheless, existing neural abstractive\nsystems frequently generate factually incorrect summaries and are vulnerable to\nadversarial information, suggesting a crucial lack of semantic understanding.\nIn this paper, we propose a novel semantic-aware neural abstractive\nsummarization model that learns to generate high quality summaries through\nsemantic interpretation over salient content. A novel evaluation scheme with\nadversarial samples is introduced to measure how well a model identifies\noff-topic information, where our model yields significantly better performance\nthan the popular pointer-generator summarizer. Human evaluation also confirms\nthat our system summaries are uniformly more informative and faithful as well\nas less redundant than the seq2seq model.", "published": "2018-10-14 17:08:54", "link": "http://arxiv.org/abs/1810.06065v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Finding Similar Medical Questions from Question Answering Websites", "abstract": "The past few years have witnessed the flourishing of crowdsourced medical\nquestion answering (Q&A) websites. Patients who have medical information\ndemands tend to post questions about their health conditions on these\ncrowdsourced Q&A websites and get answers from other users. However, we observe\nthat a large portion of new medical questions cannot be answered in time or\nreceive only few answers from these websites. On the other hand, we notice that\nsolved questions have great potential to solve this challenge. Motivated by\nthese, we propose an end-to-end system that can automatically find similar\nquestions for unsolved medical questions. By learning the vector presentation\nof unsolved questions and their candidate similar questions, the proposed\nsystem outputs similar questions according to the similarity between vector\nrepresentations. Through the vector representation, the similar questions are\nfound at the question level, and the diversity of medical questions expression\nissue can be addressed. Further, we handle two more important issues, i.e.,\ntraining data generation issue and efficiency issue, associated with the LSTM\ntraining procedure and the retrieval of candidate similar questions. The\neffectiveness of the proposed system is validated on a large-scale real-world\ndataset collected from a crowdsourced maternal-infant Q&A website.", "published": "2018-10-14 06:34:18", "link": "http://arxiv.org/abs/1810.05983v1", "categories": ["cs.AI", "cs.CL"], "primary_category": "cs.AI"}
{"title": "Modeling relation paths for knowledge base completion via joint\n  adversarial training", "abstract": "Knowledge Base Completion (KBC), which aims at determining the missing\nrelations between entity pairs, has received increasing attention in recent\nyears. Most existing KBC methods focus on either embedding the Knowledge Base\n(KB) into a specific semantic space or leveraging the joint probability of\nRandom Walks (RWs) on multi-hop paths. Only a few unified models take both\nsemantic and path-related features into consideration with adequacy. In this\npaper, we propose a novel method to explore the intrinsic relationship between\nthe single relation (i.e. 1-hop path) and multi-hop paths between paired\nentities. We use Hierarchical Attention Networks (HANs) to select important\nrelations in multi-hop paths and encode them into low-dimensional vectors. By\ntreating relations and multi-hop paths as two different input sources, we use a\nfeature extractor, which is shared by two downstream components (i.e. relation\nclassifier and source discriminator), to capture shared/similar information\nbetween them. By joint adversarial training, we encourage our model to extract\nfeatures from the multi-hop paths which are representative for relation\ncompletion. We apply the trained model (except for the source discriminator) to\nseveral large-scale KBs for relation completion. Experimental results show that\nour method outperforms existing path information-based approaches. Since each\nsub-module of our model can be well interpreted, our model can be applied to a\nlarge number of relation learning tasks.", "published": "2018-10-14 13:26:34", "link": "http://arxiv.org/abs/1810.06033v2", "categories": ["cs.AI", "cs.CL"], "primary_category": "cs.AI"}
