{"title": "A volumetric deep Convolutional Neural Network for simulation of mock dark matter halo catalogues", "abstract": "For modern large-scale structure survey techniques it has become standard practice to test data analysis pipelines on large suites of mock simulations, a task which is currently prohibitively expensive for full N-body simulations. Instead of calculating this costly gravitational evolution, we have trained a three-dimensional deep Convolutional Neural Network (CNN) to identify dark matter protohalos directly from the cosmological initial conditions. Training on halo catalogues from the Peak Patch semi-analytic code, we test various CNN architectures and find they generically achieve a Dice coefficient of ~92% in only 24 hours of training. We present a simple and fast geometric halo finding algorithm to extract halos from this powerful pixel-wise binary classifier and find that the predicted catalogues match the mass function and power spectra of the ground truth simulations to within ~10%. We investigate the effect of long-range tidal forces on an object-by-object basis and find that the network's predictions are consistent with the non-linear ellipsoidal collapse equations used explicitly by the Peak Patch algorithm.", "published": "2018-05-11 18:05:50", "link": "http://arxiv.org/abs/1805.04537v2", "categories": ["astro-ph.CO", "astro-ph.IM", "cs.CV"], "primary_category": "astro-ph.CO"}
{"title": "Randomized Smoothing SVRG for Large-scale Nonsmooth Convex Optimization", "abstract": "In this paper, we consider the problem of minimizing the average of a large number of nonsmooth and convex functions. Such problems often arise in typical machine learning problems as empirical risk minimization, but are computationally very challenging. We develop and analyze a new algorithm that achieves robust linear convergence rate, and both its time complexity and gradient complexity are superior than state-of-art nonsmooth algorithms and subgradient-based schemes. Besides, our algorithm works without any extra error bound conditions on the objective function as well as the common strongly-convex condition. We show that our algorithm has wide applications in optimization and machine learning problems, and demonstrate experimentally that it performs well on a large-scale ranking problem.", "published": "2018-05-11 04:05:34", "link": "http://arxiv.org/abs/1805.05189v1", "categories": ["stat.ML", "cs.LG", "math.OC"], "primary_category": "stat.ML"}
{"title": "Robust and Scalable Models of Microbiome Dynamics", "abstract": "Microbes are everywhere, including in and on our bodies, and have been shown to play key roles in a variety of prevalent human diseases. Consequently, there has been intense interest in the design of bacteriotherapies or \"bugs as drugs,\" which are communities of bacteria administered to patients for specific therapeutic applications. Central to the design of such therapeutics is an understanding of the causal microbial interaction network and the population dynamics of the organisms. In this work we present a Bayesian nonparametric model and associated efficient inference algorithm that addresses the key conceptual and practical challenges of learning microbial dynamics from time series microbe abundance data. These challenges include high-dimensional (300+ strains of bacteria in the gut) but temporally sparse and non-uniformly sampled data; high measurement noise; and, nonlinear and physically non-negative dynamics. Our contributions include a new type of dynamical systems model for microbial dynamics based on what we term interaction modules, or learned clusters of latent variables with redundant interaction structure (reducing the expected number of interaction coefficients from $O(n^2)$ to $O((\\log n)^2)$); a fully Bayesian formulation of the stochastic dynamical systems model that propagates measurement and latent state uncertainty throughout the model; and introduction of a temporally varying auxiliary variable technique to enable efficient inference by relaxing the hard non-negativity constraint on states. We apply our method to simulated and real data, and demonstrate the utility of our technique for system identification from limited data and gaining new biological insights into bacteriotherapy design.", "published": "2018-05-11 21:13:11", "link": "http://arxiv.org/abs/1805.04591v2", "categories": ["stat.ML", "cs.LG"], "primary_category": "stat.ML"}
{"title": "Field Trial of Alien Wavelengths on GARR Optical Network", "abstract": "GARR optical network is composed of two separate optical network domains at the national level. With the aim to integrate them we implemented alien wavelengths to deliver high-performance services improving the overall network efficiency. This paper describes the path followed to deploy the alien wavelengths in the GARR operational infrastructure from the planning phase to the production network.", "published": "2018-05-11 08:47:21", "link": "http://arxiv.org/abs/1805.04278v1", "categories": ["eess.SP", "cs.NI"], "primary_category": "eess.SP"}
{"title": "Networked Model Predictive Control Using a Wavelet Neural Network", "abstract": "In this study, we use a wavelet neural network with a feedforward component and a model predictive controller for online nonlinear system identification over a communication network. The wavelet neural network (WNN) performs the online identification of the nonlinear system. The model predictive controller (MPC) uses the model to predict the future outputs of the system over an extended prediction horizon and calculates the optimal future inputs by minimizing a controller cost function. The Lyapunov theory is used to prove the stability of the MPC. We apply the methodology to the online identification and control of an unmanned autonomous vehicle. Simulation results show that the MPC with extended prediction horizon can effectively control the system in the presence of fixed or random network delay.", "published": "2018-05-11 18:37:48", "link": "http://arxiv.org/abs/1805.04549v1", "categories": ["eess.SP"], "primary_category": "eess.SP"}
