{"title": "Aperiodic points in $\\mathbb Z^2$-subshifts", "abstract": "We consider the structure of aperiodic points in $\\mathbb Z^2$-subshifts, and in particular the positions at which they fail to be periodic. We prove that if a $\\mathbb Z^2$-subshift contains points whose smallest period is arbitrarily large, then it contains an aperiodic point. This lets us characterise the computational difficulty of deciding if an $\\mathbb Z^2$-subshift of finite type contains an aperiodic point. Another consequence is that $\\mathbb Z^2$-subshifts with no aperiodic point have a very strong dynamical structure and are almost topologically conjugate to some $\\mathbb Z$-subshift. Finally, we use this result to characterize sets of possible slopes of periodicity for $\\mathbb Z^3$-subshifts of finite type.", "published": "2018-05-22 19:37:14", "link": "http://arxiv.org/abs/1805.08829v1", "categories": ["cs.DM", "math.DS"], "primary_category": "cs.DM"}
{"title": "Accelerated Gossip in Networks of Given Dimension using Jacobi Polynomial Iterations", "abstract": "Consider a network of agents connected by communication links, where each agent holds a real value. The gossip problem consists in estimating the average of the values diffused in the network in a distributed manner. We develop a method solving the gossip problem that depends only on the spectral dimension of the network, that is, in the communication network set-up, the dimension of the space in which the agents live. This contrasts with previous work that required the spectral gap of the network as a parameter, or suffered from slow mixing. Our method shows an important improvement over existing algorithms in the non-asymptotic regime, i.e., when the values are far from being fully mixed in the network. Our approach stems from a polynomial-based point of view on gossip algorithms, as well as an approximation of the spectral measure of the graphs with a Jacobi measure. We show the power of the approach with simulations on various graphs, and with performance guarantees on graphs of known spectral dimension, such as grids and random percolation bonds. An extension of this work to distributed Laplacian solvers is discussed. As a side result, we also use the polynomial-based point of view to show the convergence of the message passing algorithm for gossip of Moallemi \\& Van Roy on regular graphs. The explicit computation of the rate of the convergence shows that message passing has a slow rate of convergence on graphs with small spectral gap.", "published": "2018-05-22 12:02:26", "link": "http://arxiv.org/abs/1805.08531v4", "categories": ["cs.MA", "cs.DC", "stat.ML"], "primary_category": "cs.MA"}
