{"title": "VnCoreNLP: A Vietnamese Natural Language Processing Toolkit", "abstract": "We present an easy-to-use and fast toolkit, namely VnCoreNLP---a Java NLP\nannotation pipeline for Vietnamese. Our VnCoreNLP supports key natural language\nprocessing (NLP) tasks including word segmentation, part-of-speech (POS)\ntagging, named entity recognition (NER) and dependency parsing, and obtains\nstate-of-the-art (SOTA) results for these tasks. We release VnCoreNLP to\nprovide rich linguistic annotations to facilitate research work on Vietnamese\nNLP. Our VnCoreNLP is open-source and available at:\nhttps://github.com/vncorenlp/VnCoreNLP", "published": "2018-01-04 12:52:43", "link": "http://arxiv.org/abs/1801.01331v2", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Discrete symbolic optimization and Boltzmann sampling by continuous\n  neural dynamics: Gradient Symbolic Computation", "abstract": "Gradient Symbolic Computation is proposed as a means of solving discrete\nglobal optimization problems using a neurally plausible continuous stochastic\ndynamical system. Gradient symbolic dynamics involves two free parameters that\nmust be adjusted as a function of time to obtain the global maximizer at the\nend of the computation. We provide a summary of what is known about the GSC\ndynamics for special cases of settings of the parameters, and also establish\nthat there is a schedule for the two parameters for which convergence to the\ncorrect answer occurs with high probability. These results put the empirical\nresults already obtained for GSC on a sound theoretical footing.", "published": "2018-01-04 21:30:05", "link": "http://arxiv.org/abs/1801.03562v1", "categories": ["cs.CL", "49D10, 60J70, 91F20"], "primary_category": "cs.CL"}
{"title": "Slugbot: An Application of a Novel and Scalable Open Domain Socialbot\n  Framework", "abstract": "In this paper we introduce a novel, open domain socialbot for the Amazon\nAlexa Prize competition, aimed at carrying on friendly conversations with users\non a variety of topics. We present our modular system, highlighting our\ndifferent data sources and how we use the human mind as a model for data\nmanagement. Additionally we build and employ natural language understanding and\ninformation retrieval tools and APIs to expand our knowledge bases. We describe\nour semistructured, scalable framework for crafting topic-specific dialogue\nflows, and give details on our dialogue management schemes and scoring\nmechanisms. Finally we briefly evaluate the performance of our system and\nobserve the challenges that an open domain socialbot faces.", "published": "2018-01-04 19:58:46", "link": "http://arxiv.org/abs/1801.01531v1", "categories": ["cs.CL", "cs.HC"], "primary_category": "cs.CL"}
{"title": "A pairwise discriminative task for speech emotion recognition", "abstract": "I have submitted a new version to arXiv:1910.11174. I forget to choose to\nreplace the old version, but submitted a new one. It's my mistake.", "published": "2018-01-04 03:30:47", "link": "http://arxiv.org/abs/1801.01237v2", "categories": ["cs.HC", "cs.SD", "eess.AS"], "primary_category": "cs.HC"}
{"title": "Neural Style Transfer for Audio Spectograms", "abstract": "There has been fascinating work on creating artistic transformations of\nimages by Gatys. This was revolutionary in how we can in some sense alter the\n'style' of an image while generally preserving its 'content'. In our work, we\npresent a method for creating new sounds using a similar approach, treating it\nas a style-transfer problem, starting from a random-noise input signal and\niteratively using back-propagation to optimize the sound to conform to\nfilter-outputs from a pre-trained neural architecture of interest.\n  For demonstration, we investigate two different tasks, resulting in bandwidth\nexpansion/compression, and timbral transfer from singing voice to musical\ninstruments. A feature of our method is that a single architecture can generate\nthese different audio-style-transfer types using the same set of parameters\nwhich otherwise require different complex hand-tuned diverse signal processing\npipelines.", "published": "2018-01-04 23:59:07", "link": "http://arxiv.org/abs/1801.01589v1", "categories": ["cs.SD", "cs.AI", "cs.MM", "eess.AS"], "primary_category": "cs.SD"}
