{"title": "Black Magic Investigation Made Simple: Monte Carlo Simulations and Historical Back Testing of Momentum Cross-Over Strategies Using FRACTI Patterns", "abstract": "To promote economic stability, finance should be studied as a hard science, where scientific methods apply. When a trading strategy is proposed, the underlying model should be transparent and defined robustly to allow other researchers to understand and examine it thoroughly. Like any hard sciences, results must be repeatable to allow researchers to collaborate, and build upon each other's results. Large-scale collaboration, when applying the steps of scientific investigation, is an efficient way to leverage \"crowd science\" to accelerate research in finance. In this paper, we demonstrate how a real world problem in economics, an old problem still subject to a lot of debate, can be solved by the application of a crowd-powered, collaborative scientific computational framework, fully supporting the process of investigation dictated by the modern scientific method. This paper provides a real end-to-end example of investigation to illustrate the use of the framework. We intentionally selected an example that is self-contained, complete, simple, accessible, and of constant debate in both academia and the industry: the performance of a trading strategy used commonly in technical analysis. Claims of efficiency in technical analysis, referred derisively by some sources as \"Black Magic\", are of widespread use in mainstream media and usually met with a lot of controversy. In this paper we show that different researchers assess this strategy differently, and the subsequent debate is due more to the lack of method than purpose. Most results reported are not repeatable by other researchers. This is not satisfactory if we intend to approach finance as a hard science. To counterweight the status quo, we demonstrate what one could do by using collaborative and investigative features of contributions and leveraging the power of crowds.", "published": "2018-08-23 21:08:56", "link": "http://arxiv.org/abs/1808.07949v1", "categories": ["q-fin.CP"], "primary_category": "q-fin.CP"}
