{"title": "Leveraging human knowledge in tabular reinforcement learning: A study of human subjects", "abstract": "Reinforcement Learning (RL) can be extremely effective in solving complex, real-world problems. However, injecting human knowledge into an RL agent may require extensive effort and expertise on the human designer's part. To date, human factors are generally not considered in the development and evaluation of possible RL approaches. In this article, we set out to investigate how different methods for injecting human knowledge are applied, in practice, by human designers of varying levels of knowledge and skill. We perform the first empirical evaluation of several methods, including a newly proposed method named SASS which is based on the notion of similarities in the agent's state-action space. Through this human study, consisting of 51 human participants, we shed new light on the human factors that play a key role in RL. We find that the classical reward shaping technique seems to be the most natural method for most designers, both expert and non-expert, to speed up RL. However, we further find that our proposed method SASS can be effectively and efficiently combined with reward shaping, and provides a beneficial alternative to using only a single speedup method with minimal human designer effort overhead.", "published": "2018-05-15 13:51:31", "link": "http://arxiv.org/abs/1805.05769v1", "categories": ["cs.AI", "cs.LG"], "primary_category": "cs.AI"}
{"title": "Agent Based Rumor Spreading in a scale-free network", "abstract": "In the last years, the study of rumor spreading on social networks produced a lot of interest among the scientific community, expecially due to the role of social networks in the last political events. The goal of this work is to reproduce real-like diffusions of information and misinformation in a scale-free network using a multi-agent-based model. The data concerning the virtual spreading are easily obtainable, in particular the diffusion of information during the announcement for the discovery of the Higgs Boson on Twitter was recorded and investigated in detail. We made some assumptions on the micro behavior of our agents and registered the effects in a statistical analysis replying the real data diffusion. Then, we studied an hypotetical response to a misinformation diffusion adding debunking agents and trying to model a critic response from the agents using real data from a hoax regarding the Occupy Wall Street movement. After tuning our model to reproduce these results, we measured some network properties and proved the emergence of substantially separated structures like echochambers, independently from the network size scale, i.e. with one hundred, one thousand and ten thousand agents.", "published": "2018-05-15 19:09:41", "link": "http://arxiv.org/abs/1805.05999v2", "categories": ["cs.MA", "cs.SI"], "primary_category": "cs.MA"}
{"title": "An Adaptive Optimal Mapping Selection Algorithm for PNC using Variable QAM Modulation", "abstract": "Fifth generation (5G) wireless networks will need to serve much higher user densities than existing 4G networks, and will therefore require an enhanced radio access network (RAN) infrastructure. Physical layer network coding (PNC) has been shown to enable such high densities with much lower backhaul load than approaches such as Cloud-RAN and coordinated multipoint (CoMP). In this letter, we present an engineering applicable PNC scheme which allows different cooperating users to use different modulation schemes, according to the relative strength of their channels to a given access point. This is in contrast with compute-and-forward and previous PNC schemes which are designed for two-way relay channel. A two-stage search algorithm to identify the optimum PNC mappings for given channel state information and modulation is proposed in this letter. Numerical results show that the proposed scheme achieves low bit error rate with reduced backhaul load.", "published": "2018-05-15 14:13:28", "link": "http://arxiv.org/abs/1805.05786v1", "categories": ["eess.SP"], "primary_category": "eess.SP"}
