{"title": "fMRI Semantic Category Decoding using Linguistic Encoding of Word Embeddings", "abstract": "The dispute of how the human brain represents conceptual knowledge has been argued in many scientific fields. Brain imaging studies have shown that the spatial patterns of neural activation in the brain are correlated with thinking about different semantic categories of words (for example, tools, animals, and buildings) or when viewing the related pictures. In this paper, we present a computational model that learns to predict the neural activation captured in functional magnetic resonance imaging (fMRI) data of test words. Unlike the models with hand-crafted features that have been used in the literature, in this paper we propose a novel approach wherein decoding models are built with features extracted from popular linguistic encodings of Word2Vec, GloVe, Meta-Embeddings in conjunction with the empirical fMRI data associated with viewing several dozen concrete nouns. We compared these models with several other models that use word features extracted from FastText, Randomly-generated features, Mitchell's 25 features [1]. The experimental results show that the predicted fMRI images using Meta-Embeddings meet the state-of-the-art performance. Although models with features from GloVe and Word2Vec predict fMRI images similar to the state-of-the-art model, model with features from Meta-Embeddings predicts significantly better. The proposed scheme that uses popular linguistic encoding offers a simple and easy approach for semantic decoding from fMRI experiments.", "published": "2018-06-13 10:59:33", "link": "http://arxiv.org/abs/1806.05177v1", "categories": ["q-bio.NC", "cs.CL", "cs.CV"], "primary_category": "q-bio.NC"}
{"title": "Learning Representations of Ultrahigh-dimensional Data for Random Distance-based Outlier Detection", "abstract": "Learning expressive low-dimensional representations of ultrahigh-dimensional data, e.g., data with thousands/millions of features, has been a major way to enable learning methods to address the curse of dimensionality. However, existing unsupervised representation learning methods mainly focus on preserving the data regularity information and learning the representations independently of subsequent outlier detection methods, which can result in suboptimal and unstable performance of detecting irregularities (i.e., outliers).\n  This paper introduces a ranking model-based framework, called RAMODO, to address this issue. RAMODO unifies representation learning and outlier detection to learn low-dimensional representations that are tailored for a state-of-the-art outlier detection approach - the random distance-based approach. This customized learning yields more optimal and stable representations for the targeted outlier detectors. Additionally, RAMODO can leverage little labeled data as prior knowledge to learn more expressive and application-relevant representations. We instantiate RAMODO to an efficient method called REPEN to demonstrate the performance of RAMODO.\n  Extensive empirical results on eight real-world ultrahigh dimensional data sets show that REPEN (i) enables a random distance-based detector to obtain significantly better AUC performance and two orders of magnitude speedup; (ii) performs substantially better and more stably than four state-of-the-art representation learning methods; and (iii) leverages less than 1% labeled data to achieve up to 32% AUC improvement.", "published": "2018-06-13 00:53:56", "link": "http://arxiv.org/abs/1806.04808v1", "categories": ["cs.LG", "cs.AI", "cs.DB", "stat.ML"], "primary_category": "cs.LG"}
{"title": "Your 2 is My 1, Your 3 is My 9: Handling Arbitrary Miscalibrations in Ratings", "abstract": "Cardinal scores (numeric ratings) collected from people are well known to suffer from miscalibrations. A popular approach to address this issue is to assume simplistic models of miscalibration (such as linear biases) to de-bias the scores. This approach, however, often fares poorly because people's miscalibrations are typically far more complex and not well understood. In the absence of simplifying assumptions on the miscalibration, it is widely believed by the crowdsourcing community that the only useful information in the cardinal scores is the induced ranking. In this paper, inspired by the framework of Stein's shrinkage, empirical Bayes, and the classic two-envelope problem, we contest this widespread belief. Specifically, we consider cardinal scores with arbitrary (or even adversarially chosen) miscalibrations which are only required to be consistent with the induced ranking. We design estimators which despite making no assumptions on the miscalibration, strictly and uniformly outperform all possible estimators that rely on only the ranking. Our estimators are flexible in that they can be used as a plug-in for a variety of applications, and we provide a proof-of-concept for A/B testing and ranking. Our results thus provide novel insights in the eternal debate between cardinal and ordinal data.", "published": "2018-06-13 14:28:41", "link": "http://arxiv.org/abs/1806.05085v2", "categories": ["stat.ML", "cs.AI", "cs.IT", "cs.LG"], "primary_category": "stat.ML"}
{"title": "High-Dimensional Inference for Cluster-Based Graphical Models", "abstract": "Motivated by modern applications in which one constructs graphical models based on a very large number of features, this paper introduces a new class of cluster-based graphical models, in which variable clustering is applied as an initial step for reducing the dimension of the feature space. We employ model assisted clustering, in which the clusters contain features that are similar to the same unobserved latent variable. Two different cluster-based Gaussian graphical models are considered: the latent variable graph, corresponding to the graphical model associated with the unobserved latent variables, and the cluster-average graph, corresponding to the vector of features averaged over clusters. Our study reveals that likelihood based inference for the latent graph, not analyzed previously, is analytically intractable. Our main contribution is the development and analysis of alternative estimation and inference strategies, for the precision matrix of an unobservable latent vector $Z$. We replace the likelihood of the data by an appropriate class of empirical risk functions, that can be specialized to the latent graphical model and to the simpler, but under-analyzed, cluster-average graphical model. The estimators thus derived can be used for inference on the graph structure, for instance on edge strength or pattern recovery. Inference is based on the asymptotic limits of the entry-wise estimates of the precision matrices associated with the conditional independence graphs under consideration. While taking the uncertainty induced by the clustering step into account, we establish Berry-Esseen central limit theorems for the proposed estimators. It is noteworthy that, although the clusters are estimated adaptively from the data, the central limit theorems regarding the entries of the estimated graphs are proved under the same conditions one would use if the clusters were known....", "published": "2018-06-13 16:37:34", "link": "http://arxiv.org/abs/1806.05139v2", "categories": ["stat.ML", "cs.LG", "math.ST"], "primary_category": "stat.ML"}
{"title": "Integral Privacy for Sampling", "abstract": "Differential privacy is a leading protection setting, focused by design on individual privacy. Many applications, in medical / pharmaceutical domains or social networks, rather posit privacy at a group level, a setting we call integral privacy. We aim for the strongest form of privacy: the group size is in particular not known in advance. We study a problem with related applications in domains cited above that have recently met with substantial recent press: sampling.\n  Keeping correct utility levels in such a strong model of statistical indistinguishability looks difficult to be achieved with the usual differential privacy toolbox because it would typically scale in the worst case the sensitivity by the sample size and so the noise variance by up to its square. We introduce a trick specific to sampling that bypasses the sensitivity analysis. Privacy enforces an information theoretic barrier on approximation, and we show how to reach this barrier with guarantees on the approximation of the target non private density. We do so using a recent approach to non private density estimation relying on the original boosting theory, learning the sufficient statistics of an exponential family with classifiers. Approximation guarantees cover the mode capture problem. In the context of learning, the sampling problem is particularly important: because integral privacy enjoys the same closure under post-processing as differential privacy does, any algorithm using integrally privacy sampled data would result in an output equally integrally private. We also show that this brings fairness guarantees on post-processing that would eventually elude classical differential privacy: any decision process has bounded data-dependent bias when the data is integrally privately sampled. Experimental results against private kernel density estimation and private GANs displays the quality of our results.", "published": "2018-06-13 02:01:22", "link": "http://arxiv.org/abs/1806.04819v5", "categories": ["stat.ML", "cs.LG"], "primary_category": "stat.ML"}
{"title": "Model-based Speech Enhancement for Intelligibility Improvement in Binaural Hearing Aids", "abstract": "Speech intelligibility is often severely degraded among hearing impaired individuals in situations such as the cocktail party scenario. The performance of the current hearing aid technology has been observed to be limited in these scenarios. In this paper, we propose a binaural speech enhancement framework that takes into consideration the speech production model. The enhancement framework proposed here is based on the Kalman filter that allows us to take the speech production dynamics into account during the enhancement process. The usage of a Kalman filter requires the estimation of clean speech and noise short term predictor (STP) parameters, and the clean speech pitch parameters. In this work, a binaural codebook-based method is proposed for estimating the STP parameters, and a directional pitch estimator based on the harmonic model and maximum likelihood principle is used to estimate the pitch parameters. The proposed method for estimating the STP and pitch parameters jointly uses the information from left and right ears, leading to a more robust estimation of the filter parameters. Objective measures such as PESQ and STOI have been used to evaluate the enhancement framework in different acoustic scenarios representative of the cocktail party scenario. We have also conducted subjective listening tests on a set of nine normal hearing subjects, to evaluate the performance in terms of intelligibility and quality improvement. The listening tests show that the proposed algorithm, even with access to only a single channel noisy observation, significantly improves the overall speech quality, and the speech intelligibility by up to 15%.", "published": "2018-06-13 08:19:23", "link": "http://arxiv.org/abs/1806.04885v2", "categories": ["eess.AS", "cs.SD"], "primary_category": "eess.AS"}
{"title": "Dual-Polarization OFDM-OQAM Wireless Communication System", "abstract": "In this paper we describe the overall idea and results of a recently proposed radio access technique based on filter bank multicarrier (FBMC) communication system using two orthogonal polarizations: dual-polarization FBMC (DP-FBMC). Using this system we can alleviate the intrinsic interference problem in FBMC systems. This enables use of all the multicarrier techniques used in cyclic-prefix orthogonal frequency-division multiplexing (CP-OFDM) systems for channel equalization, multiple-input/multiple-output (MIMO) processing, etc., without using the extra processing required for conventional FBMC. DP-FBMC also provides other interesting advantages over CP-OFDM and FBMC such as more robustness in multipath fading channels, and more robustness to receiver carrier frequency offset (CFO) and timing offset (TO). For DP-FBMC we propose three different structures based on different multiplexing techniques in time, frequency, and polarization. We will show that one of these structures has exactly the same system complexity and equipment as conventional FBMC. In our simulation results DP-FBMC has better bit error ratio (BER) performance in dispersive channels. Based on these results, DP-FBMC has potential as a promising candidate for future wireless communication systems.", "published": "2018-06-13 16:53:56", "link": "http://arxiv.org/abs/1806.05143v2", "categories": ["eess.SP"], "primary_category": "eess.SP"}
{"title": "Novel Light Weight Compressed Data Aggregation Using Sparse Measurements for IoT Networks", "abstract": "Optimal data aggregation aimed at maximizing IoT network lifetime by minimizing constrained on-board resource utilization continues to be a challenging task. The existing data aggregation methods have proven that compressed sensing is promising for data aggregation. However, they compromise either on energy efficiency or recovery fidelity and require complex on-node computations. In this paper, we propose a novel Light Weight Compressed Data Aggregation (LWCDA) algorithm that randomly divides the entire network into non-overlapping clusters for data aggregation. The random non-overlapping clustering offers two important advantages: 1) energy efficiency, as each node has to send its measurement only to its cluster head, 2) highly sparse measurement matrix, which leads to a practically implementable framework with low complexity. We analyze the properties of our measurement matrix using restricted isometry property, the associated coherence and phase transition. Through extensive simulations on practical data, we show that the measurement matrix can reconstruct data with high fidelity. Further, we demonstrate that the LWCDA algorithm reduces transmission cost significantly against baseline approaches, implying thereby the enhancement of the network lifetime.", "published": "2018-06-13 07:17:09", "link": "http://arxiv.org/abs/1806.04874v1", "categories": ["eess.SP"], "primary_category": "eess.SP"}
