{"title": "What's to know? Uncertainty as a Guide to Asking Goal-oriented Questions", "abstract": "One of the core challenges in Visual Dialogue problems is asking the question\nthat will provide the most useful information towards achieving the required\nobjective. Encouraging an agent to ask the right questions is difficult because\nwe don't know a-priori what information the agent will need to achieve its\ntask, and we don't have an explicit model of what it knows already. We propose\na solution to this problem based on a Bayesian model of the uncertainty in the\nimplicit model maintained by the visual dialogue agent, and in the function\nused to select an appropriate output. By selecting the question that minimises\nthe predicted regret with respect to this implicit model the agent actively\nreduces ambiguity. The Bayesian model of uncertainty also enables a principled\nmethod for identifying when enough information has been acquired, and an action\nshould be selected. We evaluate our approach on two goal-oriented dialogue\ndatasets, one for visual-based collaboration task and the other for a\nnegotiation-based task. Our uncertainty-aware information-seeking model\noutperforms its counterparts in these two challenging problems.", "published": "2018-12-16 06:12:45", "link": "http://arxiv.org/abs/1812.06401v1", "categories": ["cs.AI", "cs.CL", "cs.LG"], "primary_category": "cs.AI"}
{"title": "NSCaching: Simple and Efficient Negative Sampling for Knowledge Graph\n  Embedding", "abstract": "Knowledge Graph (KG) embedding is a fundamental problem in data mining\nresearch with many real-world applications. It aims to encode the entities and\nrelations in the graph into low dimensional vector space, which can be used for\nsubsequent algorithms. Negative sampling, which samples negative triplets from\nnon-observed ones in the training data, is an important step in KG embedding.\nRecently, generative adversarial network (GAN), has been introduced in negative\nsampling. By sampling negative triplets with large scores, these methods avoid\nthe problem of vanishing gradient and thus obtain better performance. However,\nusing GAN makes the original model more complex and hard to train, where\nreinforcement learning must be used. In this paper, motivated by the\nobservation that negative triplets with large scores are important but rare, we\npropose to directly keep track of them with the cache. However, how to sample\nfrom and update the cache are two important questions. We carefully design the\nsolutions, which are not only efficient but also achieve a good balance between\nexploration and exploitation. In this way, our method acts as a \"distilled\"\nversion of previous GA-based methods, which does not waste training time on\nadditional parameters to fit the full distribution of negative triplets. The\nextensive experiments show that our method can gain significant improvement in\nvarious KG embedding models, and outperform the state-of-the-art negative\nsampling methods based on GAN.", "published": "2018-12-16 07:32:02", "link": "http://arxiv.org/abs/1812.06410v2", "categories": ["cs.AI", "cs.CL", "cs.LG"], "primary_category": "cs.AI"}
{"title": "Visual Dialogue without Vision or Dialogue", "abstract": "We characterise some of the quirks and shortcomings in the exploration of\nVisual Dialogue - a sequential question-answering task where the questions and\ncorresponding answers are related through given visual stimuli. To do so, we\ndevelop an embarrassingly simple method based on Canonical Correlation Analysis\n(CCA) that, on the standard dataset, achieves near state-of-the-art performance\non mean rank (MR). In direct contrast to current complex and over-parametrised\narchitectures that are both compute and time intensive, our method ignores the\nvisual stimuli, ignores the sequencing of dialogue, does not need gradients,\nuses off-the-shelf feature extractors, has at least an order of magnitude fewer\nparameters, and learns in practically no time. We argue that these results are\nindicative of issues in current approaches to Visual Dialogue and conduct\nanalyses to highlight implicit dataset biases and effects of over-constrained\nevaluation metrics. Our code is publicly available.", "published": "2018-12-16 08:18:37", "link": "http://arxiv.org/abs/1812.06417v3", "categories": ["cs.CV", "cs.CL", "cs.LG"], "primary_category": "cs.CV"}
{"title": "Direction Finding Based on Multi-Step Knowledge-Aided Iterative\n  Conjugate Gradient Algorithms", "abstract": "In this work, we present direction-of-arrival (DoA) estimation algorithms\nbased on the Krylov subspace that effectively exploit prior knowledge of the\nsignals that impinge on a sensor array. The proposed multi-step knowledge-aided\niterative conjugate gradient (CG) (MS-KAI-CG) algorithms perform subtraction of\nthe unwanted terms found in the estimated covariance matrix of the sensor data.\nFurthermore, we develop a version of MS-KAI-CG equipped with forward-backward\naveraging, called MS-KAI-CG-FB, which is appropriate for scenarios with\ncorrelated signals. Unlike current knowledge-aided methods, which take\nadvantage of known DoAs to enhance the estimation of the covariance matrix of\nthe input data, the MS-KAI-CG algorithms take advantage of the knowledge of the\nstructure of the forward-backward smoothed covariance matrix and its\ndisturbance terms. Simulations with both uncorrelated and correlated signals\nshow that the MS-KAI-CG algorithms outperform existing techniques.", "published": "2018-12-16 00:25:58", "link": "http://arxiv.org/abs/1812.07505v1", "categories": ["eess.SP", "cs.IT", "cs.LG", "cs.SD", "eess.AS", "math.IT", "math.OC", "stat.ML"], "primary_category": "eess.SP"}
