{"title": "Assessing Crosslingual Discourse Relations in Machine Translation", "abstract": "In an attempt to improve overall translation quality, there has been an\nincreasing focus on integrating more linguistic elements into Machine\nTranslation (MT). While significant progress has been achieved, especially\nrecently with neural models, automatically evaluating the output of such\nsystems is still an open problem. Current practice in MT evaluation relies on a\nsingle reference translation, even though there are many ways of translating a\nparticular text, and it tends to disregard higher level information such as\ndiscourse. We propose a novel approach that assesses the translated output\nbased on the source text rather than the reference translation, and measures\nthe extent to which the semantics of the discourse elements (discourse\nrelations, in particular) in the source text are preserved in the MT output.\nThe challenge is to detect the discourse relations in the source text and\ndetermine whether these relations are correctly transferred crosslingually to\nthe target language -- without a reference translation. This methodology could\nbe used independently for discourse-level evaluation, or as a component in\nother metrics, at a time where substantial amounts of MT are online and would\nbenefit from evaluation where the source text serves as a benchmark.", "published": "2018-10-07 14:14:27", "link": "http://arxiv.org/abs/1810.03148v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Phonology-Augmented Statistical Framework for Machine Transliteration\n  using Limited Linguistic Resources", "abstract": "Transliteration converts words in a source language (e.g., English) into\nwords in a target language (e.g., Vietnamese). This conversion considers the\nphonological structure of the target language, as the transliterated output\nneeds to be pronounceable in the target language. For example, a word in\nVietnamese that begins with a consonant cluster is phonologically invalid and\nthus would be an incorrect output of a transliteration system. Most statistical\ntransliteration approaches, albeit being widely adopted, do not explicitly\nmodel the target language's phonology, which often results in invalid outputs.\nThe problem is compounded by the limited linguistic resources available when\nconverting foreign words to transliterated words in the target language. In\nthis work, we present a phonology-augmented statistical framework suitable for\ntransliteration, especially when only limited linguistic resources are\navailable. We propose the concept of pseudo-syllables as structures\nrepresenting how segments of a foreign word are organized according to the\nsyllables of the target language's phonology. We performed transliteration\nexperiments on Vietnamese and Cantonese. We show that the proposed framework\noutperforms the statistical baseline by up to 44.68% relative, when there are\nlimited training examples (587 entries).", "published": "2018-10-07 17:32:11", "link": "http://arxiv.org/abs/1810.03184v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "A Machine Learning Approach to Persian Text Readability Assessment Using\n  a Crowdsourced Dataset", "abstract": "An automated approach to text readability assessment is essential to a\nlanguage and can be a powerful tool for improving the understandability of\ntexts written and published in that language. However, the Persian language,\nwhich is spoken by over 110 million speakers, lacks such a system. Unlike other\nlanguages such as English, French, and Chinese, very limited research studies\nhave been carried out to build an accurate and reliable text readability\nassessment system for the Persian language. In the present research, the first\nPersian dataset for text readability assessment was gathered and the first\nmodel for Persian text readability assessment using machine learning was\nintroduced. The experiments showed that this model was accurate and could\nassess the readability of Persian texts with a high degree of confidence. The\nresults of this study can be used in a number of applications such as medical\nand educational text readability evaluation and have the potential to be the\ncornerstone of future studies in Persian text readability assessment.", "published": "2018-10-07 19:07:59", "link": "http://arxiv.org/abs/1810.06639v4", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Geocoding Without Geotags: A Text-based Approach for reddit", "abstract": "In this paper, we introduce the first geolocation inference approach for\nreddit, a social media platform where user pseudonymity has thus far made\nsupervised demographic inference difficult to implement and validate. In\nparticular, we design a text-based heuristic schema to generate ground truth\nlocation labels for reddit users in the absence of explicitly geotagged data.\nAfter evaluating the accuracy of our labeling procedure, we train and test\nseveral geolocation inference models across our reddit data set and three\nbenchmark Twitter geolocation data sets. Ultimately, we show that geolocation\nmodels trained and applied on the same domain substantially outperform models\nattempting to transfer training data across domains, even more so on reddit\nwhere platform-specific interest-group metadata can be used to improve\ninferences.", "published": "2018-10-07 01:46:27", "link": "http://arxiv.org/abs/1810.03067v1", "categories": ["cs.IR", "cs.CL"], "primary_category": "cs.IR"}
{"title": "Unsupervised Neural Word Segmentation for Chinese via Segmental Language\n  Modeling", "abstract": "Previous traditional approaches to unsupervised Chinese word segmentation\n(CWS) can be roughly classified into discriminative and generative models. The\nformer uses the carefully designed goodness measures for candidate\nsegmentation, while the latter focuses on finding the optimal segmentation of\nthe highest generative probability. However, while there exists a trivial way\nto extend the discriminative models into neural version by using neural\nlanguage models, those of generative ones are non-trivial. In this paper, we\npropose the segmental language models (SLMs) for CWS. Our approach explicitly\nfocuses on the segmental nature of Chinese, as well as preserves several\nproperties of language models. In SLMs, a context encoder encodes the previous\ncontext and a segment decoder generates each segment incrementally. As far as\nwe know, we are the first to propose a neural model for unsupervised CWS and\nachieve competitive performance to the state-of-the-art statistical models on\nfour different datasets from SIGHAN 2005 bakeoff.", "published": "2018-10-07 15:55:58", "link": "http://arxiv.org/abs/1810.03167v1", "categories": ["cs.CL", "cs.LG"], "primary_category": "cs.CL"}
{"title": "Rethinking Recurrent Latent Variable Model for Music Composition", "abstract": "We present a model for capturing musical features and creating novel\nsequences of music, called the Convolutional Variational Recurrent Neural\nNetwork. To generate sequential data, the model uses an encoder-decoder\narchitecture with latent probabilistic connections to capture the hidden\nstructure of music. Using the sequence-to-sequence model, our generative model\ncan exploit samples from a prior distribution and generate a longer sequence of\nmusic. We compare the performance of our proposed model with other types of\nNeural Networks using the criteria of Information Rate that is implemented by\nVariable Markov Oracle, a method that allows statistical characterization of\nmusical information dynamics and detection of motifs in a song. Our results\nsuggest that the proposed model has a better statistical resemblance to the\nmusical structure of the training data, which improves the creation of new\nsequences of music in the style of the originals.", "published": "2018-10-07 23:22:56", "link": "http://arxiv.org/abs/1810.03226v1", "categories": ["cs.SD", "cs.LG", "cs.MM", "eess.AS"], "primary_category": "cs.SD"}
