{"title": "Corrigendum to New Generalized Cyclotomic Binary Sequences of Period $p^2$", "abstract": "New generalized cyclotomic binary sequences of period $p^2$ are proposed in this paper, where $p$ is an odd prime. The sequences are almost balanced and their linear complexity is determined. The result shows that the proposed sequences have very large linear complexity if $p$ is a non-Wieferich prime.", "published": "2018-07-09 13:03:57", "link": "http://arxiv.org/abs/1807.03088v1", "categories": ["cs.DM"], "primary_category": "cs.DM"}
{"title": "Towards Non-Parametric Learning to Rank", "abstract": "This paper studies a stylized, yet natural, learning-to-rank problem and points out the critical incorrectness of a widely used nearest neighbor algorithm. We consider a model with $n$ agents (users) $\\{x_i\\}_{i \\in [n]}$ and $m$ alternatives (items) $\\{y_j\\}_{j \\in [m]}$, each of which is associated with a latent feature vector. Agents rank items nondeterministically according to the Plackett-Luce model, where the higher the utility of an item to the agent, the more likely this item will be ranked high by the agent. Our goal is to find neighbors of an arbitrary agent or alternative in the latent space.\n  We first show that the Kendall-tau distance based kNN produces incorrect results in our model. Next, we fix the problem by introducing a new algorithm with features constructed from \"global information\" of the data matrix. Our approach is in sharp contrast to most existing feature engineering methods. Finally, we design another new algorithm identifying similar alternatives. The construction of alternative features can be done using \"local information,\" highlighting the algorithmic difference between finding similar agents and similar alternatives.", "published": "2018-07-09 21:27:14", "link": "http://arxiv.org/abs/1807.03395v1", "categories": ["cs.LG", "cs.AI", "cs.CY", "stat.ML"], "primary_category": "cs.LG"}
{"title": "Decreasing the size of the Restricted Boltzmann machine", "abstract": "We propose a method to decrease the number of hidden units of the restricted Boltzmann machine while avoiding decrease of the performance measured by the Kullback-Leibler divergence. Then, we demonstrate our algorithm by using numerical simulations.", "published": "2018-07-09 09:19:46", "link": "http://arxiv.org/abs/1807.02999v2", "categories": ["cs.LG", "stat.ML"], "primary_category": "cs.LG"}
{"title": "Sampling and Inference for Beta Neutral-to-the-Left Models of Sparse Networks", "abstract": "Empirical evidence suggests that heavy-tailed degree distributions occurring in many real networks are well-approximated by power laws with exponents $η$ that may take values either less than and greater than two. Models based on various forms of exchangeability are able to capture power laws with $η< 2$, and admit tractable inference algorithms; we draw on previous results to show that $η> 2$ cannot be generated by the forms of exchangeability used in existing random graph models. Preferential attachment models generate power law exponents greater than two, but have been of limited use as statistical models due to the inherent difficulty of performing inference in non-exchangeable models. Motivated by this gap, we design and implement inference algorithms for a recently proposed class of models that generates $η$ of all possible values. We show that although they are not exchangeable, these models have probabilistic structure amenable to inference. Our methods make a large class of previously intractable models useful for statistical inference.", "published": "2018-07-09 13:28:15", "link": "http://arxiv.org/abs/1807.03113v1", "categories": ["stat.ML", "cs.LG", "cs.SI", "stat.ME"], "primary_category": "stat.ML"}
{"title": "Bayesian Sequential Joint Detection and Estimation", "abstract": "Joint detection and estimation refers to deciding between two or more hypotheses and, depending on the test outcome, simultaneously estimating the unknown parameters of the underlying distribution. This problem is investigated in a sequential framework under mild assumptions on the underlying random process. We formulate an unconstrained sequential decision problem, whose cost function is the weighted sum of the expected run-length and the detection/estimation errors. Then, a strong connection between the derivatives of the cost function with respect to the weights, which can be interpreted as Lagrange multipliers, and the detection/estimation errors of the underlying scheme is shown. This property is used to characterize the solution of a closely related sequential decision problem, whose objective function is the expected run-length under constraints on the average detection/estimation errors. We show that the solution of the constrained problem coincides with the solution of the unconstrained problem with suitably chosen weights. These weights are characterized as the solution of a linear program, which can be solved using efficient off-the-shelf solvers. The theoretical results are illustrated with two example problems, for which optimal sequential schemes are designed numerically and whose performance is validated via Monte Carlo simulations.", "published": "2018-07-09 15:34:21", "link": "http://arxiv.org/abs/1807.03234v4", "categories": ["eess.SP", "cs.IT", "math.ST"], "primary_category": "eess.SP"}
{"title": "Blind Identification of SFBC-OFDM Signals Based on the Central Limit Theorem", "abstract": "Previous approaches for blind identification of space-frequency block codes (SFBC) do not perform well for short observation periods due to their inefficient utilization of frequency-domain redundancy. This paper proposes a hypothesis test (HT)-based algorithm and a support vector machine (SVM)-based algorithm for SFBC signals identification over frequency-selective fading channels to exploit two-dimensional space-frequency domain redundancy. Based on the central limit theorem, space-domain redundancy is exploited to construct the cross-correlation function of the estimator and frequency-domain redundancy is incorporated in the construction of the statistics. The difference between the two proposed algorithms is that the HT-based algorithm constructs a chi-square statistic and employs an HT to make the decision, while the SVM-based algorithm constructs a non-central chi-square statistic with unknown mean as a strongly-distinguishable statistical feature and uses an SVM to make the decision. Both algorithms do not require knowledge of the channel coefficients, modulation type or noise power, and the SVM-based algorithm does not require timing synchronization. Simulation results verify the superior performance of the proposed algorithms for short observation periods with comparable computational complexity to conventional algorithms, as well as their acceptable identification performance in the presence of transmission impairments.", "published": "2018-07-09 19:17:40", "link": "http://arxiv.org/abs/1807.03348v2", "categories": ["eess.SP"], "primary_category": "eess.SP"}
{"title": "Detecting gasoline in small public places based on wireless sensor network", "abstract": "Fire accidents often cause unpredictable catastrophic losses. At present, existing fire prevention measures in public places are mostly based on the emergency treatments after the fire, which have limited protection capability when the fire spreads rapidly, especially for the flammable liquid explosion accident. Based on the gas sensor network, this paper proposes a detection framework as well as detail technologies to detect flammable liquid existing in small spaces. We propose to use sensor network to detect the flammable liquids through monitoring the concentrations of the target liquid vapor diffused in the air. Experiment results show that, the proposed surveillant system can detect the gasoline components in small space with high sensitivity while maintaining very low false detection rates to external interferences.", "published": "2018-07-09 06:08:38", "link": "http://arxiv.org/abs/1807.09220v1", "categories": ["eess.SP", "cs.DC"], "primary_category": "eess.SP"}
