{"title": "Heuristic Feature Selection for Clickbait Detection", "abstract": "We study feature selection as a means to optimize the baseline clickbait\ndetector employed at the Clickbait Challenge 2017. The challenge's task is to\nscore the \"clickbaitiness\" of a given Twitter tweet on a scale from 0 (no\nclickbait) to 1 (strong clickbait). Unlike most other approaches submitted to\nthe challenge, the baseline approach is based on manual feature engineering and\ndoes not compete out of the box with many of the deep learning-based\napproaches. We show that scaling up feature selection efforts to heuristically\nidentify better-performing feature subsets catapults the performance of the\nbaseline classifier to second rank overall, beating 12 other competing\napproaches and improving over the baseline performance by 20%. This\ndemonstrates that traditional classification approaches can still keep up with\ndeep learning on this task.", "published": "2018-02-04 20:45:20", "link": "http://arxiv.org/abs/1802.01191v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Pair-Linking for Collective Entity Disambiguation: Two Could Be Better\n  Than All", "abstract": "Collective entity disambiguation aims to jointly resolve multiple mentions by\nlinking them to their associated entities in a knowledge base. Previous works\nare primarily based on the underlying assumption that entities within the same\ndocument are highly related. However, the extend to which these mentioned\nentities are actually connected in reality is rarely studied and therefore\nraises interesting research questions. For the first time, we show that the\nsemantic relationships between the mentioned entities are in fact less dense\nthan expected. This could be attributed to several reasons such as noise, data\nsparsity and knowledge base incompleteness. As a remedy, we introduce MINTREE,\na new tree-based objective for the entity disambiguation problem. The key\nintuition behind MINTREE is the concept of coherence relaxation which utilizes\nthe weight of a minimum spanning tree to measure the coherence between\nentities. Based on this new objective, we design a novel entity disambiguation\nalgorithms which we call Pair-Linking. Instead of considering all the given\nmentions, Pair-Linking iteratively selects a pair with the highest confidence\nat each step for decision making. Via extensive experiments, we show that our\napproach is not only more accurate but also surprisingly faster than many\nstate-of-the-art collective linking algorithms.", "published": "2018-02-04 05:50:39", "link": "http://arxiv.org/abs/1802.01074v3", "categories": ["cs.IR", "cs.CL"], "primary_category": "cs.IR"}
