{"title": "Named Entity Recognition for Electronic Health Records: A Comparison of\n  Rule-based and Machine Learning Approaches", "abstract": "This work investigates multiple approaches to Named Entity Recognition (NER)\nfor text in Electronic Health Record (EHR) data. In particular, we look into\nthe application of (i) rule-based, (ii) deep learning and (iii) transfer\nlearning systems for the task of NER on brain imaging reports with a focus on\nrecords from patients with stroke. We explore the strengths and weaknesses of\neach approach, develop rules and train on a common dataset, and evaluate each\nsystem's performance on common test sets of Scottish radiology reports from two\nsources (brain imaging reports in ESS -- Edinburgh Stroke Study data collected\nby NHS Lothian as well as radiology reports created in NHS Tayside). Our\ncomparison shows that a hand-crafted system is the most accurate way to\nautomatically label EHR, but machine learning approaches can provide a feasible\nalternative where resources for a manual system are not readily available.", "published": "2019-03-10 13:16:37", "link": "http://arxiv.org/abs/1903.03985v2", "categories": ["cs.CL", "cs.AI"], "primary_category": "cs.CL"}
{"title": "Efficiently Reusing Natural Language Processing Models for\n  Phenotype-Mention Identification in Free-text Electronic Medical Records:\n  Methodology Study", "abstract": "Background: Many efforts have been put into the use of automated approaches,\nsuch as natural language processing (NLP), to mine or extract data from\nfree-text medical records to construct comprehensive patient profiles for\ndelivering better health-care. Reusing NLP models in new settings, however,\nremains cumbersome - requiring validation and/or retraining on new data\niteratively to achieve convergent results.\n  Objective: The aim of this work is to minimize the effort involved in reusing\nNLP models on free-text medical records.\n  Methods: We formally define and analyse the model adaptation problem in\nphenotype-mention identification tasks. We identify \"duplicate waste\" and\n\"imbalance waste\", which collectively impede efficient model reuse. We propose\na phenotype embedding based approach to minimize these sources of waste without\nthe need for labelled data from new settings.\n  Results: We conduct experiments on data from a large mental health registry\nto reuse NLP models in four phenotype-mention identification tasks. The\nproposed approach can choose the best model for a new task, identifying up to\n76% (duplicate waste), i.e. phenotype mentions without the need for validation\nand model retraining, and with very good performance (93-97% accuracy). It can\nalso provide guidance for validating and retraining the selected model for\nnovel language patterns in new tasks, saving around 80% (imbalance waste), i.e.\nthe effort required in \"blind\" model-adaptation approaches.\n  Conclusions: Adapting pre-trained NLP models for new tasks can be more\nefficient and effective if the language pattern landscapes of old settings and\nnew settings can be made explicit and comparable. Our experiments show that the\nphenotype-mention embedding approach is an effective way to model language\npatterns for phenotype-mention identification tasks and that its use can guide\nefficient NLP model reuse.", "published": "2019-03-10 14:05:08", "link": "http://arxiv.org/abs/1903.03995v3", "categories": ["cs.CL", "cs.AI"], "primary_category": "cs.CL"}
{"title": "Deep Griffin-Lim Iteration", "abstract": "This paper presents a novel phase reconstruction method (only from a given\namplitude spectrogram) by combining a signal-processing-based approach and a\ndeep neural network (DNN). To retrieve a time-domain signal from its amplitude\nspectrogram, the corresponding phase is required. One of the popular phase\nreconstruction methods is the Griffin-Lim algorithm (GLA), which is based on\nthe redundancy of the short-time Fourier transform. However, GLA often involves\nmany iterations and produces low-quality signals owing to the lack of prior\nknowledge of the target signal. In order to address these issues, in this\nstudy, we propose an architecture which stacks a sub-block including two\nGLA-inspired fixed layers and a DNN. The number of stacked sub-blocks is\nadjustable, and we can trade the performance and computational load based on\nrequirements of applications. The effectiveness of the proposed method is\ninvestigated by reconstructing phases from amplitude spectrograms of speeches.", "published": "2019-03-10 11:27:34", "link": "http://arxiv.org/abs/1903.03971v1", "categories": ["cs.SD", "cs.LG", "eess.AS"], "primary_category": "cs.SD"}
