{"title": "Robust Chinese Word Segmentation with Contextualized Word\n  Representations", "abstract": "In recent years, after the neural-network-based method was proposed, the\naccuracy of the Chinese word segmentation task has made great progress.\nHowever, when dealing with out-of-vocabulary words, there is still a large\nerror rate. We used a simple bidirectional LSTM architecture and a large-scale\npretrained language model to generate high-quality contextualize character\nrepresentations, which successfully reduced the weakness of the ambiguous\nmeanings of each Chinese character that widely appears in Chinese characters,\nand hence effectively reduced OOV error rate. State-of-the-art performance is\nachieved on many datasets.", "published": "2019-01-17 14:42:38", "link": "http://arxiv.org/abs/1901.05816v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Detecting Sound-Absorbing Materials in a Room from a Single Impulse\n  Response using a CRNN", "abstract": "The materials of surfaces in a room play an important room in shaping the\nauditory experience within them. Different materials absorb energy at different\nlevels. The level of absorption also varies across frequencies. This paper\ninvestigates how cues from a measured impulse response in the room can be\nexploited by machines to detect the materials present. With this motivation,\nthis paper proposes a method for estimating the probability of presence of 10\nmaterial categories, based on their frequency-dependent absorption\ncharacteristics. The method is based on a CNN-RNN, trained as a multi-task\nclassifier. The network is trained using a priori knowledge about the\nabsorption characteristics of materials from the literature. In the experiments\nshown, the network is tested on over 5,00 impulse responses and 167 materials.\nThe F1 score of the detections was 98%, with an even precision and recall. The\nmethod finds direct applications in architectural acoustics and in creating\nmore parsimonious models for acoustic reflections.", "published": "2019-01-17 15:38:21", "link": "http://arxiv.org/abs/1901.05852v3", "categories": ["eess.AS", "cs.SD"], "primary_category": "eess.AS"}
