{"title": "Aspect Category Detection via Topic-Attention Network", "abstract": "The e-commerce has started a new trend in natural language processing through\nsentiment analysis of user-generated reviews. Different consumers have\ndifferent concerns about various aspects of a specific product or service.\nAspect category detection, as a subtask of aspect-based sentiment analysis,\ntackles the problem of categorizing a given review sentence into a set of\npre-defined aspect categories. In recent years, deep learning approaches have\nbrought revolutionary advances in multiple branches of natural language\nprocessing including sentiment analysis. In this paper, we propose a deep\nneural network method based on attention mechanism to identify different aspect\ncategories of a given review sentence. Our model utilizes several attentions\nwith different topic contexts, enabling it to attend to different parts of a\nreview sentence based on different topics. Experimental results on two datasets\nin the restaurant domain released by SemEval workshop demonstrates that our\napproach outperforms existing methods on both datasets. Visualization of the\ntopic attention weights shows the effectiveness of our model in identifying\nwords related to different topics.", "published": "2019-01-04 15:52:49", "link": "http://arxiv.org/abs/1901.01183v2", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Speaker Adaptation for End-to-End CTC Models", "abstract": "We propose two approaches for speaker adaptation in end-to-end (E2E)\nautomatic speech recognition systems. One is Kullback-Leibler divergence (KLD)\nregularization and the other is multi-task learning (MTL). Both approaches aim\nto address the data sparsity especially output target sparsity issue of speaker\nadaptation in E2E systems. The KLD regularization adapts a model by forcing the\noutput distribution from the adapted model to be close to the unadapted one.\nThe MTL utilizes a jointly trained auxiliary task to improve the performance of\nthe main task. We investigated our approaches on E2E connectionist temporal\nclassification (CTC) models with three different types of output units.\nExperiments on the Microsoft short message dictation task demonstrated that MTL\noutperforms KLD regularization. In particular, the MTL adaptation obtained\n8.8\\% and 4.0\\% relative word error rate reductions (WERRs) for supervised and\nunsupervised adaptations for the word CTC model, and 9.6% and 3.8% relative\nWERRs for the mix-unit CTC model, respectively.", "published": "2019-01-04 18:38:11", "link": "http://arxiv.org/abs/1901.01239v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "A Joint Model for Multimodal Document Quality Assessment", "abstract": "The quality of a document is affected by various factors, including\ngrammaticality, readability, stylistics, and expertise depth, making the task\nof document quality assessment a complex one. In this paper, we explore this\ntask in the context of assessing the quality of Wikipedia articles and academic\npapers. Observing that the visual rendering of a document can capture implicit\nquality indicators that are not present in the document text --- such as\nimages, font choices, and visual layout --- we propose a joint model that\ncombines the text content with a visual rendering of the document for document\nquality assessment. Experimental results over two datasets reveal that textual\nand visual features are complementary, achieving state-of-the-art results.", "published": "2019-01-04 08:05:56", "link": "http://arxiv.org/abs/1901.01010v2", "categories": ["cs.CL", "cs.AI", "cs.DL"], "primary_category": "cs.CL"}
{"title": "Introduction to Voice Presentation Attack Detection and Recent Advances", "abstract": "Over the past few years significant progress has been made in the field of\npresentation attack detection (PAD) for automatic speaker recognition (ASV).\nThis includes the development of new speech corpora, standard evaluation\nprotocols and advancements in front-end feature extraction and back-end\nclassifiers. The use of standard databases and evaluation protocols has enabled\nfor the first time the meaningful benchmarking of different PAD solutions. This\nchapter summarises the progress, with a focus on studies completed in the last\nthree years. The article presents a summary of findings and lessons learned\nfrom two ASVspoof challenges, the first community-led benchmarking efforts.\nThese show that ASV PAD remains an unsolved problem and that further attention\nis required to develop generalised PAD solutions which have potential to detect\ndiverse and previously unseen spoofing attacks.", "published": "2019-01-04 13:31:25", "link": "http://arxiv.org/abs/1901.01085v1", "categories": ["cs.SD", "cs.LG", "cs.MM", "eess.AS"], "primary_category": "cs.SD"}
{"title": "Learning Sound Event Classifiers from Web Audio with Noisy Labels", "abstract": "As sound event classification moves towards larger datasets, issues of label\nnoise become inevitable. Web sites can supply large volumes of user-contributed\naudio and metadata, but inferring labels from this metadata introduces errors\ndue to unreliable inputs, and limitations in the mapping. There is, however,\nlittle research into the impact of these errors. To foster the investigation of\nlabel noise in sound event classification we present FSDnoisy18k, a dataset\ncontaining 42.5 hours of audio across 20 sound classes, including a small\namount of manually-labeled data and a larger quantity of real-world noisy data.\nWe characterize the label noise empirically, and provide a CNN baseline system.\nExperiments suggest that training with large amounts of noisy data can\noutperform training with smaller amounts of carefully-labeled data. We also\nshow that noise-robust loss functions can be effective in improving performance\nin presence of corrupted labels.", "published": "2019-01-04 16:06:21", "link": "http://arxiv.org/abs/1901.01189v2", "categories": ["cs.SD", "cs.LG", "eess.AS", "stat.ML"], "primary_category": "cs.SD"}
