{"title": "HS-CAI: A Hybrid DCOP Algorithm via Combining Search with Context-based Inference", "abstract": "Search and inference are two main strategies for optimally solving Distributed Constraint Optimization Problems (DCOPs). Recently, several algorithms were proposed to combine their advantages. Unfortunately, such algorithms only use an approximated inference as a one-shot preprocessing phase to construct the initial lower bounds which lead to inefficient pruning under the limited memory budget. On the other hand, iterative inference algorithms (e.g., MB-DPOP) perform a context-based complete inference for all possible contexts but suffer from tremendous traffic overheads. In this paper, $(i)$ hybridizing search with context-based inference, we propose a complete algorithm for DCOPs, named {HS-CAI} where the inference utilizes the contexts derived from the search process to establish tight lower bounds while the search uses such bounds for efficient pruning and thereby reduces contexts for the inference. Furthermore, $(ii)$ we introduce a context evaluation mechanism to select the context patterns for the inference to further reduce the overheads incurred by iterative inferences. Finally, $(iii)$ we prove the correctness of our algorithm and the experimental results demonstrate its superiority over the state-of-the-art.", "published": "2019-11-28 13:54:24", "link": "http://arxiv.org/abs/1911.12716v2", "categories": ["cs.MA"], "primary_category": "cs.MA"}
{"title": "On the Importance of Opponent Modeling in Auction Markets", "abstract": "The dynamics of financial markets are driven by the interactions between participants, as well as the trading mechanisms and regulatory frameworks that govern these interactions. Decision-makers would rather not ignore the impact of other participants on these dynamics and should employ tools and models that take this into account. To this end, we demonstrate the efficacy of applying opponent-modeling in a number of simulated market settings. While our simulations are simplified representations of actual market dynamics, they provide an idealized \"playground\" in which our techniques can be demonstrated and tested. We present this work with the aim that our techniques could be refined and, with some effort, scaled up to the full complexity of real-world market scenarios. We hope that the results presented encourage practitioners to adopt opponent-modeling methods and apply them online systems, in order to enable not only reactive but also proactive decisions to be made.", "published": "2019-11-28 18:14:24", "link": "http://arxiv.org/abs/1911.12816v1", "categories": ["q-fin.CP", "q-fin.TR"], "primary_category": "q-fin.CP"}
