{"title": "Improving Cross-Domain Chinese Word Segmentation with Word Embeddings", "abstract": "Cross-domain Chinese Word Segmentation (CWS) remains a challenge despite\nrecent progress in neural-based CWS. The limited amount of annotated data in\nthe target domain has been the key obstacle to a satisfactory performance. In\nthis paper, we propose a semi-supervised word-based approach to improving\ncross-domain CWS given a baseline segmenter. Particularly, our model only\ndeploys word embeddings trained on raw text in the target domain, discarding\ncomplex hand-crafted features and domain-specific dictionaries. Innovative\nsubsampling and negative sampling methods are proposed to derive word\nembeddings optimized for CWS. We conduct experiments on five datasets in\nspecial domains, covering domains in novels, medicine, and patent. Results show\nthat our model can obviously improve cross-domain CWS, especially in the\nsegmentation of domain-specific noun entities. The word F-measure increases by\nover 3.0% on four datasets, outperforming state-of-the-art semi-supervised and\nunsupervised cross-domain CWS approaches with a large margin. We make our code\nand data available on Github.", "published": "2019-03-05 06:56:12", "link": "http://arxiv.org/abs/1903.01698v3", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Language and Dialect Identification of Cuneiform Texts", "abstract": "This article introduces a corpus of cuneiform texts from which the dataset\nfor the use of the Cuneiform Language Identification (CLI) 2019 shared task was\nderived as well as some preliminary language identification experiments\nconducted using that corpus. We also describe the CLI dataset and how it was\nderived from the corpus. In addition, we provide some baseline language\nidentification results using the CLI dataset. To the best of our knowledge, the\nexperiments detailed here are the first time automatic language identification\nmethods have been used on cuneiform data.", "published": "2019-03-05 15:17:18", "link": "http://arxiv.org/abs/1903.01891v3", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Mining Dual Emotion for Fake News Detection", "abstract": "Emotion plays an important role in detecting fake news online. When\nleveraging emotional signals, the existing methods focus on exploiting the\nemotions of news contents that conveyed by the publishers (i.e., publisher\nemotion). However, fake news often evokes high-arousal or activating emotions\nof people, so the emotions of news comments aroused in the crowd (i.e., social\nemotion) should not be ignored. Furthermore, it remains to be explored whether\nthere exists a relationship between publisher emotion and social emotion (i.e.,\ndual emotion), and how the dual emotion appears in fake news. In this paper, we\nverify that dual emotion is distinctive between fake and real news and propose\nDual Emotion Features to represent dual emotion and the relationship between\nthem for fake news detection. Further, we exhibit that our proposed features\ncan be easily plugged into existing fake news detectors as an enhancement.\nExtensive experiments on three real-world datasets (one in English and the\nothers in Chinese) show that our proposed feature set: 1) outperforms the\nstate-of-the-art task-related emotional features; 2) can be well compatible\nwith existing fake news detectors and effectively improve the performance of\ndetecting fake news.", "published": "2019-03-05 08:52:33", "link": "http://arxiv.org/abs/1903.01728v4", "categories": ["cs.CL", "cs.CY"], "primary_category": "cs.CL"}
{"title": "Automatic Classification of Pathology Reports using TF-IDF Features", "abstract": "A Pathology report is arguably one of the most important documents in\nmedicine containing interpretive information about the visual findings from the\npatient's biopsy sample. Each pathology report has a retention period of up to\n20 years after the treatment of a patient. Cancer registries process and encode\nhigh volumes of free-text pathology reports for surveillance of cancer and\ntumor diseases all across the world. In spite of their extremely valuable\ninformation they hold, pathology reports are not used in any systematic way to\nfacilitate computational pathology. Therefore, in this study, we investigate\nautomated machine-learning techniques to identify/predict the primary diagnosis\n(based on ICD-O code) from pathology reports. We performed experiments by\nextracting the TF-IDF features from the reports and classifying them using\nthree different methods---SVM, XGBoost, and Logistic Regression. We constructed\na new dataset with 1,949 pathology reports arranged into 37 ICD-O categories,\ncollected from four different primary sites, namely lung, kidney, thymus, and\ntestis. The reports were manually transcribed into text format after collecting\nthem as PDF files from NCI Genomic Data Commons public dataset. We subsequently\npre-processed the reports by removing irrelevant textual artifacts produced by\nOCR software. The highest classification accuracy we achieved was 92\\% using\nXGBoost classifier on TF-IDF feature vectors, the linear SVM scored 87\\%\naccuracy. Furthermore, the study shows that TF-IDF vectors are suitable for\nhighlighting the important keywords within a report which can be helpful for\nthe cancer research and diagnostic workflow. The results are encouraging in\ndemonstrating the potential of machine learning methods for classification and\nencoding of pathology reports.", "published": "2019-03-05 09:11:53", "link": "http://arxiv.org/abs/1903.07406v1", "categories": ["cs.CL", "cs.LG", "stat.ML"], "primary_category": "cs.CL"}
{"title": "Spectral Visibility Graphs: Application to Similarity of Harmonic\n  Signals", "abstract": "Graph theory is emerging as a new source of tools for time series analysis.\nOne promising method is to transform a signal into its visibility graph, a\nrepresentation which captures many interesting aspects of the signal. Here we\nintroduce the visibility graph for audio spectra and propose a novel\nrepresentation for audio analysis: the spectral visibility graph degree. Such\nrepresentation inherently captures the harmonic content of the signal whilst\nbeing resilient to broadband noise. We present experiments demonstrating its\nutility to measure robust similarity between harmonic signals in real and\nsynthesised audio data. The source code is available online.", "published": "2019-03-05 18:42:04", "link": "http://arxiv.org/abs/1903.01976v3", "categories": ["cs.SD", "eess.AS"], "primary_category": "cs.SD"}
{"title": "Acoustic Impulse Responses for Wearable Audio Devices", "abstract": "We present an open-access dataset of over 8000 acoustic impulse from 160\nmicrophones spread across the body and affixed to wearable accessories. The\ndata can be used to evaluate audio capture and array processing systems using\nwearable devices such as hearing aids, headphones, eyeglasses, jewelry, and\nclothing. We analyze the acoustic transfer functions of different parts of the\nbody, measure the effects of clothing worn over microphones, compare\nmeasurements from a live human subject to those from a mannequin, and simulate\nthe noise-reduction performance of several beamformers. The results suggest\nthat arrays of microphones spread across the body are more effective than those\nconfined to a single device.", "published": "2019-03-05 22:38:22", "link": "http://arxiv.org/abs/1903.02094v1", "categories": ["eess.AS", "cs.SD"], "primary_category": "eess.AS"}
