{"title": "Addressing Objects and Their Relations: The Conversational Entity\n  Dialogue Model", "abstract": "Statistical spoken dialogue systems usually rely on a single- or multi-domain\ndialogue model that is restricted in its capabilities of modelling complex\ndialogue structures, e.g., relations. In this work, we propose a novel dialogue\nmodel that is centred around entities and is able to model relations as well as\nmultiple entities of the same type. We demonstrate in a prototype\nimplementation benefits of relation modelling on the dialogue level and show\nthat a trained policy using these relations outperforms the multi-domain\nbaseline. Furthermore, we show that by modelling the relations on the dialogue\nlevel, the system is capable of processing relations present in the user input\nand even learns to address them in the system response.", "published": "2019-01-05 20:27:19", "link": "http://arxiv.org/abs/1901.01466v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Sum-of-square-of-rational-function based representations of positive\n  semidefinite polynomial matrices", "abstract": "The paper proves sum-of-square-of-rational-function based representations\n(shortly, sosrf-based representations) of polynomial matrices that are positive\nsemidefinite on some special sets: $\\mathbb{R}^n;$ $\\mathbb{R}$ and its\nintervals $[a,b]$, $[0,\\infty)$; and the strips $[a,b] \\times \\mathbb{R}\n\\subset \\mathbb{R}^2.$ A method for numerically computing such representations\nis also presented. The methodology is divided into two stages:\n  (S1) diagonalizing the initial polynomial matrix based on the Schm\\\"{u}dgen's\nprocedure \\cite{Schmudgen09};\n  (S2) for each diagonal element of the resulting matrix, find its low rank\nsosrf-representation satisfying the Artin's theorem solving the Hilbert's 17th\nproblem.\n  Some numerical tests and illustrations with \\textsf{OCTAVE} are also\npresented for each type of polynomial matrices.", "published": "2019-01-05 23:34:29", "link": "http://arxiv.org/abs/1901.02360v2", "categories": ["math.OC", "cs.CL", "68U01, 68U20"], "primary_category": "math.OC"}
{"title": "Quantum-theoretic Modeling in Computer Science A complex Hilbert space\n  model for entangled concepts in corpuses of documents", "abstract": "We work out a quantum-theoretic model in complex Hilbert space of a recently\nperformed test on co-occurrencies of two concepts and their combination in\nretrieval processes on specific corpuses of documents. The test violated the\nClauser-Horne-Shimony-Holt version of the Bell inequalities ('CHSH\ninequality'), thus indicating the presence of entanglement between the combined\nconcepts. We make use of a recently elaborated 'entanglement scheme' and\nrepresent the collected data in the tensor product of Hilbert spaces of the\nindividual concepts, showing that the identified violation is due to the\noccurrence of a strong form of entanglement, involving both states and\nmeasurements and reflecting the meaning connection between the component\nconcepts. These results provide a significant confirmation of the presence of\nquantum structures in corpuses of documents, like it is the case for the\nentanglement identified in human cognition.", "published": "2019-01-05 20:33:28", "link": "http://arxiv.org/abs/1901.04299v1", "categories": ["cs.CL", "quant-ph"], "primary_category": "cs.CL"}
{"title": "Fake News Detection via NLP is Vulnerable to Adversarial Attacks", "abstract": "News plays a significant role in shaping people's beliefs and opinions. Fake\nnews has always been a problem, which wasn't exposed to the mass public until\nthe past election cycle for the 45th President of the United States. While\nquite a few detection methods have been proposed to combat fake news since\n2015, they focus mainly on linguistic aspects of an article without any fact\nchecking. In this paper, we argue that these models have the potential to\nmisclassify fact-tampering fake news as well as under-written real news.\nThrough experiments on Fakebox, a state-of-the-art fake news detector, we show\nthat fact tampering attacks can be effective. To address these weaknesses, we\nargue that fact checking should be adopted in conjunction with linguistic\ncharacteristics analysis, so as to truly separate fake news from real news. A\ncrowdsourced knowledge graph is proposed as a straw man solution to collecting\ntimely facts about news events.", "published": "2019-01-05 11:56:13", "link": "http://arxiv.org/abs/1901.09657v1", "categories": ["cs.SI", "cs.CL", "cs.LG"], "primary_category": "cs.SI"}
{"title": "Improving noise robustness of automatic speech recognition via parallel\n  data and teacher-student learning", "abstract": "For real-world speech recognition applications, noise robustness is still a\nchallenge. In this work, we adopt the teacher-student (T/S) learning technique\nusing a parallel clean and noisy corpus for improving automatic speech\nrecognition (ASR) performance under multimedia noise. On top of that, we apply\na logits selection method which only preserves the k highest values to prevent\nwrong emphasis of knowledge from the teacher and to reduce bandwidth needed for\ntransferring data. We incorporate up to 8000 hours of untranscribed data for\ntraining and present our results on sequence trained models apart from cross\nentropy trained ones. The best sequence trained student model yields relative\nword error rate (WER) reductions of approximately 10.1%, 28.7% and 19.6% on our\nclean, simulated noisy and real test sets respectively comparing to a sequence\ntrained teacher.", "published": "2019-01-05 06:22:40", "link": "http://arxiv.org/abs/1901.02348v3", "categories": ["eess.AS", "cs.CL", "cs.LG", "cs.SD", "stat.ML"], "primary_category": "eess.AS"}
{"title": "AVA-ActiveSpeaker: An Audio-Visual Dataset for Active Speaker Detection", "abstract": "Active speaker detection is an important component in video analysis\nalgorithms for applications such as speaker diarization, video re-targeting for\nmeetings, speech enhancement, and human-robot interaction. The absence of a\nlarge, carefully labeled audio-visual dataset for this task has constrained\nalgorithm evaluations with respect to data diversity, environments, and\naccuracy. This has made comparisons and improvements difficult. In this paper,\nwe present the AVA Active Speaker detection dataset (AVA-ActiveSpeaker) that\nwill be released publicly to facilitate algorithm development and enable\ncomparisons. The dataset contains temporally labeled face tracks in video,\nwhere each face instance is labeled as speaking or not, and whether the speech\nis audible. This dataset contains about 3.65 million human labeled frames or\nabout 38.5 hours of face tracks, and the corresponding audio. We also present a\nnew audio-visual approach for active speaker detection, and analyze its\nperformance, demonstrating both its strength and the contributions of the\ndataset.", "published": "2019-01-05 00:01:06", "link": "http://arxiv.org/abs/1901.01342v2", "categories": ["cs.CV", "cs.MM", "cs.SD", "eess.AS"], "primary_category": "cs.CV"}
