{"title": "Understanding Composition of Word Embeddings via Tensor Decomposition", "abstract": "Word embedding is a powerful tool in natural language processing. In this paper we consider the problem of word embedding composition \\--- given vector representations of two words, compute a vector for the entire phrase. We give a generative model that can capture specific syntactic relations between words. Under our model, we prove that the correlations between three words (measured by their PMI) form a tensor that has an approximate low rank Tucker decomposition. The result of the Tucker decomposition gives the word embeddings as well as a core tensor, which can be used to produce better compositions of the word embeddings. We also complement our theoretical results with experiments that verify our assumptions, and demonstrate the effectiveness of the new composition method.", "published": "2019-02-02 01:34:56", "link": "http://arxiv.org/abs/1902.00613v1", "categories": ["cs.LG", "cs.CL", "stat.ML"], "primary_category": "cs.LG"}
{"title": "A copula based Markov Reward approach to the credit spread in European Union", "abstract": "In this paper, we propose a methodology based on piece-wise homogeneous Markov chain for credit ratings and a multivariate model of the credit spreads to evaluate the financial risk in European Union (EU). Two main aspects are considered: how the financial risk is distributed among the European countries and how large is the value of the total risk. The first aspect is evaluated by means of the expected value of a dynamic entropy measure. The second one is solved by computing the evolution of the total credit spread over time. Moreover, the covariance between countries' total spread allows understand any contagions in EU. The methodology is applied to real data of 24 countries for the three major agencies: Moody's, Standard and Poor's, and Fitch. Obtained results suggest that both the financial risk inequality and the value of the total risk increase over time at a different rate depending on the rating agency and that the dependence structure is characterized by a strong correlation between most of European countries.", "published": "2019-02-02 11:00:33", "link": "http://arxiv.org/abs/1902.00691v1", "categories": ["q-fin.CP", "q-fin.RM"], "primary_category": "q-fin.CP"}
