{"title": "The CUED's Grammatical Error Correction Systems for BEA-2019", "abstract": "We describe two entries from the Cambridge University Engineering Department\nto the BEA 2019 Shared Task on grammatical error correction. Our submission to\nthe low-resource track is based on prior work on using finite state transducers\ntogether with strong neural language models. Our system for the restricted\ntrack is a purely neural system consisting of neural language models and neural\nmachine translation models trained with back-translation and a combination of\ncheckpoint averaging and fine-tuning -- without the help of any additional\ntools like spell checkers. The latter system has been used inside a separate\nsystem combination entry in cooperation with the Cambridge University Computer\nLab.", "published": "2019-06-29 09:00:45", "link": "http://arxiv.org/abs/1907.00168v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Empirical Evaluation of Sequence-to-Sequence Models for Word Discovery\n  in Low-resource Settings", "abstract": "Since Bahdanau et al. [1] first introduced attention for neural machine\ntranslation, most sequence-to-sequence models made use of attention mechanisms\n[2, 3, 4]. While they produce soft-alignment matrices that could be interpreted\nas alignment between target and source languages, we lack metrics to quantify\ntheir quality, being unclear which approach produces the best alignments. This\npaper presents an empirical evaluation of 3 main sequence-to-sequence models\n(CNN, RNN and Transformer-based) for word discovery from unsegmented phoneme\nsequences. This task consists in aligning word sequences in a source language\nwith phoneme sequences in a target language, inferring from it word\nsegmentation on the target side [5]. Evaluating word segmentation quality can\nbe seen as an extrinsic evaluation of the soft-alignment matrices produced\nduring training. Our experiments in a low-resource scenario on Mboshi and\nEnglish languages (both aligned to French) show that RNNs surprisingly\noutperform CNNs and Transformer for this task. Our results are confirmed by an\nintrinsic evaluation of alignment quality through the use of Average Normalized\nEntropy (ANE). Lastly, we improve our best word discovery model by using an\nalignment entropy confidence measure that accumulates ANE over all the\noccurrences of a given alignment pair in the collection.", "published": "2019-06-29 11:47:22", "link": "http://arxiv.org/abs/1907.00184v2", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Latent Variable Sentiment Grammar", "abstract": "Neural models have been investigated for sentiment classification over\nconstituent trees. They learn phrase composition automatically by encoding tree\nstructures but do not explicitly model sentiment composition, which requires to\nencode sentiment class labels. To this end, we investigate two formalisms with\ndeep sentiment representations that capture sentiment subtype expressions by\nlatent variables and Gaussian mixture vectors, respectively. Experiments on\nStanford Sentiment Treebank (SST) show the effectiveness of sentiment grammar\nover vanilla neural encoders. Using ELMo embeddings, our method gives the best\nresults on this benchmark.", "published": "2019-06-29 15:15:16", "link": "http://arxiv.org/abs/1907.00218v2", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "GPT-based Generation for Classical Chinese Poetry", "abstract": "We present a simple yet effective method for generating high quality\nclassical Chinese poetry with Generative Pre-trained Language Model (GPT). The\nmethod adopts a simple GPT model, without using any human crafted rules or\nfeatures, or designing any additional neural components. While the proposed\nmodel learns to generate various forms of classical Chinese poems, including\nJueju, L\\\"{u}shi, various Cipai and Couples, the generated poems are of very\nhigh quality. We also propose and implement a method to fine-tune the model to\ngenerate acrostic poetry. To the best of our knowledge, this is the first to\nemploy GPT in developing a poetry generation system. We have released an online\nmini demonstration program on Wechat to show the generation capability of the\nproposed method for classical Chinese poetry.", "published": "2019-06-29 06:04:48", "link": "http://arxiv.org/abs/1907.00151v5", "categories": ["cs.CL", "cs.AI"], "primary_category": "cs.CL"}
{"title": "Progressive Fashion Attribute Extraction", "abstract": "Extracting fashion attributes from images of people wearing clothing/fashion\naccessories is a very hard multi-class classification problem. Most often, even\ncatalogues of fashion do not have all the fine-grained attributes tagged due to\nprohibitive cost of annotation. Using images of fashion articles, running\nmulti-class attribute extraction with a single model for all kinds of\nattributes (neck design detailing, sleeves detailing, etc) requires classifiers\nthat are robust to missing and ambiguously labelled data. In this work, we\npropose a progressive training approach for such multi-class classification,\nwhere weights learnt from an attribute are fine tuned for another attribute of\nthe same fashion article (say, dresses). We branch networks for each attributes\nfrom a base network progressively during training. While it may have many\nlabels, an image doesn't need to have all possible labels for fashion articles\npresent in it. We also compare our approach to multi-label classification, and\ndemonstrate improvements over overall classification accuracies using our\napproach.", "published": "2019-06-29 06:51:34", "link": "http://arxiv.org/abs/1907.00157v1", "categories": ["cs.LG", "cs.CL", "cs.CV", "cs.IR"], "primary_category": "cs.LG"}
{"title": "Fake News Detection using Stance Classification: A Survey", "abstract": "This paper surveys and presents recent academic work carried out within the\nfield of stance classification and fake news detection. Echo chambers and the\nmodel organism problem are examples that pose challenges to acquire data with\nhigh quality, due to opinions being polarised in microblogs. Nevertheless it is\nshown that several machine learning approaches achieve promising results in\nclassifying stance. Some use crowd stance for fake news detection, such as the\napproach in [Dungs et al., 2018] using Hidden Markov Models. Furthermore\nfeature engineering have significant importance in several approaches, which is\nshown in [Aker et al., 2017]. This paper additionally includes a proposal of a\nsystem implementation based on the presented survey.", "published": "2019-06-29 11:00:22", "link": "http://arxiv.org/abs/1907.00181v1", "categories": ["cs.CL", "cs.CY", "cs.SI", "I.2.7"], "primary_category": "cs.CL"}
