{"title": "Knowledge-based Conversational Search", "abstract": "Conversational interfaces that allow for intuitive and comprehensive access to digitally stored information remain an ambitious goal. In this thesis, we lay foundations for designing conversational search systems by analyzing the requirements and proposing concrete solutions for automating some of the basic components and tasks that such systems should support. We describe several interdependent studies that were conducted to analyse the design requirements for more advanced conversational search systems able to support complex human-like dialogue interactions and provide access to vast knowledge repositories. In the first two research chapters, we focus on analyzing the structures common to information-seeking dialogues by capturing recurrent patterns in terms of both domain-independent functional relations between utterances as well as domain-specific implicit semantic relations from shared background knowledge.\n  Our results show that question answering is one of the key components required for efficient information access but it is not the only type of dialogue interactions that a conversational search system should support. In the third research chapter, we propose a novel approach for complex question answering from a knowledge graph that surpasses the current state-of-the-art results in terms of both efficacy and efficiency. In the last research chapter, we turn our attention towards an alternative interaction mode, which we termed conversational browsing, in which, unlike question answering, the conversational system plays a more pro-active role in the course of a dialogue interaction. We show that this approach helps users to discover relevant items that are difficult to retrieve using only question answering due to the vocabulary mismatch problem.", "published": "2019-12-14 14:59:38", "link": "http://arxiv.org/abs/1912.06859v1", "categories": ["cs.IR", "cs.CL"], "primary_category": "cs.IR"}
{"title": "Gauge transformations in the dual space, and pricing and estimation in the long run in affine jump-diffusion models", "abstract": "We suggest a simple reduction of pricing European options in affine jump-diffusion models to pricing options with modified payoffs in diffusion models. The procedure is based on the conjugation of the infinitesimal generator of the model with an operator of the form $e^{iΦ(-i\\dd_x)}$ (gauge transformation in the dual space). A general procedure for the calculation of the function $Φ$ is given, with examples. As applications, we consider pricing in jump-diffusion models and their subordinated versions using the eigenfunction expansion technique, and estimation of the extremely rare jumps component. The beliefs of the market about yet unobserved extreme jumps and pricing kernel can be recovered: the market prices allow one to see \"the shape of things to come\".", "published": "2019-12-14 23:41:10", "link": "http://arxiv.org/abs/1912.06948v2", "categories": ["q-fin.CP", "q-fin.MF"], "primary_category": "q-fin.CP"}
