{"title": "Beyond Personalization: Social Content Recommendation for Creator Equality and Consumer Satisfaction", "abstract": "An effective content recommendation in modern social media platforms should benefit both creators to bring genuine benefits to them and consumers to help them get really interesting content. In this paper, we propose a model called Social Explorative Attention Network (SEAN) for content recommendation. SEAN uses a personalized content recommendation model to encourage personal interests driven recommendation. Moreover, SEAN allows the personalization factors to attend to users' higher-order friends on the social network to improve the accuracy and diversity of recommendation results. Constructing two datasets from a popular decentralized content distribution platform, Steemit, we compare SEAN with state-of-the-art CF and content based recommendation approaches. Experimental results demonstrate the effectiveness of SEAN in terms of both Gini coefficients for recommendation equality and F1 scores for recommendation performance.", "published": "2019-05-28 15:55:47", "link": "http://arxiv.org/abs/1905.11900v3", "categories": ["cs.IR", "cs.SI"], "primary_category": "cs.IR"}
{"title": "A Parameterized Perspective on Protecting Elections", "abstract": "We study the parameterized complexity of the optimal defense and optimal attack problems in voting. In both the problems, the input is a set of voter groups (every voter group is a set of votes) and two integers $k_a$ and $k_d$ corresponding to respectively the number of voter groups the attacker can attack and the number of voter groups the defender can defend. A voter group gets removed from the election if it is attacked but not defended. In the optimal defense problem, we want to know if it is possible for the defender to commit to a strategy of defending at most $k_d$ voter groups such that, no matter which $k_a$ voter groups the attacker attacks, the outcome of the election does not change. In the optimal attack problem, we want to know if it is possible for the attacker to commit to a strategy of attacking $k_a$ voter groups such that, no matter which $k_d$ voter groups the defender defends, the outcome of the election is always different from the original (without any attack) one.", "published": "2019-05-28 14:20:33", "link": "http://arxiv.org/abs/1905.11838v1", "categories": ["cs.MA", "cs.AI", "cs.CY", "cs.DS", "cs.GT"], "primary_category": "cs.MA"}
