{"title": "Diagnosis of Diabetic Retinopathy in Ethiopia: Before the Deep Learning based Automation", "abstract": "Introducing automated Diabetic Retinopathy (DR) diagnosis into Ethiopia is still a challenging task, despite recent reports that present trained Deep Learning (DL) based DR classifiers surpassing manual graders. This is mainly because of the expensive cost of conventional retinal imaging devices used in DL based classifiers. Current approaches that provide mobile based binary classification of DR, and the way towards a cheaper and offline multi-class classification of DR will be discussed in this paper.", "published": "2020-03-20 11:41:28", "link": "http://arxiv.org/abs/2003.09208v2", "categories": ["eess.IV", "cs.CV", "cs.LG"], "primary_category": "eess.IV"}
{"title": "Adversarial Robustness on In- and Out-Distribution Improves Explainability", "abstract": "Neural networks have led to major improvements in image classification but suffer from being non-robust to adversarial changes, unreliable uncertainty estimates on out-distribution samples and their inscrutable black-box decisions. In this work we propose RATIO, a training procedure for Robustness via Adversarial Training on In- and Out-distribution, which leads to robust models with reliable and robust confidence estimates on the out-distribution. RATIO has similar generative properties to adversarial training so that visual counterfactuals produce class specific features. While adversarial training comes at the price of lower clean accuracy, RATIO achieves state-of-the-art $l_2$-adversarial robustness on CIFAR10 and maintains better clean accuracy.", "published": "2020-03-20 18:57:52", "link": "http://arxiv.org/abs/2003.09461v2", "categories": ["cs.LG", "cs.CV", "stat.ML"], "primary_category": "cs.LG"}
{"title": "Power Assisted Trend Following", "abstract": "'The trend is your friend' is a common saying, the difficulty lies in determining if and when you are in a trend. Is the trend strong enough to trade? When does the trend reverse and how are you going to determine this? We will try and answer at least some of these questions here. We are deriving a novel indicator to measure the power of a trend using digital signal processing techniques, separating the Signal from the Noise. We apply these to examples as well as real data and evaluate the accuracy of these and the relation to PNL performance of the 'Volatility Index' trend following algorithm devised by J. Welles Wilder Jr. in 1978.", "published": "2020-03-20 14:38:21", "link": "http://arxiv.org/abs/2003.09298v1", "categories": ["q-fin.TR", "eess.SP", "q-fin.CP", "q-fin.MF"], "primary_category": "q-fin.TR"}
{"title": "Hardware-Software Codesign for Software Defined Radio: IEEE 802.11p receiver case study", "abstract": "Software Defined Radio (SDR) platforms are useful tools to design new wireless technologies or to improve specifications of existing ones. The IEEE 802.11p is the de-facto standard for Wireless Vehicular Ad-hoc NETworks (VANETs). It has been implemented on GNU Radio SDR [1], which experiences frames decoding/encoding latency. In this paper an FPGA based SDR is proposed as a solution to accelerate frame decoding of IEEE 802.11p waveforms. We share our experience in designing and validating an SDR on the top of real FPGA based embedded hardware architecture. On the top of an FPGA Zynq platform, we port an SDR GNU Radio following hardware/software (HW/SW) codesign approach. A real time profiling of the SDR system shows that the OFDM equalizer with FFT software function is the most time consuming task of the whole SDR receiver functions (34.74%). We suggest hardware acceleration of the FFT processing function using the free logic gates of the FPGA Zynq as a Hardware (HW) accelerator. The HW OFDM Equalizer with FFT sub-function could accelerate the SDR chain processing in comparison with a pure software implementation. Our FPGA based SDR design is a key step toward proposing an embedded SDR. It would be an alternative for not only the IEEE 802.11p standard but for any OFDM based SDR.", "published": "2020-03-20 22:53:21", "link": "http://arxiv.org/abs/2003.09525v2", "categories": ["eess.SP"], "primary_category": "eess.SP"}
