{"title": "A Comprehensive Dictionary and Term Variation Analysis for COVID-19 and SARS-CoV-2", "abstract": "The number of unique terms in the scientific literature used to refer to either SARS-CoV-2 or COVID-19 is remarkably large and has continued to increase rapidly despite well-established standardized terms. This high degree of term variation makes high recall identification of these important entities difficult. In this manuscript we present an extensive dictionary of terms used in the literature to refer to SARS-CoV-2 and COVID-19. We use a rule-based approach to iteratively generate new term variants, then locate these variants in a large text corpus. We compare our dictionary to an extensive collection of terminological resources, demonstrating that our resource provides a substantial number of additional terms. We use our dictionary to analyze the usage of SARS-CoV-2 and COVID-19 terms over time and show that the number of unique terms continues to grow rapidly. Our dictionary is freely available at https://github.com/ncbi-nlp/CovidTermVar.", "published": "2020-10-27 19:51:53", "link": "http://arxiv.org/abs/2010.14588v1", "categories": ["cs.DL", "cs.CL"], "primary_category": "cs.DL"}
{"title": "Co-attentional Transformers for Story-Based Video Understanding", "abstract": "Inspired by recent trends in vision and language learning, we explore applications of attention mechanisms for visio-lingual fusion within an application to story-based video understanding. Like other video-based QA tasks, video story understanding requires agents to grasp complex temporal dependencies. However, as it focuses on the narrative aspect of video it also requires understanding of the interactions between different characters, as well as their actions and their motivations. We propose a novel co-attentional transformer model to better capture long-term dependencies seen in visual stories such as dramas and measure its performance on the video question answering task. We evaluate our approach on the recently introduced DramaQA dataset which features character-centered video story understanding questions. Our model outperforms the baseline model by 8 percentage points overall, at least 4.95 and up to 12.8 percentage points on all difficulty levels and manages to beat the winner of the DramaQA challenge.", "published": "2020-10-27 07:17:09", "link": "http://arxiv.org/abs/2010.14104v1", "categories": ["cs.CV", "cs.AI", "cs.CL"], "primary_category": "cs.CV"}
{"title": "Succinct and Robust Multi-Agent Communication With Temporal Message Control", "abstract": "Recent studies have shown that introducing communication between agents can significantly improve overall performance in cooperative Multi-agent reinforcement learning (MARL). However, existing communication schemes often require agents to exchange an excessive number of messages at run-time under a reliable communication channel, which hinders its practicality in many real-world situations. In this paper, we present \\textit{Temporal Message Control} (TMC), a simple yet effective approach for achieving succinct and robust communication in MARL. TMC applies a temporal smoothing technique to drastically reduce the amount of information exchanged between agents. Experiments show that TMC can significantly reduce inter-agent communication overhead without impacting accuracy. Furthermore, TMC demonstrates much better robustness against transmission loss than existing approaches in lossy networking environments.", "published": "2020-10-27 15:55:08", "link": "http://arxiv.org/abs/2010.14391v2", "categories": ["cs.AI", "cs.LG", "cs.MA"], "primary_category": "cs.AI"}
{"title": "Fit to Measure: Reasoning about Sizes for Robust Object Recognition", "abstract": "Service robots can help with many of our daily tasks, especially in those cases where it is inconvenient or unsafe for us to intervene: e.g., under extreme weather conditions or when social distance needs to be maintained. However, before we can successfully delegate complex tasks to robots, we need to enhance their ability to make sense of dynamic, real world environments. In this context, the first prerequisite to improving the Visual Intelligence of a robot is building robust and reliable object recognition systems. While object recognition solutions are traditionally based on Machine Learning methods, augmenting them with knowledge based reasoners has been shown to improve their performance. In particular, based on our prior work on identifying the epistemic requirements of Visual Intelligence, we hypothesise that knowledge of the typical size of objects could significantly improve the accuracy of an object recognition system. To verify this hypothesis, in this paper we present an approach to integrating knowledge about object sizes in a ML based architecture. Our experiments in a real world robotic scenario show that this combined approach ensures a significant performance increase over state of the art Machine Learning methods.", "published": "2020-10-27 13:54:37", "link": "http://arxiv.org/abs/2010.14296v1", "categories": ["cs.RO", "cs.AI", "cs.CV", "cs.LG"], "primary_category": "cs.RO"}
{"title": "The item selection problem for user cold-start recommendation", "abstract": "When a new user just signs up on a website, we usually have no information about him/her, i.e. no interaction with items, no user profile and no social links with other users. Under such circumstances, we still expect our recommender systems could attract the users at the first time so that the users decide to stay on the website and become active users. This problem falls into new user cold-start category and it is crucial to the development and even survival of a company. Existing works on user cold-start recommendation either require additional user efforts, e.g. setting up an interview process, or make use of side information [10] such as user demographics, locations, social relations, etc. However, users may not be willing to take the interview and side information on cold-start users is usually not available. Therefore, we consider a pure cold-start scenario where neither interaction nor side information is available and no user effort is required. Studying this setting is also important for the initialization of other cold-start solutions, such as initializing the first few questions of an interview.", "published": "2020-10-27 02:48:26", "link": "http://arxiv.org/abs/2010.14013v1", "categories": ["cs.IR", "cs.LG", "cs.SI"], "primary_category": "cs.IR"}
{"title": "McKean-Vlasov equations involving hitting times: blow-ups and global solvability", "abstract": "This paper is concerned with the analysis of blow-ups for two McKean-Vlasov equations involving hitting times. Let $(B(t); \\, t \\ge 0)$ be standard Brownian motion, and $τ:= \\inf\\{t \\ge 0: X(t) \\le 0\\}$ be the hitting time to zero of a given process $X$. The first equation is $X(t) = X(0) + B(t) - α\\mathbb{P}(τ\\le t)$. We provide a simple condition on $α$ and the distribution of $X(0)$ such that the corresponding Fokker-Planck equation has no blow-up, and thus the McKean-Vlasov dynamics is well-defined for all time $t \\ge 0$. Our approach relies on a connection between the McKean-Vlasov equation and the supercooled Stefan problem, as well as several comparison principles. The second equation is $X(t) = X(0) + βt + B(t) + α\\log \\mathbb{P}(τ> t)$, whose Fokker-Planck equation is non-local. We prove that for $β> 0$ sufficiently large and $α$ no greater than a sufficiently small positive constant, there is no blow-up and the McKean-Vlasov dynamics is well-defined for all time $t \\ge 0$. The argument is based on a new transform, which removes the non-local term, followed by a relative entropy analysis.", "published": "2020-10-27 22:18:32", "link": "http://arxiv.org/abs/2010.14646v3", "categories": ["math.PR", "math-ph", "math.AP", "q-fin.MF"], "primary_category": "math.PR"}
{"title": "Acoustic echo cancellation with the dual-signal transformation LSTM network", "abstract": "This paper applies the dual-signal transformation LSTM network (DTLN) to the task of real-time acoustic echo cancellation (AEC). The DTLN combines a short-time Fourier transformation and a learned feature representation in a stacked network approach, which enables robust information processing in the time-frequency and in the time domain, which also includes phase information. The model is only trained on 60~h of real and synthetic echo scenarios. The training setup includes multi-lingual speech, data augmentation, additional noise and reverberation to create a model that should generalize well to a large variety of real-world conditions. The DTLN approach produces state-of-the-art performance on clean and noisy echo conditions reducing acoustic echo and additional noise robustly. The method outperforms the AEC-Challenge baseline by 0.30 in terms of Mean Opinion Score (MOS).", "published": "2020-10-27 14:54:04", "link": "http://arxiv.org/abs/2010.14337v2", "categories": ["eess.AS"], "primary_category": "eess.AS"}
{"title": "Phase Aware Speech Enhancement using Realisation of Complex-valued LSTM", "abstract": "Most of the deep learning based speech enhancement (SE) methods rely on estimating the magnitude spectrum of the clean speech signal from the observed noisy speech signal, either by magnitude spectral masking or regression. These methods reuse the noisy phase while synthesizing the time-domain waveform from the estimated magnitude spectrum. However, there have been recent works highlighting the importance of phase in SE. There was an attempt to estimate the complex ratio mask taking phase into account using complex-valued feed-forward neural network (FFNN). But FFNNs cannot capture the sequential information essential for phase estimation. In this work, we propose a realisation of complex-valued long short-term memory (RCLSTM) network to estimate the complex ratio mask (CRM) using sequential information along time. The proposed RCLSTM is designed to process the complex-valued sequences using complex arithmetic, and hence it preserves the dependencies between the real and imaginary parts of CRM and thereby the phase. The proposed method is evaluated on the noisy speech mixtures formed from the Voice-Bank corpus and DEMAND database. When compared to real value based masking methods, the proposed RCLSTM improves over them in several objective measures including perceptual evaluation of speech quality (PESQ), in which it improves by over 4.3%", "published": "2020-10-27 08:16:58", "link": "http://arxiv.org/abs/2010.14122v1", "categories": ["eess.AS", "cs.AI", "eess.SP"], "primary_category": "eess.AS"}
{"title": "Millimeter-wave Multi-mode Circular Antenna Array for Uni-cast Multi-cast and OAM Communication", "abstract": "This paper investigates multi-mode and orbital angular momentum (OAM) mode data transmission techniques by a using a circular antenna array, operating at 28 GHz. The classical mode excitation of the latter is modified such that in the horizontal plane the antenna array operates as multimode transmitter (i.e., it provides broad- , uni- and/or multi-cast transmission), while in the vertical direction OAM transmission occurs: this dual-functionality by a single antenna-array at 28 GHz is presented for the first time. Specifically, it can transmit/receive in either broad-, uni-, multi-cast mode in the horizontal plane and also, it is capable of generating up to 15 spatially orthogonal OAM modes in the vertical direction. The proposed circular array is designed using twelve, low-complexity, multi-layer microstrip patch antennas with high radiation efficiency. It was tested through full electromagnetic analysis in terms of impedance matching, mutual coupling and radiation pattern. It was, also, fabricated and measured: good agreement between simulated and measurement results was observed. The proposed antenna array is perfect candidate for high spectral efficiency data transmission for 5G and beyond wireless applications.", "published": "2020-10-27 15:26:54", "link": "http://arxiv.org/abs/2010.16049v1", "categories": ["eess.SP"], "primary_category": "eess.SP"}
