{"title": "Rethinking Dialogue State Tracking with Reasoning", "abstract": "Tracking dialogue states to better interpret user goals and feed downstream policy learning is a bottleneck in dialogue management. Common practice has been to treat it as a problem of classifying dialogue content into a set of pre-defined slot-value pairs, or generating values for different slots given the dialogue history. Both have limitations on considering dependencies that occur on dialogues, and are lacking of reasoning capabilities. This paper proposes to track dialogue states gradually with reasoning over dialogue turns with the help of the back-end data. Empirical results demonstrate that our method significantly outperforms the state-of-the-art methods by 38.6% in terms of joint belief accuracy for MultiWOZ 2.1, a large-scale human-human dialogue dataset across multiple domains.", "published": "2020-05-27 02:05:33", "link": "http://arxiv.org/abs/2005.13129v2", "categories": ["cs.AI"], "primary_category": "cs.AI"}
{"title": "Benchmarking Differentially Private Residual Networks for Medical Imagery", "abstract": "In this paper we measure the effectiveness of $ε$-Differential Privacy (DP) when applied to medical imaging. We compare two robust differential privacy mechanisms: Local-DP and DP-SGD and benchmark their performance when analyzing medical imagery records. We analyze the trade-off between the model's accuracy and the level of privacy it guarantees, and also take a closer look to evaluate how useful these theoretical privacy guarantees actually prove to be in the real world medical setting.", "published": "2020-05-27 00:29:56", "link": "http://arxiv.org/abs/2005.13099v5", "categories": ["cs.LG", "cs.CR", "cs.CV", "eess.IV", "stat.ML"], "primary_category": "cs.LG"}
{"title": "Time-Independent Planning for Multiple Moving Agents", "abstract": "Typical Multi-agent Path Finding (MAPF) solvers assume that agents move synchronously, thus neglecting the reality gap in timing assumptions, e.g., delays caused by an imperfect execution of asynchronous moves. So far, two policies enforce a robust execution of MAPF plans taken as input: either by forcing agents to synchronize or by executing plans while preserving temporal dependencies. This paper proposes an alternative approach, called time-independent planning, which is both online and distributed. We represent reality as a transition system that changes configurations according to atomic actions of agents, and use it to generate a time-independent schedule. Empirical results in a simulated environment with stochastic delays of agents' moves support the validity of our proposal.", "published": "2020-05-27 06:16:15", "link": "http://arxiv.org/abs/2005.13187v3", "categories": ["cs.MA", "cs.RO"], "primary_category": "cs.MA"}
{"title": "More Robust Pricing of European Options Based on Fourier Cosine Series Expansions", "abstract": "We present an alternative formula to price European options through cosine series expansions, under models with a known characteristic function such as the Heston stochastic volatility model. It is more robust across strikes and as fast as the original COS method.", "published": "2020-05-27 09:14:58", "link": "http://arxiv.org/abs/2005.13248v2", "categories": ["q-fin.CP"], "primary_category": "q-fin.CP"}
{"title": "Modality Dropout for Improved Performance-driven Talking Faces", "abstract": "We describe our novel deep learning approach for driving animated faces using both acoustic and visual information. In particular, speech-related facial movements are generated using audiovisual information, and non-speech facial movements are generated using only visual information. To ensure that our model exploits both modalities during training, batches are generated that contain audio-only, video-only, and audiovisual input features. The probability of dropping a modality allows control over the degree to which the model exploits audio and visual information during training. Our trained model runs in real-time on resource limited hardware (e.g.\\ a smart phone), it is user agnostic, and it is not dependent on a potentially error-prone transcription of the speech. We use subjective testing to demonstrate: 1) the improvement of audiovisual-driven animation over the equivalent video-only approach, and 2) the improvement in the animation of speech-related facial movements after introducing modality dropout. Before introducing dropout, viewers prefer audiovisual-driven animation in 51% of the test sequences compared with only 18% for video-driven. After introducing dropout viewer preference for audiovisual-driven animation increases to 74%, but decreases to 8% for video-only.", "published": "2020-05-27 19:55:33", "link": "http://arxiv.org/abs/2005.13616v1", "categories": ["eess.AS", "cs.LG", "cs.SD", "stat.ML"], "primary_category": "eess.AS"}
{"title": "Investigating a Spectral Deception Loss Metric for Training Machine Learning-based Evasion Attacks", "abstract": "Adversarial evasion attacks have been very successful in causing poor performance in a wide variety of machine learning applications. One such application is radio frequency spectrum sensing. While evasion attacks have proven particularly successful in this area, they have done so at the detriment of the signal's intended purpose. More specifically, for real-world applications of interest, the resulting perturbed signal that is transmitted to evade an eavesdropper must not deviate far from the original signal, less the intended information is destroyed. Recent work by the authors and others has demonstrated an attack framework that allows for intelligent balancing between these conflicting goals of evasion and communication. However, while these methodologies consider creating adversarial signals that minimize communications degradation, they have been shown to do so at the expense of the spectral shape of the signal. This opens the adversarial signal up to defenses at the eavesdropper such as filtering, which could render the attack ineffective. To remedy this, this work introduces a new spectral deception loss metric that can be implemented during the training process to force the spectral shape to be more in-line with the original signal. As an initial proof of concept, a variety of methods are presented that provide a starting point for this proposed loss. Through performance analysis, it is shown that these techniques are effective in controlling the shape of the adversarial signal.", "published": "2020-05-27 02:02:03", "link": "http://arxiv.org/abs/2005.13124v1", "categories": ["eess.SP", "cs.LG"], "primary_category": "eess.SP"}
