{"title": "Graphs without gap-vertex-labellings: families and bounds", "abstract": "A proper labelling of a graph $G$ is a pair $(π,c_π)$ in which $π$ is an assignment of numeric labels to some elements of $G$, and $c_π$ is a colouring induced by $π$ through some mathematical function over the set of labelled elements. In this work, we consider gap-vertex-labellings, in which the colour of a vertex is determined by a function considering the largest difference between the labels assigned to its neighbours. We present the first upper-bound for the vertex-gap number of arbitrary graphs, which is the least number of labels required to properly label a graph. We investigate families of graphs which do not admit any gap-vertex-labelling, regardless of the number of labels. Furthermore, we introduce a novel parameter associated with this labelling and provide bounds for it for complete graphs ${K_n}$.", "published": "2020-07-02 22:52:10", "link": "http://arxiv.org/abs/2007.01431v1", "categories": ["cs.DM", "math.CO"], "primary_category": "cs.DM"}
{"title": "A fully data-driven approach to minimizing CVaR for portfolio of assets via SGLD with discontinuous updating", "abstract": "A new approach in stochastic optimization via the use of stochastic gradient Langevin dynamics (SGLD) algorithms, which is a variant of stochastic gradient decent (SGD) methods, allows us to efficiently approximate global minimizers of possibly complicated, high-dimensional landscapes. With this in mind, we extend here the non-asymptotic analysis of SGLD to the case of discontinuous stochastic gradients. We are thus able to provide theoretical guarantees for the algorithm's convergence in (standard) Wasserstein distances for both convex and non-convex objective functions. We also provide explicit upper estimates of the expected excess risk associated with the approximation of global minimizers of these objective functions. All these findings allow us to devise and present a fully data-driven approach for the optimal allocation of weights for the minimization of CVaR of portfolio of assets with complete theoretical guarantees for its performance. Numerical results illustrate our main findings.", "published": "2020-07-02 17:11:57", "link": "http://arxiv.org/abs/2007.01672v1", "categories": ["q-fin.PM", "math.OC", "math.PR", "math.ST", "q-fin.MF"], "primary_category": "q-fin.PM"}
