{"title": "MAIRE -- A Model-Agnostic Interpretable Rule Extraction Procedure for Explaining Classifiers", "abstract": "The paper introduces a novel framework for extracting model-agnostic human interpretable rules to explain a classifier's output. The human interpretable rule is defined as an axis-aligned hyper-cuboid containing the instance for which the classification decision has to be explained. The proposed procedure finds the largest (high \\textit{coverage}) axis-aligned hyper-cuboid such that a high percentage of the instances in the hyper-cuboid have the same class label as the instance being explained (high \\textit{precision}). Novel approximations to the coverage and precision measures in terms of the parameters of the hyper-cuboid are defined. They are maximized using gradient-based optimizers. The quality of the approximations is rigorously analyzed theoretically and experimentally. Heuristics for simplifying the generated explanations for achieving better interpretability and a greedy selection algorithm that combines the local explanations for creating global explanations for the model covering a large part of the instance space are also proposed. The framework is model agnostic, can be applied to any arbitrary classifier, and all types of attributes (including continuous, ordered, and unordered discrete). The wide-scale applicability of the framework is validated on a variety of synthetic and real-world datasets from different domains (tabular, text, and image).", "published": "2020-11-03 06:53:06", "link": "http://arxiv.org/abs/2011.01506v1", "categories": ["cs.AI", "cs.LG"], "primary_category": "cs.AI"}
{"title": "Simulating and classifying behavior in adversarial environments based on action-state traces: an application to money laundering", "abstract": "Many business applications involve adversarial relationships in which both sides adapt their strategies to optimize their opposing benefits. One of the key characteristics of these applications is the wide range of strategies that an adversary may choose as they adapt their strategy dynamically to sustain benefits and evade authorities. In this paper, we present a novel way of approaching these types of applications, in particular in the context of Anti-Money Laundering. We provide a mechanism through which diverse, realistic and new unobserved behavior may be generated to discover potential unobserved adversarial actions to enable organizations to preemptively mitigate these risks. In this regard, we make three main contributions. (a) Propose a novel behavior-based model as opposed to individual transactions-based models currently used by financial institutions. We introduce behavior traces as enriched relational representation to represent observed human behavior. (b) A modelling approach that observes these traces and is able to accurately infer the goals of actors by classifying the behavior into money laundering or standard behavior despite significant unobserved activity. And (c) a synthetic behavior simulator that can generate new previously unseen traces. The simulator incorporates a high level of flexibility in the behavioral parameters so that we can challenge the detection algorithm. Finally, we provide experimental results that show that the learning module (automated investigator) that has only partial observability can still successfully infer the type of behavior, and thus the simulated goals, followed by customers based on traces - a key aspiration for many applications today.", "published": "2020-11-03 16:30:53", "link": "http://arxiv.org/abs/2011.01826v1", "categories": ["cs.AI"], "primary_category": "cs.AI"}
{"title": "Minimax Pareto Fairness: A Multi Objective Perspective", "abstract": "In this work we formulate and formally characterize group fairness as a multi-objective optimization problem, where each sensitive group risk is a separate objective. We propose a fairness criterion where a classifier achieves minimax risk and is Pareto-efficient w.r.t. all groups, avoiding unnecessary harm, and can lead to the best zero-gap model if policy dictates so. We provide a simple optimization algorithm compatible with deep neural networks to satisfy these constraints. Since our method does not require test-time access to sensitive attributes, it can be applied to reduce worst-case classification errors between outcomes in unbalanced classification problems. We test the proposed methodology on real case-studies of predicting income, ICU patient mortality, skin lesions classification, and assessing credit risk, demonstrating how our framework compares favorably to other approaches.", "published": "2020-11-03 16:21:53", "link": "http://arxiv.org/abs/2011.01821v1", "categories": ["stat.ML", "cs.LG"], "primary_category": "stat.ML"}
{"title": "Graph Enhanced High Dimensional Kernel Regression", "abstract": "In this paper, the flexibility, versatility and predictive power of kernel regression are combined with now lavishly available network data to create regression models with even greater predictive performances. Building from previous work featuring generalized linear models built in the presence of network cohesion data, we construct a kernelized extension that captures subtler nonlinearities in extremely high dimensional spaces and also produces far better predictive performances. Applications of seamless yet substantial adaptation to simulated and real-life data demonstrate the appeal and strength of our work.", "published": "2020-11-03 20:09:36", "link": "http://arxiv.org/abs/2011.01990v1", "categories": ["stat.ML", "cs.LG"], "primary_category": "stat.ML"}
{"title": "Regularized spectral methods for clustering signed networks", "abstract": "We study the problem of $k$-way clustering in signed graphs. Considerable attention in recent years has been devoted to analyzing and modeling signed graphs, where the affinity measure between nodes takes either positive or negative values. Recently, Cucuringu et al. [CDGT 2019] proposed a spectral method, namely SPONGE (Signed Positive over Negative Generalized Eigenproblem), which casts the clustering task as a generalized eigenvalue problem optimizing a suitably defined objective function. This approach is motivated by social balance theory, where the clustering task aims to decompose a given network into disjoint groups, such that individuals within the same group are connected by as many positive edges as possible, while individuals from different groups are mainly connected by negative edges. Through extensive numerical simulations, SPONGE was shown to achieve state-of-the-art empirical performance. On the theoretical front, [CDGT 2019] analyzed SPONGE and the popular Signed Laplacian method under the setting of a Signed Stochastic Block Model (SSBM), for $k=2$ equal-sized clusters, in the regime where the graph is moderately dense.\n  In this work, we build on the results in [CDGT 2019] on two fronts for the normalized versions of SPONGE and the Signed Laplacian. Firstly, for both algorithms, we extend the theoretical analysis in [CDGT 2019] to the general setting of $k \\geq 2$ unequal-sized clusters in the moderately dense regime. Secondly, we introduce regularized versions of both methods to handle sparse graphs -- a regime where standard spectral methods underperform -- and provide theoretical guarantees under the same SSBM model. To the best of our knowledge, regularized spectral methods have so far not been considered in the setting of clustering signed graphs. We complement our theoretical results with an extensive set of numerical experiments on synthetic data.", "published": "2020-11-03 14:40:34", "link": "http://arxiv.org/abs/2011.01737v1", "categories": ["stat.ML", "cs.LG", "math.ST"], "primary_category": "stat.ML"}
{"title": "Dynamic latency speech recognition with asynchronous revision", "abstract": "In this work we propose an inference technique, asynchronous revision, to unify streaming and non-streaming speech recognition models. Specifically, we achieve dynamic latency with only one model by using arbitrary right context during inference. The model is composed of a stack of convolutional layers for audio encoding. In inference stage, the history states of encoder and decoder can be asynchronously revised to trade off between the latency and the accuracy of the model. To alleviate training and inference mismatch, we propose a training technique, segment cropping, which randomly splits input utterances into several segments with forward connections. This allows us to have dynamic latency speech recognition results with large improvements in accuracy. Experiments show that our dynamic latency model with asynchronous revision gives 8\\%-14\\% relative improvements over the streaming models.", "published": "2020-11-03 08:50:43", "link": "http://arxiv.org/abs/2011.01570v1", "categories": ["eess.AS", "cs.SD"], "primary_category": "eess.AS"}
{"title": "Short-time deep-learning based source separation for speech enhancement in reverberant environments with beamforming", "abstract": "The source separation-based speech enhancement problem with multiple beamforming in reverberant indoor environments is addressed in this paper. We propose that more generic solutions should cope with time-varying dynamic scenarios with moving microphone array or sources such as those found in voice-based human-robot interaction or smart speaker applications. The effectiveness of ordinary source separation methods based on statistical models such as ICA and NMF depends on the analysis window size and cannot handle reverberation environments. To address these limitations, a short-term source separation method based on a temporal convolutional network in combination with compact bilinear pooling is presented. The proposed scheme is virtually independent of the analysis window size and does not lose effectiveness when the analysis window is shortened to 1.6s, which in turn is very interesting to tackle the source separation problem in time-varying scenarios. Also, improvements in WER as high as 80% were obtained when compared to ICA and NMF with multi-condition reverberant training and testing, and with time-varying SNR experiments to simulate a moving target speech source. Finally, the experiment with the estimation of the clean signal employing the proposed scheme and a clean trained ASR provided a WER 13% lower than the one obtained with the corrupted signal and a multi-condition trained ASR. This surprising result contradicts the widely adopted practice of using multi-condition trained ASR systems and reinforce the use of speech enhancement methods for user profiling in HRI environments.", "published": "2020-11-03 19:18:53", "link": "http://arxiv.org/abs/2011.01965v1", "categories": ["eess.AS"], "primary_category": "eess.AS"}
{"title": "DNN-based mask estimation for distributed speech enhancement in spatially unconstrained microphone arrays", "abstract": "Deep neural network (DNN)-based speech enhancement algorithms in microphone arrays have now proven to be efficient solutions to speech understanding and speech recognition in noisy environments. However, in the context of ad-hoc microphone arrays, many challenges remain and raise the need for distributed processing. In this paper, we propose to extend a previously introduced distributed DNN-based time-frequency mask estimation scheme that can efficiently use spatial information in form of so-called compressed signals which are pre-filtered target estimations. We study the performance of this algorithm under realistic acoustic conditions and investigate practical aspects of its optimal application. We show that the nodes in the microphone array cooperate by taking profit of their spatial coverage in the room. We also propose to use the compressed signals not only to convey the target estimation but also the noise estimation in order to exploit the acoustic diversity recorded throughout the microphone array.", "published": "2020-11-03 14:05:33", "link": "http://arxiv.org/abs/2011.01714v1", "categories": ["eess.SP"], "primary_category": "eess.SP"}
