{"title": "Deep Recurrent Modelling of Stationary Bitcoin Price Formation Using the Order Flow", "abstract": "In this paper we propose a deep recurrent model based on the order flow for the stationary modelling of the high-frequency directional prices movements. The order flow is the microsecond stream of orders arriving at the exchange, driving the formation of prices seen on the price chart of a stock or currency. To test the stationarity of our proposed model we train our model on data before the 2017 Bitcoin bubble period and test our model during and after the bubble. We show that without any retraining, the proposed model is temporally stable even as Bitcoin trading shifts into an extremely volatile \"bubble trouble\" period. The significance of the result is shown by benchmarking against existing state-of-the-art models in the literature for modelling price formation using deep learning.", "published": "2020-03-31 18:13:04", "link": "http://arxiv.org/abs/2004.01499v1", "categories": ["q-fin.ST", "cs.LG", "q-fin.TR", "stat.ML"], "primary_category": "q-fin.ST"}
{"title": "Deep Probabilistic Modelling of Price Movements for High-Frequency Trading", "abstract": "In this paper we propose a deep recurrent architecture for the probabilistic modelling of high-frequency market prices, important for the risk management of automated trading systems. Our proposed architecture incorporates probabilistic mixture models into deep recurrent neural networks. The resulting deep mixture models simultaneously address several practical challenges important in the development of automated high-frequency trading strategies that were previously neglected in the literature: 1) probabilistic forecasting of the price movements; 2) single objective prediction of both the direction and size of the price movements. We train our models on high-frequency Bitcoin market data and evaluate them against benchmark models obtained from the literature. We show that our model outperforms the benchmark models in both a metric-based test and in a simulated trading scenario", "published": "2020-03-31 19:25:40", "link": "http://arxiv.org/abs/2004.01498v1", "categories": ["q-fin.ST", "cs.LG", "q-fin.TR", "stat.ML"], "primary_category": "q-fin.ST"}
