{"title": "Visual Exploration and Knowledge Discovery from Biomedical Dark Data", "abstract": "Data visualization techniques proffer efficient means to organize and present data in graphically appealing formats, which not only speeds up the process of decision making and pattern recognition but also enables decision-makers to fully understand data insights and make informed decisions. Over time, with the rise in technological and computational resources, there has been an exponential increase in the world's scientific knowledge. However, most of it lacks structure and cannot be easily categorized and imported into regular databases. This type of data is often termed as Dark Data. Data visualization techniques provide a promising solution to explore such data by allowing quick comprehension of information, the discovery of emerging trends, identification of relationships and patterns, etc. In this empirical research study, we use the rich corpus of PubMed comprising of more than 30 million citations from biomedical literature to visually explore and understand the underlying key-insights using various information visualization techniques. We employ a natural language processing based pipeline to discover knowledge out of the biomedical dark data. The pipeline comprises of different lexical analysis techniques like Topic Modeling to extract inherent topics and major focus areas, Network Graphs to study the relationships between various entities like scientific documents and journals, researchers, and, keywords and terms, etc. With this analytical research, we aim to proffer a potential solution to overcome the problem of analyzing overwhelming amounts of information and diminish the limitation of human cognition and perception in handling and examining such large volumes of data.", "published": "2020-09-28 04:27:05", "link": "http://arxiv.org/abs/2009.13059v1", "categories": ["cs.DL", "cs.CL", "cs.IR", "cs.LG"], "primary_category": "cs.DL"}
{"title": "Breaking the Memory Wall for AI Chip with a New Dimension", "abstract": "Recent advancements in deep learning have led to the widespread adoption of artificial intelligence (AI) in applications such as computer vision and natural language processing. As neural networks become deeper and larger, AI modeling demands outstrip the capabilities of conventional chip architectures. Memory bandwidth falls behind processing power. Energy consumption comes to dominate the total cost of ownership. Currently, memory capacity is insufficient to support the most advanced NLP models. In this work, we present a 3D AI chip, called Sunrise, with near-memory computing architecture to address these three challenges. This distributed, near-memory computing architecture allows us to tear down the performance-limiting memory wall with an abundance of data bandwidth. We achieve the same level of energy efficiency on 40nm technology as competing chips on 7nm technology. By moving to similar technologies as other AI chips, we project to achieve more than ten times the energy efficiency, seven times the performance of the current state-of-the-art chips, and twenty times of memory capacity as compared with the best chip in each benchmark.", "published": "2020-09-28 22:34:10", "link": "http://arxiv.org/abs/2009.13664v1", "categories": ["cs.AR", "cs.AI", "cs.CV", "cs.LG", "eess.IV"], "primary_category": "cs.AR"}
{"title": "Transparency, Auditability and eXplainability of Machine Learning Models in Credit Scoring", "abstract": "A major requirement for credit scoring models is to provide a maximally accurate risk prediction. Additionally, regulators demand these models to be transparent and auditable. Thus, in credit scoring, very simple predictive models such as logistic regression or decision trees are still widely used and the superior predictive power of modern machine learning algorithms cannot be fully leveraged. Significant potential is therefore missed, leading to higher reserves or more credit defaults. This paper works out different dimensions that have to be considered for making credit scoring models understandable and presents a framework for making ``black box'' machine learning models transparent, auditable and explainable. Following this framework, we present an overview of techniques, demonstrate how they can be applied in credit scoring and how results compare to the interpretability of score cards. A real world case study shows that a comparable degree of interpretability can be achieved while machine learning techniques keep their ability to improve predictive power.", "published": "2020-09-28 15:00:13", "link": "http://arxiv.org/abs/2009.13384v1", "categories": ["stat.ML", "cs.LG", "econ.GN", "stat.AP", "stat.ME"], "primary_category": "stat.ML"}
{"title": "Static and Dynamic Measures of Active Music Listening as Indicators of Depression Risk", "abstract": "Music, an integral part of our lives, which is not only a source of entertainment but plays an important role in mental well-being by impacting moods, emotions and other affective states. Music preferences and listening strategies have been shown to be associated with the psychological well-being of listeners including internalized symptomatology and depression. However, till date no studies exist that examine time-varying music consumption, in terms of acoustic content, and its association with users' well-being. In the current study, we aim at unearthing static and dynamic patterns prevalent in active listening behavior of individuals which may be used as indicators of risk for depression. Mental well-being scores and listening histories of 541 Last.fm users were examined. Static and dynamic acoustic and emotion-related features were extracted from each user's listening history and correlated with their mental well-being scores. Results revealed that individuals with greater depression risk resort to higher dependency on music with greater repetitiveness in their listening activity. Furthermore, the affinity of depressed individuals towards music that can be perceived as sad was found to be resistant to change over time. This study has large implications for future work in the area of assessing mental illness risk by exploiting digital footprints of users via online music streaming platforms.", "published": "2020-09-28 23:29:53", "link": "http://arxiv.org/abs/2009.13685v1", "categories": ["eess.AS", "cs.IR", "cs.MM", "cs.SD"], "primary_category": "eess.AS"}
{"title": "A Wideband Sliding Correlator based Channel Sounder in 65 nm CMOS: An Evaluation Board Design", "abstract": "Wide swaths of bandwidth at millimeter-wave (mmWave) and Terahertz (THz) frequencies stimulate diverse applications in wireless sensing, imaging, position location, cloud computing, and much more. These emerging applications motivate wireless communications hardware to operate with multi Gigahertz (GHz) bandwidth, at nominal costs, minimal size, and power consumption. Channel sounding system implementations currently used to study and measure wireless channels utilize numerous commercially available components from multiple manufacturers that result in a complex and large assembly with many costly and fragile cable interconnections between the constituents and commonly achieve a system bandwidth under one GHz. This paper presents an evaluation board (EVB) design that features a sliding correlator-based channel sounder with 2 GHz null-to-null RF bandwidth in a single monolithic integrated circuit (IC) fabricated in 65 nm CMOS technology. The EVB landscape provides necessary peripherals for signal interfacing, amplification, buffering, and enables integration into both the transmitter and receiver of a channel sounding system, thereby reducing complexity, size, and cost through integrated design. The channel sounder IC on the EVB is the worlds first to report gigabit-per-second baseband operation using low-cost CMOS technology, allowing the global research community to now have an inexpensive and compact channel sounder system with nanosecond time resolution capability for the detection of multipath signals in a wireless channel.", "published": "2020-09-28 17:32:54", "link": "http://arxiv.org/abs/2009.13490v1", "categories": ["eess.SP"], "primary_category": "eess.SP"}
