{"title": "Themes Informed Audio-visual Correspondence Learning", "abstract": "The applications of short-term user-generated video (UGV), such as Snapchat, and Youtube short-term videos, booms recently, raising lots of multimodal machine learning tasks. Among them, learning the correspondence between audio and visual information from videos is a challenging one. Most previous work of the audio-visual correspondence(AVC) learning only investigated constrained videos or simple settings, which may not fit the application of UGV. In this paper, we proposed new principles for AVC and introduced a new framework to set sight of videos' themes to facilitate AVC learning. We also released the KWAI-AD-AudVis corpus which contained 85432 short advertisement videos (around 913 hours) made by users. We evaluated our proposed approach on this corpus, and it was able to outperform the baseline by 23.15% absolute difference.", "published": "2020-09-14 17:03:04", "link": "http://arxiv.org/abs/2009.06573v2", "categories": ["cs.AI", "cs.MM", "stat.ML"], "primary_category": "cs.AI"}
{"title": "Active Fairness Instead of Unawareness", "abstract": "The possible risk that AI systems could promote discrimination by reproducing and enforcing unwanted bias in data has been broadly discussed in research and society. Many current legal standards demand to remove sensitive attributes from data in order to achieve \"fairness through unawareness\". We argue that this approach is obsolete in the era of big data where large datasets with highly correlated attributes are common. In the contrary, we propose the active use of sensitive attributes with the purpose of observing and controlling any kind of discrimination, and thus leading to fair results.", "published": "2020-09-14 08:14:17", "link": "http://arxiv.org/abs/2009.06251v1", "categories": ["cs.AI"], "primary_category": "cs.AI"}
{"title": "Persistent And Scalable JADE: A Cloud based InMemory Multi-agent Framework", "abstract": "Multi-agent systems are often limited in terms of persistenceand scalability. This issue is more prevalent for applications inwhich agent states changes frequently. This makes the existingmethods less usable as they increase the agent's complexityand are less scalable. This research study has presented anovel in-memory agent persistence framework. Two prototypeshave been implemented, one using the proposed solution andthe other using an established agent persistency environment.Experimental results confirm that the proposed framework ismore scalable than existing approaches whilst providing asimilar level of persistency. These findings will help futurereal-time multiagent systems to become scalable and persistentin a dynamic cloud environment.", "published": "2020-09-14 13:22:37", "link": "http://arxiv.org/abs/2009.06425v2", "categories": ["cs.AI", "cs.MA"], "primary_category": "cs.AI"}
{"title": "Double-Wing Mixture of Experts for Streaming Recommendations", "abstract": "Streaming Recommender Systems (SRSs) commonly train recommendation models on newly received data only to address user preference drift, i.e., the changing user preferences towards items. However, this practice overlooks the long-term user preferences embedded in historical data. More importantly, the common heterogeneity in data stream greatly reduces the accuracy of streaming recommendations. The reason is that different preferences (or characteristics) of different types of users (or items) cannot be well learned by a unified model. To address these two issues, we propose a Variational and Reservoir-enhanced Sampling based Double-Wing Mixture of Experts framework, called VRS-DWMoE, to improve the accuracy of streaming recommendations. In VRS-DWMoE, we first devise variational and reservoir-enhanced sampling to wisely complement new data with historical data, and thus address the user preference drift issue while capturing long-term user preferences. After that, we propose a Double-Wing Mixture of Experts (DWMoE) model to first effectively learn heterogeneous user preferences and item characteristics, and then make recommendations based on them. Specifically, DWMoE contains two Mixture of Experts (MoE, an effective ensemble learning model) to learn user preferences and item characteristics, respectively. Moreover, the multiple experts in each MoE learn the preferences (or characteristics) of different types of users (or items) where each expert specializes in one underlying type. Extensive experiments demonstrate that VRS-DWMoE consistently outperforms the state-of-the-art SRSs.", "published": "2020-09-14 11:09:22", "link": "http://arxiv.org/abs/2009.06327v1", "categories": ["cs.IR"], "primary_category": "cs.IR"}
{"title": "Private data sharing between decentralized users through the privGAN architecture", "abstract": "More data is almost always beneficial for analysis and machine learning tasks. In many realistic situations however, an enterprise cannot share its data, either to keep a competitive advantage or to protect the privacy of the data sources, the enterprise's clients for example. We propose a method for data owners to share synthetic or fake versions of their data without sharing the actual data, nor the parameters of models that have direct access to the data. The method proposed is based on the privGAN architecture where local GANs are trained on their respective data subsets with an extra penalty from a central discriminator aiming to discriminate the origin of a given fake sample. We demonstrate that this approach, when applied to subsets of various sizes, leads to better utility for the owners than the utility from their real small datasets. The only shared pieces of information are the parameter updates of the central discriminator. The privacy is demonstrated with white-box attacks on the most vulnerable elments of the architecture and the results are close to random guessing. This method would apply naturally in a federated learning setting.", "published": "2020-09-14 22:06:13", "link": "http://arxiv.org/abs/2009.06764v1", "categories": ["stat.ML", "cs.CR", "cs.LG"], "primary_category": "stat.ML"}
