{"title": "Discrete-time portfolio optimization under maximum drawdown constraint with partial information and deep learning resolution", "abstract": "We study a discrete-time portfolio selection problem with partial information and maxi\\-mum drawdown constraint. Drift uncertainty in the multidimensional framework is modeled by a prior probability distribution. In this Bayesian framework, we derive the dynamic programming equation using an appropriate change of measure, and obtain semi-explicit results in the Gaussian case. The latter case, with a CRRA utility function is completely solved numerically using recent deep learning techniques for stochastic optimal control problems. We emphasize the informative value of the learning strategy versus the non-learning one by providing empirical performance and sensitivity analysis with respect to the uncertainty of the drift. Furthermore, we show numerical evidence of the close relationship between the non-learning strategy and a no short-sale constrained Merton problem, by illustrating the convergence of the former towards the latter as the maximum drawdown constraint vanishes.", "published": "2020-10-29 17:25:36", "link": "http://arxiv.org/abs/2010.15779v2", "categories": ["q-fin.PM", "q-fin.MF"], "primary_category": "q-fin.PM"}
{"title": "Identification of complex mixtures for Raman spectroscopy using a novel scheme based on a new multi-label deep neural network", "abstract": "With noisy environment caused by fluoresence and additive white noise as well as complicated spectrum fingerprints, the identification of complex mixture materials remains a major challenge in Raman spectroscopy application. In this paper, we propose a new scheme based on a constant wavelet transform (CWT) and a deep network for classifying complex mixture. The scheme first transforms the noisy Raman spectrum to a two-dimensional scale map using CWT. A multi-label deep neural network model (MDNN) is then applied for classifying material. The proposed model accelerates the feature extraction and expands the feature graph using the global averaging pooling layer. The Sigmoid function is implemented in the last layer of the model. The MDNN model was trained, validated and tested with data collected from the samples prepared from substances in palm oil. During training and validating process, data augmentation is applied to overcome the imbalance of data and enrich the diversity of Raman spectra. From the test results, it is found that the MDNN model outperforms previously proposed deep neural network models in terms of Hamming loss, one error, coverage, ranking loss, average precision, F1 macro averaging and F1 micro averaging, respectively. The average detection time obtained from our model is 5.31 s, which is much faster than the detection time of the previously proposed models.", "published": "2020-10-29 14:58:39", "link": "http://arxiv.org/abs/2010.15654v1", "categories": ["eess.SP", "cs.LG", "eess.IV", "physics.chem-ph"], "primary_category": "eess.SP"}
{"title": "Distance Invariant Sparse Autoencoder for Wireless Signal Strength Mapping", "abstract": "Wireless signal strength based localization can enable robust localization for robots using inexpensive sensors. For this, a location-to-signal-strength map has to be learned for each access point in the environment. Due to the ubiquity of Wireless networks in most environments, this can result in tens or hundreds of maps. To reduce the dimensionality of this problem, we employ autoencoders, which are a popular unsupervised approach for feature extraction and data compression. In particular, we propose the use of sparse autoencoders that learn latent spaces that preserve the relative distance between inputs. Distance invariance between input and latent spaces allows our system to successfully learn compact representations that allow precise data reconstruction but also have a low impact on localization performance when using maps from the latent space rather than the input space. We demonstrate the feasibility of our approach by performing experiments in outdoor environments.", "published": "2020-10-29 04:07:25", "link": "http://arxiv.org/abs/2010.15347v1", "categories": ["eess.SP", "cs.RO"], "primary_category": "eess.SP"}
