{"title": "Gated Recurrent Fusion with Joint Training Framework for Robust End-to-End Speech Recognition", "abstract": "The joint training framework for speech enhancement and recognition methods have obtained quite good performances for robust end-to-end automatic speech recognition (ASR). However, these methods only utilize the enhanced feature as the input of the speech recognition component, which are affected by the speech distortion problem. In order to address this problem, this paper proposes a gated recurrent fusion (GRF) method with joint training framework for robust end-to-end ASR. The GRF algorithm is used to dynamically combine the noisy and enhanced features. Therefore, the GRF can not only remove the noise signals from the enhanced features, but also learn the raw fine structures from the noisy features so that it can alleviate the speech distortion. The proposed method consists of speech enhancement, GRF and speech recognition. Firstly, the mask based speech enhancement network is applied to enhance the input speech. Secondly, the GRF is applied to address the speech distortion problem. Thirdly, to improve the performance of ASR, the state-of-the-art speech transformer algorithm is used as the speech recognition component. Finally, the joint training framework is utilized to optimize these three components, simultaneously. Our experiments are conducted on an open-source Mandarin speech corpus called AISHELL-1. Experimental results show that the proposed method achieves the relative character error rate (CER) reduction of 10.04\\% over the conventional joint enhancement and transformer method only using the enhanced features. Especially for the low signal-to-noise ratio (0 dB), our proposed method can achieves better performances with 12.67\\% CER reduction, which suggests the potential of our proposed method.", "published": "2020-11-09 08:52:05", "link": "http://arxiv.org/abs/2011.04249v1", "categories": ["cs.SD", "cs.CL", "eess.AS"], "primary_category": "cs.SD"}
{"title": "Artificial Intelligence Decision Support for Medical Triage", "abstract": "Applying state-of-the-art machine learning and natural language processing on approximately one million of teleconsultation records, we developed a triage system, now certified and in use at the largest European telemedicine provider. The system evaluates care alternatives through interactions with patients via a mobile application. Reasoning on an initial set of provided symptoms, the triage application generates AI-powered, personalized questions to better characterize the problem and recommends the most appropriate point of care and time frame for a consultation. The underlying technology was developed to meet the needs for performance, transparency, user acceptance and ease of use, central aspects to the adoption of AI-based decision support systems. Providing such remote guidance at the beginning of the chain of care has significant potential for improving cost efficiency, patient experience and outcomes. Being remote, always available and highly scalable, this service is fundamental in high demand situations, such as the current COVID-19 outbreak.", "published": "2020-11-09 16:45:01", "link": "http://arxiv.org/abs/2011.04548v1", "categories": ["cs.AI", "cs.CL", "cs.LG"], "primary_category": "cs.AI"}
{"title": "A bivariate Normal Inverse Gaussian process with stochastic delay: efficient simulations and applications to energy markets", "abstract": "Using the concept of self-decomposable subordinators introduced in Gardini et al. [11], we build a new bivariate Normal Inverse Gaussian process that can capture stochastic delays. In addition, we also develop a novel path simulation scheme that relies on the mathematical connection between self-decomposable Inverse Gaussian laws and Lévy-driven Ornstein-Uhlenbeck processes with Inverse Gaussian stationary distribution. We show that our approach provides an improvement to the existing simulation scheme detailed in Zhang and Zhang [23] because it does not rely on an acceptance-rejection method. Eventually, these results are applied to the modelling of energy markets and to the pricing of spread options using the proposed Monte Carlo scheme and Fourier techniques", "published": "2020-11-09 09:04:21", "link": "http://arxiv.org/abs/2011.04256v1", "categories": ["q-fin.CP", "math.PR", "q-fin.MF", "q-fin.PR"], "primary_category": "q-fin.CP"}
{"title": "Comparing the market microstructure between two South African exchanges", "abstract": "We consider shared listings on two South African equity exchanges: the Johannesburg Stock Exchange (JSE) and the A2X Exchange. A2X is an alternative exchange that provides for both shared listings and new listings within the financial market ecosystem of South Africa. From a science perspective it provides the opportunity to compare markets trading similar shares, in a similar regulatory and economic environment, but with vastly different liquidity, costs and business models. A2X currently has competitive settlement and transaction pricing when compared to the JSE, but the JSE has deeper liquidity. In pursuit of an empirical understanding of how these differences relate to their respective price response dynamics, we compare the distributions and auto-correlations of returns on different time scales; we compare price impact and master curves; and we compare the cost of trading on each exchange. This allows us to empirically compare the two markets. We find that various stylised facts become similar as the measurement or sampling time scale increase. However, the same securities can have vastly different price responses irrespective of time scales. This is not surprising given the different liquidity and order-book resilience. Here we demonstrate that direct costs dominate the cost of trading, and the importance of competitively positioning cost ceilings. Universality is crucial for being able to meaningfully compare cross-exchange price responses, but in the case of A2X, it has yet to emerge in a meaningful way due to the infancy of the exchange -- making meaningful comparisons difficult.", "published": "2020-11-09 12:03:06", "link": "http://arxiv.org/abs/2011.04367v1", "categories": ["q-fin.ST", "q-fin.TR"], "primary_category": "q-fin.ST"}
{"title": "Deep Bayesian Nonparametric Factor Analysis", "abstract": "We propose a deep generative factor analysis model with beta process prior that can approximate complex non-factorial distributions over the latent codes. We outline a stochastic EM algorithm for scalable inference in a specific instantiation of this model and present some preliminary results.", "published": "2020-11-09 21:14:22", "link": "http://arxiv.org/abs/2011.04770v1", "categories": ["stat.ML", "cs.LG"], "primary_category": "stat.ML"}
{"title": "Benchmarking LF-MMI, CTC and RNN-T Criteria for Streaming ASR", "abstract": "In this work, to measure the accuracy and efficiency for a latency-controlled streaming automatic speech recognition (ASR) application, we perform comprehensive evaluations on three popular training criteria: LF-MMI, CTC and RNN-T. In transcribing social media videos of 7 languages with training data 3K-14K hours, we conduct large-scale controlled experimentation across each criterion using identical datasets and encoder model architecture. We find that RNN-T has consistent wins in ASR accuracy, while CTC models excel at inference efficiency. Moreover, we selectively examine various modeling strategies for different training criteria, including modeling units, encoder architectures, pre-training, etc. Given such large-scale real-world streaming ASR application, to our best knowledge, we present the first comprehensive benchmark on these three widely used training criteria across a great many languages.", "published": "2020-11-09 21:34:38", "link": "http://arxiv.org/abs/2011.04785v1", "categories": ["eess.AS", "cs.SD"], "primary_category": "eess.AS"}
