{"title": "TeMP: Temporal Message Passing for Temporal Knowledge Graph Completion", "abstract": "Inferring missing facts in temporal knowledge graphs (TKGs) is a fundamental and challenging task. Previous works have approached this problem by augmenting methods for static knowledge graphs to leverage time-dependent representations. However, these methods do not explicitly leverage multi-hop structural information and temporal facts from recent time steps to enhance their predictions. Additionally, prior work does not explicitly address the temporal sparsity and variability of entity distributions in TKGs. We propose the Temporal Message Passing (TeMP) framework to address these challenges by combining graph neural networks, temporal dynamics models, data imputation and frequency-based gating techniques. Experiments on standard TKG tasks show that our approach provides substantial gains compared to the previous state of the art, achieving a 10.7% average relative improvement in Hits@10 across three standard benchmarks. Our analysis also reveals important sources of variability both within and across TKG datasets, and we introduce several simple but strong baselines that outperform the prior state of the art in certain settings.", "published": "2020-10-07 17:11:53", "link": "http://arxiv.org/abs/2010.03526v1", "categories": ["cs.LG", "cs.AI", "cs.CL"], "primary_category": "cs.LG"}
{"title": "Deep Learning for Information Systems Research", "abstract": "Artificial Intelligence (AI) has rapidly emerged as a key disruptive technology in the 21st century. At the heart of modern AI lies Deep Learning (DL), an emerging class of algorithms that has enabled today's platforms and organizations to operate at unprecedented efficiency, effectiveness, and scale. Despite significant interest, IS contributions in DL have been limited, which we argue is in part due to issues with defining, positioning, and conducting DL research. Recognizing the tremendous opportunity here for the IS community, this work clarifies, streamlines, and presents approaches for IS scholars to make timely and high-impact contributions. Related to this broader goal, this paper makes five timely contributions. First, we systematically summarize the major components of DL in a novel Deep Learning for Information Systems Research (DL-ISR) schematic that illustrates how technical DL processes are driven by key factors from an application environment. Second, we present a novel Knowledge Contribution Framework (KCF) to help IS scholars position their DL contributions for maximum impact. Third, we provide ten guidelines to help IS scholars generate rigorous and relevant DL-ISR in a systematic, high-quality fashion. Fourth, we present a review of prevailing journal and conference venues to examine how IS scholars have leveraged DL for various research inquiries. Finally, we provide a unique perspective on how IS scholars can formulate DL-ISR inquiries by carefully considering the interplay of business function(s), application areas(s), and the KCF. This perspective intentionally emphasizes inter-disciplinary, intra-disciplinary, and cross-IS tradition perspectives. Taken together, these contributions provide IS scholars a timely framework to advance the scale, scope, and impact of deep learning research.", "published": "2020-10-07 15:23:05", "link": "http://arxiv.org/abs/2010.05774v1", "categories": ["cs.LG", "cs.CL", "stat.ME", "stat.ML"], "primary_category": "cs.LG"}
{"title": "Towards Understanding Sample Variance in Visually Grounded Language Generation: Evaluations and Observations", "abstract": "A major challenge in visually grounded language generation is to build robust benchmark datasets and models that can generalize well in real-world settings. To do this, it is critical to ensure that our evaluation protocols are correct, and benchmarks are reliable. In this work, we set forth to design a set of experiments to understand an important but often ignored problem in visually grounded language generation: given that humans have different utilities and visual attention, how will the sample variance in multi-reference datasets affect the models' performance? Empirically, we study several multi-reference datasets and corresponding vision-and-language tasks. We show that it is of paramount importance to report variance in experiments; that human-generated references could vary drastically in different datasets/tasks, revealing the nature of each task; that metric-wise, CIDEr has shown systematically larger variances than others. Our evaluations on reference-per-instance shed light on the design of reliable datasets in the future.", "published": "2020-10-07 20:45:14", "link": "http://arxiv.org/abs/2010.03644v1", "categories": ["cs.CL", "cs.AI", "cs.CV"], "primary_category": "cs.CL"}
{"title": "WDN: A Wide and Deep Network to Divide-and-Conquer Image Super-resolution", "abstract": "Divide and conquer is an established algorithm design paradigm that has proven itself to solve a variety of problems efficiently. However, it is yet to be fully explored in solving problems with a neural network, particularly the problem of image super-resolution. In this work, we propose an approach to divide the problem of image super-resolution into multiple sub-problems and then solve/conquer them with the help of a neural network. Unlike a typical deep neural network, we design an alternate network architecture that is much wider (along with being deeper) than existing networks and is specially designed to implement the divide-and-conquer design paradigm with a neural network. Additionally, a technique to calibrate the intensities of feature map pixels is being introduced. Extensive experimentation on five datasets reveals that our approach towards the problem and the proposed architecture generate better and sharper results than current state-of-the-art methods.", "published": "2020-10-07 06:15:11", "link": "http://arxiv.org/abs/2010.03199v1", "categories": ["eess.IV", "cs.CV"], "primary_category": "eess.IV"}
{"title": "M3Lung-Sys: A Deep Learning System for Multi-Class Lung Pneumonia Screening from CT Imaging", "abstract": "To counter the outbreak of COVID-19, the accurate diagnosis of suspected cases plays a crucial role in timely quarantine, medical treatment, and preventing the spread of the pandemic. Considering the limited training cases and resources (e.g, time and budget), we propose a Multi-task Multi-slice Deep Learning System (M3Lung-Sys) for multi-class lung pneumonia screening from CT imaging, which only consists of two 2D CNN networks, i.e., slice- and patient-level classification networks. The former aims to seek the feature representations from abundant CT slices instead of limited CT volumes, and for the overall pneumonia screening, the latter one could recover the temporal information by feature refinement and aggregation between different slices. In addition to distinguish COVID-19 from Healthy, H1N1, and CAP cases, our M 3 Lung-Sys also be able to locate the areas of relevant lesions, without any pixel-level annotation. To further demonstrate the effectiveness of our model, we conduct extensive experiments on a chest CT imaging dataset with a total of 734 patients (251 healthy people, 245 COVID-19 patients, 105 H1N1 patients, and 133 CAP patients). The quantitative results with plenty of metrics indicate the superiority of our proposed model on both slice- and patient-level classification tasks. More importantly, the generated lesion location maps make our system interpretable and more valuable to clinicians.", "published": "2020-10-07 06:22:24", "link": "http://arxiv.org/abs/2010.03201v1", "categories": ["eess.IV", "cs.CV", "cs.LG"], "primary_category": "eess.IV"}
{"title": "Designing, Playing, and Performing with a Vision-based Mouth Interface", "abstract": "The role of the face and mouth in speech production as well asnon-verbal communication suggests the use of facial action tocontrol musical sound. Here we document work on theMouthesizer, a system which uses a headworn miniaturecamera and computer vision algorithm to extract shapeparameters from the mouth opening and output these as MIDIcontrol changes. We report our experience with variousgesture-to-sound mappings and musical applications, anddescribe a live performance which used the Mouthesizerinterface.", "published": "2020-10-07 06:47:42", "link": "http://arxiv.org/abs/2010.03213v1", "categories": ["cs.HC", "cs.CV", "cs.SD", "eess.AS"], "primary_category": "cs.HC"}
{"title": "Propagation of minimality in the supercooled Stefan problem", "abstract": "Supercooled Stefan problems describe the evolution of the boundary between the solid and liquid phases of a substance, where the liquid is assumed to be cooled below its freezing point. Following the methodology of Delarue, Nadtochiy and Shkolnikov, we construct solutions to the one-phase one-dimensional supercooled Stefan problem through a certain McKean-Vlasov equation, which allows to define global solutions even in the presence of blow-ups. Solutions to the McKean-Vlasov equation arise as mean-field limits of particle systems interacting through hitting times, which is important for systemic risk modeling. Our main contributions are: (i) we prove a general tightness theorem for the Skorokhod M1-topology which applies to processes that can be decomposed into a continuous and a monotone part. (ii) We prove propagation of chaos for a perturbed version of the particle system for general initial conditions. (iii) We prove a conjecture of Delarue, Nadtochiy and Shkolnikov, relating the solution concepts of so-called minimal and physical solutions, showing that minimal solutions of the McKean-Vlasov equation are physical whenever the initial condition is integrable.", "published": "2020-10-07 18:00:07", "link": "http://arxiv.org/abs/2010.03580v2", "categories": ["math.PR", "q-fin.MF"], "primary_category": "math.PR"}
{"title": "FairMixRep : Self-supervised Robust Representation Learning for Heterogeneous Data with Fairness constraints", "abstract": "Representation Learning in a heterogeneous space with mixed variables of numerical and categorical types has interesting challenges due to its complex feature manifold. Moreover, feature learning in an unsupervised setup, without class labels and a suitable learning loss function, adds to the problem complexity. Further, the learned representation and subsequent predictions should not reflect discriminatory behavior towards certain sensitive groups or attributes. The proposed feature map should preserve maximum variations present in the data and needs to be fair with respect to the sensitive variables. We propose, in the first phase of our work, an efficient encoder-decoder framework to capture the mixed-domain information. The second phase of our work focuses on de-biasing the mixed space representations by adding relevant fairness constraints. This ensures minimal information loss between the representations before and after the fairness-preserving projections. Both the information content and the fairness aspect of the final representation learned has been validated through several metrics where it shows excellent performance. Our work (FairMixRep) addresses the problem of Mixed Space Fair Representation learning from an unsupervised perspective and learns a Universal representation that is timely, unique, and a novel research contribution.", "published": "2020-10-07 07:23:02", "link": "http://arxiv.org/abs/2010.03228v2", "categories": ["stat.ML", "cs.AI", "cs.LG"], "primary_category": "stat.ML"}
{"title": "Array Resource Allocation for Radar and Communication Integration Network", "abstract": "A radar and communication integration (RCI) system has great flexibility in allocating antenna resources to guarantee both radar and communication performance. This paper considers the array allocation problems for multiple target localization and multiple platforms communication in an RCI network. The objective of array allocation is to maximize the communication capacity for each channel and to minimize the localization error for each target. In this paper, we firstly build a localization and communication model for array allocation in an RCI network. Minorization maximization (MM) is then applied to create surrogate functions for multiple objective optimization problems. The projected gradient descent (PGD) method is further employed to solve two array allocation problems with and without a certain communication capacity constraint. Computer simulations are conducted to evaluate the performance of the proposed algorithms. The results show that the proposed algorithms have improved localization and communication performance after efficiently allocating the array resource in the RCI network.", "published": "2020-10-07 23:38:24", "link": "http://arxiv.org/abs/2010.03690v1", "categories": ["eess.SP", "eess.SY"], "primary_category": "eess.SP"}
{"title": "Free Space Optics for Next-Generation Satellite Networks", "abstract": "Free space optics (FSO) refers to optical wireless communications in outdoor environments. The aim of this paper is to analyze the role that FSO is envisaged to play in the creation of next-generation satellite networks. To begin with, the reader is introduced to the types of FSO links and functionalities of a basic FSO system. Next, a comparison of FSO and radio frequency (RF) technologies for inter-satellite links (ISLs) is provided, including a comparison between FSO and RF links when employed between low Earth orbit satellites. After that, the types of FSO or laser ISLs are considered, and the challenges in establishing laser ISLs, the properties of laser ISLs, and the capabilities of terminals for laser ISLs are discussed. Then, the parameters of a satellite constellation are highlighted, and different aspects of SpaceX's upcoming mega-constellation Starlink are explored. In addition, the optical wireless satellite network that is created by utilizing laser ISLs is examined. Finally, a use case is investigated for next-generation optical wireless satellite networks that are envisioned by the mid to late 2020s.", "published": "2020-10-07 01:05:24", "link": "http://arxiv.org/abs/2010.03098v1", "categories": ["eess.SP"], "primary_category": "eess.SP"}
{"title": "Index-Modulated Circularly-Shifted Chirps for Dual-Function Radar & Communication Systems", "abstract": "In this study, we analyze index modulation (IM) based on circularly-shifted chirps (CSCs) for dual-function radar & communication (DFRC) systems. We develop a maximum likelihood (ML) range estimator that considers multiple scatters. To improve the correlation properties of the transmitted waveform and estimation accuracy, we propose index separation (IS) which separates the CSCs apart in time. We theoretically show that the separation can be large under certain conditions without losing the spectral efficiency (SE). Our numerical results show that the IS combined ML and linear minimum mean square error (LMMSE)-based estimators can provide approximately 3 dB signal-to-noise ratio (SNR) gain in some cases while improving estimation accuracy substantially without causing any bit-error ratio (BER) degradation at the communication receiver.", "published": "2020-10-07 07:27:04", "link": "http://arxiv.org/abs/2010.03231v1", "categories": ["eess.SP", "cs.IT"], "primary_category": "eess.SP"}
{"title": "Reconfigurable Intelligent Surfaces and Machine Learning for Wireless Fingerprinting Localization", "abstract": "Reconfigurable Intelligent Surfaces (RISs) promise improved, secure and more efficient wireless communications. We propose and demonstrate how to exploit the diversity offered by RISs to generate and select easily differentiable radio maps for use in wireless fingerprinting localization applications. Further, we apply machine learning feature selection methods to prune the large state space of the RIS, thus reducing complexity and enhancing localization accuracy and position acquisition time. We evaluate our proposed approach by generation of radio maps with a novel radio propagation modelling and simulations.", "published": "2020-10-07 08:10:18", "link": "http://arxiv.org/abs/2010.03251v1", "categories": ["eess.SP", "cs.ET", "cs.LG"], "primary_category": "eess.SP"}
