{"title": "A Benchmark for Lease Contract Review", "abstract": "Extracting entities and other useful information from legal contracts is an important task whose automation can help legal professionals perform contract reviews more efficiently and reduce relevant risks. In this paper, we tackle the problem of detecting two different types of elements that play an important role in a contract review, namely entities and red flags. The latter are terms or sentences that indicate that there is some danger or other potentially problematic situation for one or more of the signing parties. We focus on supporting the review of lease agreements, a contract type that has received little attention in the legal information extraction literature, and we define the types of entities and red flags needed for that task. We release a new benchmark dataset of 179 lease agreement documents that we have manually annotated with the entities and red flags they contain, and which can be used to train and test relevant extraction algorithms. Finally, we release a new language model, called ALeaseBERT, pre-trained on this dataset and fine-tuned for the detection of the aforementioned elements, providing a baseline for further research", "published": "2020-10-20 15:50:50", "link": "http://arxiv.org/abs/2010.10386v1", "categories": ["cs.IR", "cs.CL"], "primary_category": "cs.IR"}
{"title": "Speaker Separation Using Speaker Inventories and Estimated Speech", "abstract": "We propose speaker separation using speaker inventories and estimated speech (SSUSIES), a framework leveraging speaker profiles and estimated speech for speaker separation. SSUSIES contains two methods, speaker separation using speaker inventories (SSUSI) and speaker separation using estimated speech (SSUES). SSUSI performs speaker separation with the help of speaker inventory. By combining the advantages of permutation invariant training (PIT) and speech extraction, SSUSI significantly outperforms conventional approaches. SSUES is a widely applicable technique that can substantially improve speaker separation performance using the output of first-pass separation. We evaluate the models on both speaker separation and speech recognition metrics.", "published": "2020-10-20 18:15:45", "link": "http://arxiv.org/abs/2010.10556v1", "categories": ["cs.SD", "cs.CL", "eess.AS"], "primary_category": "cs.SD"}
{"title": "Multi-Radar Tracking Optimization for Collaborative Combat", "abstract": "Smart Grids of collaborative netted radars accelerate kill chains through more efficient cross-cueing over centralized command and control. In this paper, we propose two novel reward-based learning approaches to decentralized netted radar coordination based on black-box optimization and Reinforcement Learning (RL). To make the RL approach tractable, we use a simplification of the problem that we proved to be equivalent to the initial formulation. We apply these techniques on a simulation where radars can follow multiple targets at the same time and show they can learn implicit cooperation by comparing them to a greedy baseline.", "published": "2020-10-20 07:42:58", "link": "http://arxiv.org/abs/2010.11733v1", "categories": ["cs.AI", "cs.NE"], "primary_category": "cs.AI"}
{"title": "A Hub-and-Spoke Model for Content-Moderation-at-Scale on an Information-Sharing Platform", "abstract": "One of the most expensive parts of maintaining a modern information-sharing platform (e.g., web search, social network) is the task of content-moderation-at-scale. Content moderation is the binary task of determining whether or not a given user-created message meets the editorial team's content guidelines for the site. The challenge is that the number of messages to check scales with the number of users, which is much larger than the number of moderator-employees working for the given platform.\n  We show how content moderation can be achieved significantly more cheaply than before, in the special case where all messages are public, by effectively platformizing the task of content moderation. Our approach is to use a hub-and-spoke model. The hub is the core editorial team delegated by the management of the given platform. The spokes are the individual users. The ratings of the editorial team create the labels for a statistical learning algorithm, while the ratings of the users are used as features.\n  We have implemented a primitive version of this algorithm into our open-source DimensionRank code base, found at \"thinkdifferentagain.art\".", "published": "2020-10-20 19:37:24", "link": "http://arxiv.org/abs/2010.10581v1", "categories": ["cs.IR"], "primary_category": "cs.IR"}
{"title": "Knowledge Transfer for Efficient On-device False Trigger Mitigation", "abstract": "In this paper, we address the task of determining whether a given utterance is directed towards a voice-enabled smart-assistant device or not. An undirected utterance is termed as a \"false trigger\" and false trigger mitigation (FTM) is essential for designing a privacy-centric non-intrusive smart assistant. The directedness of an utterance can be identified by running automatic speech recognition (ASR) on it and determining the user intent by analyzing the ASR transcript. But in case of a false trigger, transcribing the audio using ASR itself is strongly undesirable. To alleviate this issue, we propose an LSTM-based FTM architecture which determines the user intent from acoustic features directly without explicitly generating ASR transcripts from the audio. The proposed models are small footprint and can be run on-device with limited computational resources. During training, the model parameters are optimized using a knowledge transfer approach where a more accurate self-attention graph neural network model serves as the teacher. Given the whole audio snippets, our approach mitigates 87% of false triggers at 99% true positive rate (TPR), and in a streaming audio scenario, the system listens to only 1.69s of the false trigger audio before rejecting it while achieving the same TPR.", "published": "2020-10-20 20:01:44", "link": "http://arxiv.org/abs/2010.10591v1", "categories": ["eess.AS", "cs.LG", "cs.SD"], "primary_category": "eess.AS"}
