{"title": "Towards an Atlas of Cultural Commonsense for Machine Reasoning", "abstract": "Existing commonsense reasoning datasets for AI and NLP tasks fail to address an important aspect of human life: cultural differences. We introduce an approach that extends prior work on crowdsourcing commonsense knowledge by incorporating differences in knowledge that are attributable to cultural or national groups. We demonstrate the technique by collecting commonsense knowledge that surrounds six fairly universal rituals -- birth, coming-of-age, marriage, funerals, new year, and birthdays -- across two national groups: the United States and India. Our study expands the different types of relationships identified by existing work in the field of commonsense reasoning for commonplace events, and uses these new types to gather information that distinguish the identity of the groups providing the knowledge. It also moves us a step closer towards building a machine that doesn't assume a rigid framework of universal (and likely Western-biased) commonsense knowledge, but rather has the ability to reason in a contextually and culturally sensitive way. Our hope is that cultural knowledge of this sort will lead to more human-like performance in NLP tasks such as question answering (QA) and text understanding and generation.", "published": "2020-09-11 21:24:33", "link": "http://arxiv.org/abs/2009.05664v3", "categories": ["cs.AI", "cs.CL"], "primary_category": "cs.AI"}
{"title": "Multimodal Depression Severity Prediction from medical bio-markers using Machine Learning Tools and Technologies", "abstract": "Depression has been a leading cause of mental-health illnesses across the world. While the loss of lives due to unmanaged depression is a subject of attention, so is the lack of diagnostic tests and subjectivity involved. Using behavioural cues to automate depression diagnosis and stage prediction in recent years has relatively increased. However, the absence of labelled behavioural datasets and a vast amount of possible variations prove to be a major challenge in accomplishing the task. This paper proposes a novel Custom CM Ensemble approach and focuses on a paradigm of a cross-platform smartphone application that takes multimodal inputs from a user through a series of pre-defined questions, sends it to the Cloud ML architecture and conveys back a depression quotient, representative of its severity. Our app estimates the severity of depression based on a multi-class classification model by utilizing the language, audio, and visual modalities. The given approach attempts to detect, emphasize, and classify the features of a depressed person based on the low-level descriptors for verbal and visual features, and context of the language features when prompted with a question. The model achieved a precision value of 0.88 and an accuracy of 91.56%. Further optimization reveals the intramodality and intermodality relevance through the selection of the most influential features within each modality for decision making.", "published": "2020-09-11 20:44:28", "link": "http://arxiv.org/abs/2009.05651v2", "categories": ["cs.AI", "cs.LG"], "primary_category": "cs.AI"}
{"title": "An Argumentation-based Approach for Identifying and Dealing with Incompatibilities among Procedural Goals", "abstract": "During the first step of practical reasoning, i.e. deliberation, an intelligent agent generates a set of pursuable goals and then selects which of them he commits to achieve. An intelligent agent may in general generate multiple pursuable goals, which may be incompatible among them. In this paper, we focus on the definition, identification and resolution of these incompatibilities. The suggested approach considers the three forms of incompatibility introduced by Castelfranchi and Paglieri, namely the terminal incompatibility, the instrumental or resources incompatibility and the superfluity. We characterise computationally these forms of incompatibility by means of arguments that represent the plans that allow an agent to achieve his goals. Thus, the incompatibility among goals is defined based on the conflicts among their plans, which are represented by means of attacks in an argumentation framework. We also work on the problem of goals selection; we propose to use abstract argumentation theory to deal with this problem, i.e. by applying argumentation semantics. We use a modified version of the \"cleaner world\" scenario in order to illustrate the performance of our proposal.", "published": "2020-09-11 01:01:34", "link": "http://arxiv.org/abs/2009.05186v1", "categories": ["cs.AI"], "primary_category": "cs.AI"}
{"title": "Generalized Minimal Distortion Principle for Blind Source Separation", "abstract": "We revisit the source image estimation problem from blind source separation (BSS). We generalize the traditional minimum distortion principle to maximum likelihood estimation with a model for the residual spectrograms. Because residual spectrograms typically contain other sources, we propose to use a mixed-norm model that lets us finely tune sparsity in time and frequency. We propose to carry out the minimization of the mixed-norm via majorization-minimization optimization, leading to an iteratively reweighted least-squares algorithm. The algorithm balances well efficiency and ease of implementation. We assess the performance of the proposed method as applied to two well-known determined BSS and one joint BSS-dereverberation algorithms. We find out that it is possible to tune the parameters to improve separation by up to 2 dB, with no increase in distortion, and at little computational cost. The method thus provides a cheap and easy way to boost the performance of blind source separation.", "published": "2020-09-11 08:43:03", "link": "http://arxiv.org/abs/2009.05288v1", "categories": ["eess.AS", "cs.SD", "eess.SP"], "primary_category": "eess.AS"}
{"title": "Machine learning-based EDFA Gain Model Generalizable to Multiple Physical Devices", "abstract": "We report a neural-network based erbium-doped fiber amplifier (EDFA) gain model built from experimental measurements. The model shows low gain-prediction error for both the same device used for training (MSE $\\leq$ 0.04 dB$^2$) and different physical units of the same make (generalization MSE $\\leq$ 0.06 dB$^2$).", "published": "2020-09-11 10:23:56", "link": "http://arxiv.org/abs/2009.05326v1", "categories": ["eess.SP", "cs.LG", "physics.optics"], "primary_category": "eess.SP"}
{"title": "Power Evolution Prediction and Optimization in a Multi-span System Based on Component-wise System Modeling", "abstract": "Cascades of a machine learning-based EDFA gain model trained on a single physical device and a fully differentiable stimulated Raman scattering fiber model are used to predict and optimize the power profile at the output of an experimental multi-span fully-loaded C-band optical communication system.", "published": "2020-09-11 11:26:06", "link": "http://arxiv.org/abs/2009.05348v1", "categories": ["eess.SP", "cs.LG", "math.OC"], "primary_category": "eess.SP"}
