{"title": "MVStylizer: An Efficient Edge-Assisted Video Photorealistic Style Transfer System for Mobile Phones", "abstract": "Recent research has made great progress in realizing neural style transfer of images, which denotes transforming an image to a desired style. Many users start to use their mobile phones to record their daily life, and then edit and share the captured images and videos with other users. However, directly applying existing style transfer approaches on videos, i.e., transferring the style of a video frame by frame, requires an extremely large amount of computation resources. It is still technically unaffordable to perform style transfer of videos on mobile phones. To address this challenge, we propose MVStylizer, an efficient edge-assisted photorealistic video style transfer system for mobile phones. Instead of performing stylization frame by frame, only key frames in the original video are processed by a pre-trained deep neural network (DNN) on edge servers, while the rest of stylized intermediate frames are generated by our designed optical-flow-based frame interpolation algorithm on mobile phones. A meta-smoothing module is also proposed to simultaneously upscale a stylized frame to arbitrary resolution and remove style transfer related distortions in these upscaled frames. In addition, for the sake of continuously enhancing the performance of the DNN model on the edge server, we adopt a federated learning scheme to keep retraining each DNN model on the edge server with collected data from mobile clients and syncing with a global DNN model on the cloud server. Such a scheme effectively leverages the diversity of collected data from various mobile clients and efficiently improves the system performance. Our experiments demonstrate that MVStylizer can generate stylized videos with an even better visual quality compared to the state-of-the-art method while achieving 75.5$\\times$ speedup for 1920$\\times$1080 videos.", "published": "2020-05-24 00:54:27", "link": "http://arxiv.org/abs/2005.11630v2", "categories": ["eess.IV", "cs.CV", "cs.LG"], "primary_category": "eess.IV"}
{"title": "PoliteCamera: Respecting Strangers' Privacy in Mobile Photographing", "abstract": "Camera is a standard on-board sensor of modern mobile phones. It makes photo taking popular due to its convenience and high resolution. However, when users take a photo of a scenery, a building or a target person, a stranger may also be unintentionally captured in the photo. Such photos expose the location and activity of strangers, and hence may breach their privacy. In this paper, we propose a cooperative mobile photographing scheme called PoliteCamera to protect strangers' privacy. Through the cooperation between a photographer and a stranger, the stranger's face in a photo can be automatically blurred upon his request when the photo is taken. Since multiple strangers nearby the photographer might send out blurring requests but not all of them are in the photo, an adapted balanced convolutional neural network (ABCNN) is proposed to determine whether the requesting stranger is in the photo based on facial attributes. Evaluations demonstrate that the ABCNN can accurately predict facial attributes and PoliteCamera can provide accurate privacy protection for strangers.", "published": "2020-05-24 01:18:13", "link": "http://arxiv.org/abs/2005.11634v1", "categories": ["cs.CR", "cs.CV", "cs.CY"], "primary_category": "cs.CR"}
{"title": "Sum-Rate Maximization for Multiuser MISO Downlink Systems with Self-sustainable IRS", "abstract": "This paper investigates multiuser multi-input single-output (MISO) downlink communications assisted by a self-sustainable intelligent reflection surface (IRS), which can harvest power from the received signals. We study the joint design of the beamformer at an access point (AP) and the phase shifts and the power harvesting schedule at an IRS for maximizing the system sum-rate. The design is formulated as a non-convex optimization problem taking into account the capability of IRS elements to harvest wireless power for realizing self-sustainability. Subsequently, we propose a computationally-efficient alternating algorithm to obtain a suboptimal solution to the design problem. Our simulation results unveil that: 1) there is a non-trivial trade-off between the system sum-rate and self-sustainability in IRS-assisted systems; 2) the performance gain achieved by the proposed scheme is improved with an increasing number of IRS elements; 3) an IRS equipped with small bit-resolution discrete phase shifters is sufficient to achieve a considerable system sum-rate of an ideal case with continuous phase shifts.", "published": "2020-05-24 06:12:29", "link": "http://arxiv.org/abs/2005.11663v1", "categories": ["eess.SP", "cs.IT"], "primary_category": "eess.SP"}
