{"title": "Complex networks for event detection in heterogeneous high volume news streams", "abstract": "Detecting important events in high volume news streams is an important task for a variety of purposes.The volume and rate of online news increases the need for automated event detection methods thatcan operate in real time. In this paper we develop a network-based approach that makes the workingassumption that important news events always involve named entities (such as persons, locationsand organizations) that are linked in news articles. Our approach uses natural language processingtechniques to detect these entities in a stream of news articles and then creates a time-stamped seriesof networks in which the detected entities are linked by co-occurrence in articles and sentences. Inthis prototype, weighted node degree is tracked over time and change-point detection used to locateimportant events. Potential events are characterized and distinguished using community detectionon KeyGraphs that relate named entities and informative noun-phrases from related articles. Thismethodology already produces promising results and will be extended in future to include a widervariety of complex network analysis techniques.", "published": "2020-05-28 02:45:43", "link": "http://arxiv.org/abs/2005.13751v1", "categories": ["cs.SI", "cs.CL", "cs.IR"], "primary_category": "cs.SI"}
{"title": "JointMap: Joint Query Intent Understanding For Modeling Intent Hierarchies in E-commerce Search", "abstract": "An accurate understanding of a user's query intent can help improve the performance of downstream tasks such as query scoping and ranking. In the e-commerce domain, recent work in query understanding focuses on the query to product-category mapping. But, a small yet significant percentage of queries (in our website 1.5% or 33M queries in 2019) have non-commercial intent associated with them. These intents are usually associated with non-commercial information seeking needs such as discounts, store hours, installation guides, etc. In this paper, we introduce Joint Query Intent Understanding (JointMap), a deep learning model to simultaneously learn two different high-level user intent tasks: 1) identifying a query's commercial vs. non-commercial intent, and 2) associating a set of relevant product categories in taxonomy to a product query. JointMap model works by leveraging the transfer bias that exists between these two related tasks through a joint-learning process. As curating a labeled data set for these tasks can be expensive and time-consuming, we propose a distant supervision approach in conjunction with an active learning model to generate high-quality training data sets. To demonstrate the effectiveness of JointMap, we use search queries collected from a large commercial website. Our results show that JointMap significantly improves both \"commercial vs. non-commercial\" intent prediction and product category mapping by 2.3% and 10% on average over state-of-the-art deep learning methods. Our findings suggest a promising direction to model the intent hierarchies in an e-commerce search engine.", "published": "2020-05-28 05:20:00", "link": "http://arxiv.org/abs/2005.13783v2", "categories": ["cs.IR", "cs.CL"], "primary_category": "cs.IR"}
{"title": "Hyperbolic Manifold Regression", "abstract": "Geometric representation learning has recently shown great promise in several machine learning settings, ranging from relational learning to language processing and generative models. In this work, we consider the problem of performing manifold-valued regression onto an hyperbolic space as an intermediate component for a number of relevant machine learning applications. In particular, by formulating the problem of predicting nodes of a tree as a manifold regression task in the hyperbolic space, we propose a novel perspective on two challenging tasks: 1) hierarchical classification via label embeddings and 2) taxonomy extension of hyperbolic representations. To address the regression problem we consider previous methods as well as proposing two novel approaches that are computationally more advantageous: a parametric deep learning model that is informed by the geodesics of the target space and a non-parametric kernel-method for which we also prove excess risk bounds. Our experiments show that the strategy of leveraging the hyperbolic geometry is promising. In particular, in the taxonomy expansion setting, we find that the hyperbolic-based estimators significantly outperform methods performing regression in the ambient Euclidean space.", "published": "2020-05-28 10:16:30", "link": "http://arxiv.org/abs/2005.13885v1", "categories": ["stat.ML", "cs.LG"], "primary_category": "stat.ML"}
{"title": "Hybrid data and model driven algorithms for angular power spectrum estimation", "abstract": "We propose two algorithms that use both models and datasets to estimate angular power spectra from channel covariance matrices in massive MIMO systems. The first algorithm is an iterative fixed-point method that solves a hierarchical problem. It uses model knowledge to narrow down candidate angular power spectra to a set that is consistent with a measured covariance matrix. Then, from this set, the algorithm selects the angular power spectrum with minimum distance to its expected value with respect to a Hilbertian metric learned from data. The second algorithm solves an alternative optimization problem with a single application of a solver for nonnegative least squares programs. By fusing information obtained from datasets and models, both algorithms can outperform existing approaches based on models, and they are also robust against environmental changes and small datasets.", "published": "2020-05-28 13:50:57", "link": "http://arxiv.org/abs/2005.14003v6", "categories": ["eess.SP"], "primary_category": "eess.SP"}
{"title": "A Vision to Smart Radio Environment: Surface Wave Communication Superhighways", "abstract": "Complementary to traditional approaches that focus on transceiver design for bringing the best out of unstable, lossy fading channels, one radical development in wireless communications that has recently emerged is to pursue a smart radio environment by using software-defined materials or programmable metasurfaces for establishing favourable propagation conditions. This article portraits a vision of communication superhighways enabled by surface wave (SW) propagation on \"smart surfaces\" for future smart radio environments. The concept differs from the mainstream efforts of using passive elements on a large surface for bouncing off radio waves intelligently towards intended user terminals. In this vision, energy efficiency will be ultra-high, due to much less pathloss compared to free space propagation, and the fact that SW is inherently confined to the smart surface not only greatly simplifies the task of interference management, but also makes possible exceptionally localized high-speed interference-free data access. We shall outline the opportunities and associated challenges arisen from the SW paradigm. We shall also attempt to shed light on several key enabling technologies that make this realizable. One important technology which will be discussed is a software-controlled fluidic waveguiding architecture that permits dynamic creation of high-throughput data highways.", "published": "2020-05-28 15:25:08", "link": "http://arxiv.org/abs/2005.14082v1", "categories": ["eess.SP", "cs.IT"], "primary_category": "eess.SP"}
