{"title": "A Knowledge-Enhanced Recommendation Model with Attribute-Level Co-Attention", "abstract": "Deep neural networks (DNNs) have been widely employed in recommender systems including incorporating attention mechanism for performance improvement. However, most of existing attention-based models only apply item-level attention on user side, restricting the further enhancement of recommendation performance. In this paper, we propose a knowledge-enhanced recommendation model ACAM, which incorporates item attributes distilled from knowledge graphs (KGs) as side information, and is built with a co-attention mechanism on attribute-level to achieve performance gains. Specifically, each user and item in ACAM are represented by a set of attribute embeddings at first. Then, user representations and item representations are augmented simultaneously through capturing the correlations between different attributes by a co-attention module. Our extensive experiments over two realistic datasets show that the user representations and item representations augmented by attribute-level co-attention gain ACAM's superiority over the state-of-the-art deep models.", "published": "2020-06-18 01:53:39", "link": "http://arxiv.org/abs/2006.10233v1", "categories": ["cs.IR", "cs.LG"], "primary_category": "cs.IR"}
{"title": "Interactive Recommender System via Knowledge Graph-enhanced Reinforcement Learning", "abstract": "Interactive recommender system (IRS) has drawn huge attention because of its flexible recommendation strategy and the consideration of optimal long-term user experiences. To deal with the dynamic user preference and optimize accumulative utilities, researchers have introduced reinforcement learning (RL) into IRS. However, RL methods share a common issue of sample efficiency, i.e., huge amount of interaction data is required to train an effective recommendation policy, which is caused by the sparse user responses and the large action space consisting of a large number of candidate items. Moreover, it is infeasible to collect much data with explorative policies in online environments, which will probably harm user experience. In this work, we investigate the potential of leveraging knowledge graph (KG) in dealing with these issues of RL methods for IRS, which provides rich side information for recommendation decision making. Instead of learning RL policies from scratch, we make use of the prior knowledge of the item correlation learned from KG to (i) guide the candidate selection for better candidate item retrieval, (ii) enrich the representation of items and user states, and (iii) propagate user preferences among the correlated items over KG to deal with the sparsity of user feedback. Comprehensive experiments have been conducted on two real-world datasets, which demonstrate the superiority of our approach with significant improvements against state-of-the-arts.", "published": "2020-06-18 09:48:48", "link": "http://arxiv.org/abs/2006.10389v1", "categories": ["cs.IR"], "primary_category": "cs.IR"}
{"title": "Train Unit Shunting and Servicing: a Real-Life Application of Multi-Agent Path Finding", "abstract": "In between transportation services, trains are parked and maintained at shunting yards. The conflict-free routing of trains to and on these yards and the scheduling of service and maintenance tasks is known as the train unit shunting and service problem. Efficient use of the capacity of these yards is becoming increasingly important, because of increasing numbers of trains without proportional extensions of the yards. Efficiently scheduling maintenance activities is extremely challenging: currently only heuristics succeed in finding solutions to the integrated problem at all. Bounds are needed to determine the quality of these heuristics, and also to support investment decisions on increasing the yard capacity. For this, a complete algorithm for a possibly relaxed problem model is required. We analyze the potential of extending the model for multi-agent path finding to be used for such a relaxation.", "published": "2020-06-18 10:57:12", "link": "http://arxiv.org/abs/2006.10422v1", "categories": ["cs.MA", "cs.DM"], "primary_category": "cs.MA"}
