{"title": "Assessment of Unconsciousness for Memory Consolidation Using EEG Signals", "abstract": "The assessment of consciousness and unconsciousness is a challenging issue in modern neuroscience. Consciousness is closely related to memory consolidation in that memory is a critical component of conscious experience. So far, many studies have been reported on memory consolidation during consciousness, but there is little research on memory consolidation during unconsciousness. Therefore, we aim to assess the unconsciousness in terms of memory consolidation using electroencephalogram signals. In particular, we used unconscious state during a nap; because sleep is the only state in which consciousness disappears under normal physiological conditions. Seven participants performed two memory tasks (word-pairs and visuo-spatial) before and after the nap to assess the memory consolidation during unconsciousness. As a result, spindle power in central, parietal, occipital regions during unconsciousness was positively correlated with the performance of location memory. With the memory performance, there was also a negative correlation between delta connectivity and word-pairs memory, alpha connectivity and location memory, and spindle connectivity and word-pairs memory. We additionally observed the significant relationship between unconsciousness and brain changes during memory recall before and after the nap. These findings could help present new insights into the assessment of unconsciousness by exploring the relationship with memory consolidation.", "published": "2020-05-15 06:49:42", "link": "http://arxiv.org/abs/2005.08620v1", "categories": ["eess.SP", "cs.NE"], "primary_category": "eess.SP"}
{"title": "How to Make 5G Communications \"Invisible\": Adversarial Machine Learning for Wireless Privacy", "abstract": "We consider the problem of hiding wireless communications from an eavesdropper that employs a deep learning (DL) classifier to detect whether any transmission of interest is present or not. There exists one transmitter that transmits to its receiver in the presence of an eavesdropper, while a cooperative jammer (CJ) transmits carefully crafted adversarial perturbations over the air to fool the eavesdropper into classifying the received superposition of signals as noise. The CJ puts an upper bound on the strength of perturbation signal to limit its impact on the bit error rate (BER) at the receiver. We show that this adversarial perturbation causes the eavesdropper to misclassify the received signals as noise with high probability while increasing the BER only slightly. On the other hand, the CJ cannot fool the eavesdropper by simply transmitting Gaussian noise as in conventional jamming and instead needs to craft perturbation signals built by adversarial machine learning to enable covert communications. Our results show that signals with different modulation types and eventually 5G communications can be effectively hidden from an eavesdropper even if it is equipped with a DL classifier to detect transmissions.", "published": "2020-05-15 17:45:11", "link": "http://arxiv.org/abs/2005.07675v1", "categories": ["eess.SP", "cs.LG", "cs.NI", "stat.ML"], "primary_category": "eess.SP"}
{"title": "Enabling Seamless Device Association with DevLoc using Light Bulb Networks for Indoor IoT Environments", "abstract": "To enable serendipitous interaction for indoor IoT environments, spontaneous device associations are of particular interest so that users set up a connection in an ad-hoc manner. Based on the similarity of light signals, our system named DevLoc takes advantage of ubiquitous light sources around us to perform continuous and seamless device grouping. We provide a configuration framework to control the spatial granularity of user's proximity by managing the lighting infrastructure through customized visible light communication. To realize either proximity-based or location-based services, we support two modes of device associations between different entities: device-to-device and device-to-area. Regarding the best performing method for device grouping, machine learning-based signal similarity performs in general best compared to distance and correlation metrics. Furthermore, we analyze patterns of device associations to improve the data privacy by recognizing semantic device groups, such as personal and stranger's devices, allowing automated data sharing policies.", "published": "2020-05-15 18:33:42", "link": "http://arxiv.org/abs/2005.07731v1", "categories": ["eess.SP", "cs.LG"], "primary_category": "eess.SP"}
