{"title": "Bayesian Neural Networks at Scale: A Performance Analysis and Pruning Study", "abstract": "Bayesian neural Networks (BNNs) are a promising method of obtaining statistical uncertainties for neural network predictions but with a higher computational overhead which can limit their practical usage. This work explores the use of high performance computing with distributed training to address the challenges of training BNNs at scale. We present a performance and scalability comparison of training the VGG-16 and Resnet-18 models on a Cray-XC40 cluster. We demonstrate that network pruning can speed up inference without accuracy loss and provide an open source software package, {\\it{BPrune}} to automate this pruning. For certain models we find that pruning up to 80\\% of the network results in only a 7.0\\% loss in accuracy. With the development of new hardware accelerators for Deep Learning, BNNs are of considerable interest for benchmarking performance. This analysis of training a BNN at scale outlines the limitations and benefits compared to a conventional neural network.", "published": "2020-05-23 23:15:34", "link": "http://arxiv.org/abs/2005.11619v2", "categories": ["cs.LG", "cs.CV", "eess.IV", "stat.ML"], "primary_category": "cs.LG"}
{"title": "Physical Layer Authentication for Non-Coherent Massive SIMO-Enabled Industrial IoT Communications", "abstract": "Achieving ultra-reliable, low-latency and secure communications is essential for realizing the industrial Internet of Things (IIoT). Non-coherent massive multiple-input multiple-output (MIMO) is one of promising techniques to fulfill ultra-reliable and low-latency requirements. In addition, physical layer authentication (PLA) technology is particularly suitable for secure IIoT communications thanks to its low-latency attribute. A PLA method for non-coherent massive single-input multiple-output (SIMO) IIoT communication systems is proposed in this paper. This method realizes PLA by embedding an authentication signal (tag) into a message signal, referred to as \"message-based tag embedding\". It is different from traditional PLA methods utilizing uniform power tags. We design the optimal tag embedding and optimize the power allocation between the message and tag signals to characterize the trade-off between the message and tag error performance. Numerical results show that the proposed message-based tag embedding PLA method is more accurate than the traditional uniform tag embedding method which has an unavoidable tag error floor close to 10%.", "published": "2020-05-23 14:34:53", "link": "http://arxiv.org/abs/2005.12686v1", "categories": ["eess.SP", "cs.IT"], "primary_category": "eess.SP"}
