{"title": "A change of variable formula with applications to multi-dimensional optimal stopping problems", "abstract": "We derive a change of variable formula for $C^1$ functions $U:\\R_+\\times\\R^m\\to\\R$ whose second order spatial derivatives may explode and not be integrable in the neighbourhood of a surface $b:\\R_+\\times\\R^{m-1}\\to \\R$ that splits the state space into two sets $\\cC$ and $\\cD$. The formula is tailored for applications in problems of optimal stopping where it is generally very hard to control the second order derivatives of the value function near the optimal stopping boundary. Differently to other existing papers on similar topics we only require that the surface $b$ be monotonic in each variable and we formally obtain the same expression as the classical Itô's formula.", "published": "2021-04-12 21:46:46", "link": "http://arxiv.org/abs/2104.05835v4", "categories": ["math.PR", "math.OC", "q-fin.MF"], "primary_category": "math.PR"}
{"title": "Time is Money: The Equilibrium Trading Horizon and Optimal Arrival Price", "abstract": "Executing even moderately large derivatives orders can be expensive and risky; it's hard to balance the uncertainty of working an order over time versus paying a liquidity premium for immediate execution. Here, we introduce the Time Is Money model, which calculates the Equilibrium Trading Horizon over which to execute an order within the adversarial forces of variance risk and liquidity premium. We construct a hypothetical at-the-money option within Arithmetic Brownian Motion and invert the Bachelier model to compute an inflection point between implied variance and liquidity cost as governed by a central limit order book, each in real time as they evolve. As a result, we demonstrate a novel, continuous-time Arrival Price framework. Further, we argue that traders should be indifferent to choosing between variance risk and liquidity cost, unless they have a predetermined bias or an exogenous position with a convex payoff. We, therefore, introduce half-life factor asymptotics to the model based on a convexity factor and compare results to existing models. We also describe a specialization of the model for trading a basket of correlated instruments, as exemplified by a futures calendar spread. Finally, we establish groundwork for microstructure optimizations as well as explore short term drift and conditional expected slippage within the Equilibrium Horizon framework.", "published": "2021-04-12 22:15:41", "link": "http://arxiv.org/abs/2104.05844v1", "categories": ["q-fin.MF", "q-fin.PM", "q-fin.TR"], "primary_category": "q-fin.MF"}
