{"title": "A Training-free and Reference-free Summarization Evaluation Metric via\n  Centrality-weighted Relevance and Self-referenced Redundancy", "abstract": "In recent years, reference-based and supervised summarization evaluation\nmetrics have been widely explored. However, collecting human-annotated\nreferences and ratings are costly and time-consuming. To avoid these\nlimitations, we propose a training-free and reference-free summarization\nevaluation metric. Our metric consists of a centrality-weighted relevance score\nand a self-referenced redundancy score. The relevance score is computed between\nthe pseudo reference built from the source document and the given summary,\nwhere the pseudo reference content is weighted by the sentence centrality to\nprovide importance guidance. Besides an $F_1$-based relevance score, we also\ndesign an $F_\\beta$-based variant that pays more attention to the recall score.\nAs for the redundancy score of the summary, we compute a self-masked similarity\nscore with the summary itself to evaluate the redundant information in the\nsummary. Finally, we combine the relevance and redundancy scores to produce the\nfinal evaluation score of the given summary. Extensive experiments show that\nour methods can significantly outperform existing methods on both\nmulti-document and single-document summarization evaluation.", "published": "2021-06-26 05:11:27", "link": "http://arxiv.org/abs/2106.13945v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Answering Chinese Elementary School Social Study Multiple Choice\n  Questions", "abstract": "We present a novel approach to answer the Chinese elementary school Social\nStudy Multiple Choice questions. Although BERT has demonstrated excellent\nperformance on Reading Comprehension tasks, it is found not good at handling\nsome specific types of questions, such as Negation, All-of-the-above, and\nNone-of-the-above. We thus propose a novel framework to cascade BERT with a\nPre-Processor and an Answer-Selector modules to tackle the above challenges.\nExperimental results show the proposed approach effectively improves the\nperformance of BERT, and thus demonstrate the feasibility of supplementing BERT\nwith additional modules.", "published": "2021-06-26 14:15:21", "link": "http://arxiv.org/abs/2107.02893v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "UMIC: An Unreferenced Metric for Image Captioning via Contrastive\n  Learning", "abstract": "Despite the success of various text generation metrics such as BERTScore, it\nis still difficult to evaluate the image captions without enough reference\ncaptions due to the diversity of the descriptions. In this paper, we introduce\na new metric UMIC, an Unreferenced Metric for Image Captioning which does not\nrequire reference captions to evaluate image captions. Based on\nVision-and-Language BERT, we train UMIC to discriminate negative captions via\ncontrastive learning. Also, we observe critical problems of the previous\nbenchmark dataset (i.e., human annotations) on image captioning metric, and\nintroduce a new collection of human annotations on the generated captions. We\nvalidate UMIC on four datasets, including our new dataset, and show that UMIC\nhas a higher correlation than all previous metrics that require multiple\nreferences. We release the benchmark dataset and pre-trained models to compute\nthe UMIC.", "published": "2021-06-26 13:27:14", "link": "http://arxiv.org/abs/2106.14019v1", "categories": ["cs.CL", "cs.CV"], "primary_category": "cs.CL"}
{"title": "Benchmarking Differential Privacy and Federated Learning for BERT Models", "abstract": "Natural Language Processing (NLP) techniques can be applied to help with the\ndiagnosis of medical conditions such as depression, using a collection of a\nperson's utterances. Depression is a serious medical illness that can have\nadverse effects on how one feels, thinks, and acts, which can lead to emotional\nand physical problems. Due to the sensitive nature of such data, privacy\nmeasures need to be taken for handling and training models with such data. In\nthis work, we study the effects that the application of Differential Privacy\n(DP) has, in both a centralized and a Federated Learning (FL) setup, on\ntraining contextualized language models (BERT, ALBERT, RoBERTa and DistilBERT).\nWe offer insights on how to privately train NLP models and what architectures\nand setups provide more desirable privacy utility trade-offs. We envisage this\nwork to be used in future healthcare and mental health studies to keep medical\nhistory private. Therefore, we provide an open-source implementation of this\nwork.", "published": "2021-06-26 08:52:02", "link": "http://arxiv.org/abs/2106.13973v2", "categories": ["cs.CL", "cs.CR", "cs.LG"], "primary_category": "cs.CL"}
{"title": "PhyCRNet: Physics-informed Convolutional-Recurrent Network for Solving\n  Spatiotemporal PDEs", "abstract": "Partial differential equations (PDEs) play a fundamental role in modeling and\nsimulating problems across a wide range of disciplines. Recent advances in deep\nlearning have shown the great potential of physics-informed neural networks\n(PINNs) to solve PDEs as a basis for data-driven modeling and inverse analysis.\nHowever, the majority of existing PINN methods, based on fully-connected NNs,\npose intrinsic limitations to low-dimensional spatiotemporal parameterizations.\nMoreover, since the initial/boundary conditions (I/BCs) are softly imposed via\npenalty, the solution quality heavily relies on hyperparameter tuning. To this\nend, we propose the novel physics-informed convolutional-recurrent learning\narchitectures (PhyCRNet and PhyCRNet-s) for solving PDEs without any labeled\ndata. Specifically, an encoder-decoder convolutional long short-term memory\nnetwork is proposed for low-dimensional spatial feature extraction and temporal\nevolution learning. The loss function is defined as the aggregated discretized\nPDE residuals, while the I/BCs are hard-encoded in the network to ensure\nforcible satisfaction (e.g., periodic boundary padding). The networks are\nfurther enhanced by autoregressive and residual connections that explicitly\nsimulate time marching. The performance of our proposed methods has been\nassessed by solving three nonlinear PDEs (e.g., 2D Burgers' equations, the\n$\\lambda$-$\\omega$ and FitzHugh Nagumo reaction-diffusion equations), and\ncompared against the start-of-the-art baseline algorithms. The numerical\nresults demonstrate the superiority of our proposed methodology in the context\nof solution accuracy, extrapolability and generalizability.", "published": "2021-06-26 22:22:19", "link": "http://arxiv.org/abs/2106.14103v1", "categories": ["cs.LG", "cs.CL", "cs.NA", "math.NA"], "primary_category": "cs.LG"}
{"title": "Core Challenges in Embodied Vision-Language Planning", "abstract": "Recent advances in the areas of multimodal machine learning and artificial\nintelligence (AI) have led to the development of challenging tasks at the\nintersection of Computer Vision, Natural Language Processing, and Embodied AI.\nWhereas many approaches and previous survey pursuits have characterised one or\ntwo of these dimensions, there has not been a holistic analysis at the center\nof all three. Moreover, even when combinations of these topics are considered,\nmore focus is placed on describing, e.g., current architectural methods, as\nopposed to also illustrating high-level challenges and opportunities for the\nfield. In this survey paper, we discuss Embodied Vision-Language Planning\n(EVLP) tasks, a family of prominent embodied navigation and manipulation\nproblems that jointly use computer vision and natural language. We propose a\ntaxonomy to unify these tasks and provide an in-depth analysis and comparison\nof the new and current algorithmic approaches, metrics, simulated environments,\nas well as the datasets used for EVLP tasks. Finally, we present the core\nchallenges that we believe new EVLP works should seek to address, and we\nadvocate for task construction that enables model generalizability and furthers\nreal-world deployment.", "published": "2021-06-26 05:18:58", "link": "http://arxiv.org/abs/2106.13948v4", "categories": ["cs.LG", "cs.AI", "cs.CL", "cs.CV", "cs.RO"], "primary_category": "cs.LG"}
{"title": "An Audio Envelope Generator Derived from Industrial Process Control", "abstract": "Audio envelopes serve a crucial role in ensuring the versatility of\nsynthesizers in producing timbres. To this end, the Attack, Decay, Release and\nSustain (ADSR) envelope generator and its derivatives have been established as\na mainstay in modern music. However, there may be merit in exploring alternate\ntechniques to produce envelopes that could not only resemble ADSR but also be\nused to create novel timbres. Consequently, an attempt is made in this research\nto formulate the framework of a new envelope generator by redefining the\nProportional-Integral-Derivative (PID) algorithm used in feedback-based process\ncontrol. Additionally, a detailed analysis is made on the modes of operation\nand the nature of envelopes thus generated to establish it as a potential\nharbinger of distinctive styles of music.", "published": "2021-06-26 08:33:39", "link": "http://arxiv.org/abs/2106.13966v1", "categories": ["eess.AS", "cs.SD"], "primary_category": "eess.AS"}
