{"title": "Cross-Lingual Dialogue Dataset Creation via Outline-Based Generation", "abstract": "Multilingual task-oriented dialogue (ToD) facilitates access to services and\ninformation for many (communities of) speakers. Nevertheless, the potential of\nthis technology is not fully realised, as current datasets for multilingual ToD\n- both for modular and end-to-end modelling - suffer from severe limitations.\n1) When created from scratch, they are usually small in scale and fail to cover\nmany possible dialogue flows. 2) Translation-based ToD datasets might lack\nnaturalness and cultural specificity in the target language. In this work, to\ntackle these limitations we propose a novel outline-based annotation process\nfor multilingual ToD datasets, where domain-specific abstract schemata of\ndialogue are mapped into natural language outlines. These in turn guide the\ntarget language annotators in writing a dialogue by providing instructions\nabout each turn's intents and slots. Through this process we annotate a new\nlarge-scale dataset for training and evaluation of multilingual and\ncross-lingual ToD systems. Our Cross-lingual Outline-based Dialogue dataset\n(termed COD) enables natural language understanding, dialogue state tracking,\nand end-to-end dialogue modelling and evaluation in 4 diverse languages:\nArabic, Indonesian, Russian, and Kiswahili. Qualitative and quantitative\nanalyses of COD versus an equivalent translation-based dataset demonstrate\nimprovements in data quality, unlocked by the outline-based approach. Finally,\nwe benchmark a series of state-of-the-art systems for cross-lingual ToD,\nsetting reference scores for future work and demonstrating that COD prevents\nover-inflated performance, typically met with prior translation-based ToD\ndatasets.", "published": "2022-01-31 18:11:21", "link": "http://arxiv.org/abs/2201.13405v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Constrained Density Matching and Modeling for Cross-lingual Alignment of\n  Contextualized Representations", "abstract": "Multilingual representations pre-trained with monolingual data exhibit\nconsiderably unequal task performances across languages. Previous studies\naddress this challenge with resource-intensive contextualized alignment, which\nassumes the availability of large parallel data, thereby leaving\nunder-represented language communities behind. In this work, we attribute the\ndata hungriness of previous alignment techniques to two limitations: (i) the\ninability to sufficiently leverage data and (ii) these techniques are not\ntrained properly. To address these issues, we introduce supervised and\nunsupervised density-based approaches named Real-NVP and GAN-Real-NVP, driven\nby Normalizing Flow, to perform alignment, both dissecting the alignment of\nmultilingual subspaces into density matching and density modeling. We\ncomplement these approaches with our validation criteria in order to guide the\ntraining process. Our experiments encompass 16 alignments, including our\napproaches, evaluated across 6 language pairs, synthetic data and 5 NLP tasks.\nWe demonstrate the effectiveness of our approaches in the scenarios of limited\nand no parallel data. First, our supervised approach trained on 20k parallel\ndata (sentences) mostly surpasses Joint-Align and InfoXLM trained on over 100k\nparallel sentences. Second, parallel data can be removed without sacrificing\nperformance when integrating our unsupervised approach in our bootstrapping\nprocedure, which is theoretically motivated to enforce equality of multilingual\nsubspaces. Moreover, we demonstrate the advantages of validation criteria over\nvalidation data for guiding supervised training.", "published": "2022-01-31 18:41:28", "link": "http://arxiv.org/abs/2201.13429v2", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Learning affective meanings that derives the social behavior using\n  Bidirectional Encoder Representations from Transformers", "abstract": "Predicting the outcome of a process requires modeling the system dynamic and\nobserving the states. In the context of social behaviors, sentiments\ncharacterize the states of the system. Affect Control Theory (ACT) uses\nsentiments to manifest potential interaction. ACT is a generative theory of\nculture and behavior based on a three-dimensional sentiment lexicon.\nTraditionally, the sentiments are quantified using survey data which is fed\ninto a regression model to explain social behavior. The lexicons used in the\nsurvey are limited due to prohibitive cost. This paper uses a fine-tuned\nBidirectional Encoder Representations from Transformers (BERT) model to develop\na replacement for these surveys. This model achieves state-of-the-art accuracy\nin estimating affective meanings, expanding the affective lexicon, and allowing\nmore behaviors to be explained.", "published": "2022-01-31 19:58:28", "link": "http://arxiv.org/abs/2202.00065v2", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Are Mutually Intelligible Languages Easier to Translate?", "abstract": "Two languages are considered mutually intelligible if their native speakers\ncan communicate with each other, while using their own mother tongue. How does\nthe fact that humans perceive a language pair as mutually intelligible affect\nthe ability to learn a translation model between them? We hypothesize that the\namount of data needed to train a neural ma-chine translation model is\nanti-proportional to the languages' mutual intelligibility. Experiments on the\nRomance language group reveal that there is indeed strong correlation between\nthe area under a model's learning curve and mutual intelligibility scores\nobtained by studying human speakers.", "published": "2022-01-31 09:22:23", "link": "http://arxiv.org/abs/2201.13072v1", "categories": ["cs.CL", "cs.LG"], "primary_category": "cs.CL"}
{"title": "POTATO: exPlainable infOrmation exTrAcTion framewOrk", "abstract": "We present POTATO, a task- and languageindependent framework for\nhuman-in-the-loop (HITL) learning of rule-based text classifiers using\ngraph-based features. POTATO handles any type of directed graph and supports\nparsing text into Abstract Meaning Representations (AMR), Universal\nDependencies (UD), and 4lang semantic graphs. A streamlit-based user interface\nallows users to build rule systems from graph patterns, provides real-time\nevaluation based on ground truth data, and suggests rules by ranking graph\nfeatures using interpretable machine learning models. Users can also provide\npatterns over graphs using regular expressions, and POTATO can recommend\nrefinements of such rules. POTATO is applied in projects across domains and\nlanguages, including classification tasks on German legal text and English\nsocial media data. All components of our system are written in Python, can be\ninstalled via pip, and are released under an MIT License on GitHub.", "published": "2022-01-31 13:43:02", "link": "http://arxiv.org/abs/2201.13230v2", "categories": ["cs.CL", "cs.LG"], "primary_category": "cs.CL"}
{"title": "Learning Fair Representations via Rate-Distortion Maximization", "abstract": "Text representations learned by machine learning models often encode\nundesirable demographic information of the user. Predictive models based on\nthese representations can rely on such information, resulting in biased\ndecisions. We present a novel debiasing technique, Fairness-aware Rate\nMaximization (FaRM), that removes protected information by making\nrepresentations of instances belonging to the same protected attribute class\nuncorrelated, using the rate-distortion function. FaRM is able to debias\nrepresentations with or without a target task at hand. FaRM can also be adapted\nto remove information about multiple protected attributes simultaneously.\nEmpirical evaluations show that FaRM achieves state-of-the-art performance on\nseveral datasets, and learned representations leak significantly less protected\nattribute information against an attack by a non-linear probing network.", "published": "2022-01-31 19:00:52", "link": "http://arxiv.org/abs/2202.00035v2", "categories": ["cs.LG", "cs.CL"], "primary_category": "cs.LG"}
{"title": "QALD-9-plus: A Multilingual Dataset for Question Answering over DBpedia\n  and Wikidata Translated by Native Speakers", "abstract": "The ability to have the same experience for different user groups (i.e.,\naccessibility) is one of the most important characteristics of Web-based\nsystems. The same is true for Knowledge Graph Question Answering (KGQA) systems\nthat provide the access to Semantic Web data via natural language interface.\nWhile following our research agenda on the multilingual aspect of accessibility\nof KGQA systems, we identified several ongoing challenges. One of them is the\nlack of multilingual KGQA benchmarks. In this work, we extend one of the most\npopular KGQA benchmarks - QALD-9 by introducing high-quality questions'\ntranslations to 8 languages provided by native speakers, and transferring the\nSPARQL queries of QALD-9 from DBpedia to Wikidata, s.t., the usability and\nrelevance of the dataset is strongly increased. Five of the languages -\nArmenian, Ukrainian, Lithuanian, Bashkir and Belarusian - to our best knowledge\nwere never considered in KGQA research community before. The latter two of the\nlanguages are considered as \"endangered\" by UNESCO. We call the extended\ndataset QALD-9-plus and made it available online\nhttps://github.com/Perevalov/qald_9_plus.", "published": "2022-01-31 22:19:55", "link": "http://arxiv.org/abs/2202.00120v2", "categories": ["cs.CL", "cs.IR"], "primary_category": "cs.CL"}
{"title": "Network Programming via Computable Products", "abstract": "The User Plane Function (UPF) aims to provide network services in the 3GPP 5G\ncore network. These services need to be implemented on demand inexpensively\nwith provable properties. Existing network dataplane programming languages are\nnot up to the task. A new software paradigm is presented for the UPF. It is\ninspired by model checking a concurrent reactive system where conceptually each\ncomponent of the system is modeled as an extended finite-state machine and\ntheir product is verified. We show how such a product can be computed for one\nexample of a UPF and how its state invariants can be inferred, thereby\neliminating the need to formally verify the product separately. Code can be\ngenerated from the product and regenerated on the fly to remain optimal for the\nprobability distribution of network traffic the UPF must process.", "published": "2022-01-31 01:19:45", "link": "http://arxiv.org/abs/2201.12950v1", "categories": ["cs.SE", "cs.CL", "cs.PL"], "primary_category": "cs.SE"}
{"title": "Corpus for Automatic Structuring of Legal Documents", "abstract": "In populous countries, pending legal cases have been growing exponentially.\nThere is a need for developing techniques for processing and organizing legal\ndocuments. In this paper, we introduce a new corpus for structuring legal\ndocuments. In particular, we introduce a corpus of legal judgment documents in\nEnglish that are segmented into topical and coherent parts. Each of these parts\nis annotated with a label coming from a list of pre-defined Rhetorical Roles.\nWe develop baseline models for automatically predicting rhetorical roles in a\nlegal document based on the annotated corpus. Further, we show the application\nof rhetorical roles to improve performance on the tasks of summarization and\nlegal judgment prediction. We release the corpus and baseline model code along\nwith the paper.", "published": "2022-01-31 11:12:44", "link": "http://arxiv.org/abs/2201.13125v2", "categories": ["cs.CL", "cs.AI", "cs.LG"], "primary_category": "cs.CL"}
{"title": "Correcting diacritics and typos with a ByT5 transformer model", "abstract": "Due to the fast pace of life and online communications and the prevalence of\nEnglish and the QWERTY keyboard, people tend to forgo using diacritics, make\ntypographical errors (typos) when typing in other languages. Restoring\ndiacritics and correcting spelling is important for proper language use and the\ndisambiguation of texts for both humans and downstream algorithms. However,\nboth of these problems are typically addressed separately: the state-of-the-art\ndiacritics restoration methods do not tolerate other typos, but classical\nspellcheckers also cannot deal adequately with all the diacritics missing. In\nthis work, we tackle both problems at once by employing the newly-developed\nuniversal ByT5 byte-level seq2seq transformer model that requires no\nlanguage-specific model structures. For a comparison, we perform diacritics\nrestoration on benchmark datasets of 12 languages, with the addition of\nLithuanian. The experimental investigation proves that our approach is able to\nachieve results (> 98%) comparable to the previous state-of-the-art, despite\nbeing trained less and on fewer data. Our approach is also able to restore\ndiacritics in words not seen during training with > 76% accuracy. Our\nsimultaneous diacritics restoration and typos correction approach reaches > 94%\nalpha-word accuracy on the 13 languages. It has no direct competitors and\nstrongly outperforms classical spell-checking or dictionary-based approaches.\nWe also demonstrate all the accuracies to further improve with more training.\nTaken together, this shows the great real-world application potential of our\nsuggested methods to more data, languages, and error classes.", "published": "2022-01-31 13:52:51", "link": "http://arxiv.org/abs/2201.13242v2", "categories": ["cs.CL", "cs.IR", "cs.LG", "stat.ML", "68T07, 68T50, 68T05", "I.2.6; I.2.7"], "primary_category": "cs.CL"}
{"title": "ROCK: Causal Inference Principles for Reasoning about Commonsense\n  Causality", "abstract": "Commonsense causality reasoning (CCR) aims at identifying plausible causes\nand effects in natural language descriptions that are deemed reasonable by an\naverage person. Although being of great academic and practical interest, this\nproblem is still shadowed by the lack of a well-posed theoretical framework;\nexisting work usually relies on deep language models wholeheartedly, and is\npotentially susceptible to confounding co-occurrences. Motivated by classical\ncausal principles, we articulate the central question of CCR and draw parallels\nbetween human subjects in observational studies and natural languages to adopt\nCCR to the potential-outcomes framework, which is the first such attempt for\ncommonsense tasks. We propose a novel framework, ROCK, to Reason O(A)bout\nCommonsense K(C)ausality, which utilizes temporal signals as incidental\nsupervision, and balances confounding effects using temporal propensities that\nare analogous to propensity scores. The ROCK implementation is modular and\nzero-shot, and demonstrates good CCR capabilities.", "published": "2022-01-31 06:12:39", "link": "http://arxiv.org/abs/2202.00436v2", "categories": ["cs.CL", "cs.AI", "cs.LG", "stat.AP"], "primary_category": "cs.CL"}
{"title": "Disaster Tweets Classification using BERT-Based Language Model", "abstract": "Social networking services have became an important communication channel in\ntime of emergency. The aim of this study is to create a machine learning\nlanguage model that is able to investigate if a person or area was in danger or\nnot. The ubiquitousness of smartphones enables people to announce an emergency\nthey are observing in real-time. Because of this, more agencies are interested\nin programmatically monitoring Twitter (i.e. disaster relief organizations and\nnews agencies). Design a language model that is able to understand and\nacknowledge when a disaster is happening based on the social network posts will\nbecome more and more necessary over time.", "published": "2022-01-31 10:25:29", "link": "http://arxiv.org/abs/2202.00795v1", "categories": ["cs.CL", "cs.AI", "cs.LG"], "primary_category": "cs.CL"}
{"title": "PostGAN: A GAN-Based Post-Processor to Enhance the Quality of Coded\n  Speech", "abstract": "The quality of speech coded by transform coding is affected by various\nartefacts especially when bitrates to quantize the frequency components become\ntoo low. In order to mitigate these coding artefacts and enhance the quality of\ncoded speech, a post-processor that relies on a-priori information transmitted\nfrom the encoder is traditionally employed at the decoder side. In recent\nyears, several data-driven post-postprocessors have been proposed which were\nshown to outperform traditional approaches. In this paper, we propose PostGAN,\na GAN-based neural post-processor that operates in the sub-band domain and\nrelies on the U-Net architecture and a learned affine transform. It has been\ntested on the recently standardized low-complexity, low-delay bluetooth codec\n(LC3) for wideband speech at the lowest bitrate (16 kbit/s). Subjective\nevaluations and objective scores show that the newly introduced post-processor\nsurpasses previously published methods and can improve the quality of coded\nspeech by around 20 MUSHRA points.", "published": "2022-01-31 10:03:37", "link": "http://arxiv.org/abs/2201.13093v1", "categories": ["eess.AS", "cs.SD"], "primary_category": "eess.AS"}
{"title": "partitura: A Python Package for Handling Symbolic Musical Data", "abstract": "This demo paper introduces partitura, a Python package for handling symbolic\nmusical information. The principal aim of this package is to handle richly\nstructured musical information as conveyed by modern staff music notation. It\nprovides a much wider range of possibilities to deal with music than the more\nreductive (but very common) piano roll-oriented approach inspired by the MIDI\nstandard. The package is an open source project and is available on GitHub.", "published": "2022-01-31 11:40:17", "link": "http://arxiv.org/abs/2201.13144v1", "categories": ["cs.SD", "eess.AS"], "primary_category": "cs.SD"}
{"title": "Threshold Independent Evaluation of Sound Event Detection Scores", "abstract": "Performing an adequate evaluation of sound event detection (SED) systems is\nfar from trivial and is still subject to ongoing research. The recently\nproposed polyphonic sound detection (PSD)-receiver operating characteristic\n(ROC) and PSD score (PSDS) make an important step into the direction of an\nevaluation of SED systems which is independent from a certain decision\nthreshold. This allows to obtain a more complete picture of the overall system\nbehavior which is less biased by threshold tuning. Yet, the PSD-ROC is\ncurrently only approximated using a finite set of thresholds. The choice of the\nthresholds used in approximation, however, can have a severe impact on the\nresulting PSDS. In this paper we propose a method which allows for computing\nsystem performance on an evaluation set for all possible thresholds jointly,\nenabling accurate computation not only of the PSD-ROC and PSDS but also of\nother collar-based and intersection-based performance curves. It further allows\nto select the threshold which best fulfills the requirements of a given\napplication. Source code is publicly available in our SED evaluation package\nsed_scores_eval.", "published": "2022-01-31 11:47:02", "link": "http://arxiv.org/abs/2201.13148v1", "categories": ["eess.AS", "cs.SD"], "primary_category": "eess.AS"}
{"title": "Jet noise characterization for advanced pipeline leak detection", "abstract": "The detection of leaks in pipeline transportation systems is a matter of\nserious concern for operators, who pursue the integrity of their assets, the\nreduction of losses and the prevention of environmental hazards. Whenever a\nhole occurs in a pressurized pipeline, the corresponding fluid leakage is\ncharacterized by a turbulent flow and a peculiar acoustic noise, whose\ncharacteristics depend also on the size of the hole itself. This study shows\nthat both the presence and the size of such a leaking hole can be successfully\ndetected, by exploiting the acoustic noise (pressure transients) generated by\nthe fluid exiting the pipe and recorded internally by hydrophones, or by\nconsidering the corresponding vibrations (e.g., acceleration signals)\npropagating along the external shell of the conduit. To this purpose, several\nexperimental campaigns of acoustic noise generation have been performed using\nmultiple calibrated nozzles on a 16 ID connection pipeline in a fuel tanks\narea. Detection and classification procedures are proposed to control the\npresence of leakages and to estimate the size of the hole, using pressure and\nvibration signals.", "published": "2022-01-31 09:35:33", "link": "http://arxiv.org/abs/2201.13079v1", "categories": ["cs.LG", "cs.SD", "eess.AS"], "primary_category": "cs.LG"}
{"title": "Beyond synchronization: Body gestures and gaze direction in duo\n  performance", "abstract": "In this chapter, we focus on two main categories of visual interaction: body\ngestures and gaze direction. Our focus on body gestures is motivated by\nresearch showing that gesture patterns often change during joint action tasks\nto become more predictable (van der Wel et al., 2016). Moreover, coordination\nsometimes emerges between musicians at the level of body sway (Chang et al.,\n2017). Our focus on gaze direction was motivated by the fact that gaze can\nserve simultaneously as a means of obtaining information about the world and as\na means of communicating one's own attention and intent.", "published": "2022-01-31 15:10:23", "link": "http://arxiv.org/abs/2201.13297v1", "categories": ["cs.HC", "cs.SD", "eess.AS"], "primary_category": "cs.HC"}
