{"title": "Risk measures under model uncertainty: a Bayesian viewpoint", "abstract": "We introduce two kinds of risk measures with respect to some reference probability measure, which both allow for a certain order structure and domination property. Analyzing their relation to each other leads to the question when a certain minimax inequality is actually an equality. We then provide conditions under which the corresponding robust risk measures, being defined as the supremum over all risk measures induced by a set of probability measures, can be represented classically in terms of one single probability measure. We focus in particular on the mixture probability measure obtained via mixing over a set of probability measures using some prior, which represents for instance the regulator's beliefs. The classical representation in terms of the mixture probability measure can then be interpreted as a Bayesian approach to robust risk measures.", "published": "2022-04-14 17:11:23", "link": "http://arxiv.org/abs/2204.07115v1", "categories": ["q-fin.RM", "q-fin.MF"], "primary_category": "q-fin.RM"}
{"title": "High-Frequency-Based Volatility Model with Network Structure", "abstract": "This paper introduces one new multivariate volatility model that can accommodate an appropriately defined network structure based on low-frequency and high-frequency data. The model reduces the number of unknown parameters and the computational complexity substantially. The model parameterization and iterative multistep-ahead forecasts are discussed and the targeting reparameterization is also presented. Quasi-likelihood functions for parameter estimation are proposed and their asymptotic properties are established. A series of simulation experiments are carried out to assess the performance of the estimation in finite samples. An empirical example is demonstrated that the proposed model outperforms the network GARCH model, with the gains being particularly significant at short forecast horizons.", "published": "2022-04-14 06:56:32", "link": "http://arxiv.org/abs/2204.12933v1", "categories": ["q-fin.ST", "stat.OT"], "primary_category": "q-fin.ST"}
