{"title": "DeepGen: Diverse Search Ad Generation and Real-Time Customization", "abstract": "We present DeepGen, a system deployed at web scale for automatically creating\nsponsored search advertisements (ads) for BingAds customers. We leverage\nstate-of-the-art natural language generation (NLG) models to generate fluent\nads from advertiser's web pages in an abstractive fashion and solve practical\nissues such as factuality and inference speed. In addition, our system creates\na customized ad in real-time in response to the user's search query, therefore\nhighlighting different aspects of the same product based on what the user is\nlooking for. To achieve this, our system generates a diverse choice of smaller\npieces of the ad ahead of time and, at query time, selects the most relevant\nones to be stitched into a complete ad. We improve generation diversity by\ntraining a controllable NLG model to generate multiple ads for the same web\npage highlighting different selling points. Our system design further improves\ndiversity horizontally by first running an ensemble of generation models\ntrained with different objectives and then using a diversity sampling algorithm\nto pick a diverse subset of generation results for online selection.\nExperimental results show the effectiveness of our proposed system design. Our\nsystem is currently deployed in production, serving ${\\sim}4\\%$ of global ads\nserved in Bing.", "published": "2022-08-06 03:48:09", "link": "http://arxiv.org/abs/2208.03438v2", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Follow Me: Conversation Planning for Target-driven Recommendation\n  Dialogue Systems", "abstract": "Recommendation dialogue systems aim to build social bonds with users and\nprovide high-quality recommendations. This paper pushes forward towards a\npromising paradigm called target-driven recommendation dialogue systems, which\nis highly desired yet under-explored. We focus on how to naturally lead users\nto accept the designated targets gradually through conversations. To this end,\nwe propose a Target-driven Conversation Planning (TCP) framework to plan a\nsequence of dialogue actions and topics, driving the system to transit between\ndifferent conversation stages proactively. We then apply our TCP with planned\ncontent to guide dialogue generation. Experimental results show that our\nconversation planning significantly improves the performance of target-driven\nrecommendation dialogue systems.", "published": "2022-08-06 13:23:42", "link": "http://arxiv.org/abs/2208.03516v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "SSDPT: Self-Supervised Dual-Path Transformer for Anomalous Sound\n  Detection in Machine Condition Monitoring", "abstract": "Anomalous sound detection for machine condition monitoring has great\npotential in the development of Industry 4.0. However, these anomalous sounds\nof machines are usually unavailable in normal conditions. Therefore, the models\nemployed have to learn acoustic representations with normal sounds for\ntraining, and detect anomalous sounds while testing. In this article, we\npropose a self-supervised dual-path Transformer (SSDPT) network to detect\nanomalous sounds in machine monitoring. The SSDPT network splits the acoustic\nfeatures into segments and employs several DPT blocks for time and frequency\nmodeling. DPT blocks use attention modules to alternately model the interactive\ninformation about the frequency and temporal components of the segmented\nacoustic features. To address the problem of lack of anomalous sound, we adopt\na self-supervised learning approach to train the network with normal sound.\nSpecifically, this approach randomly masks and reconstructs the acoustic\nfeatures, and jointly classifies machine identity information to improve the\nperformance of anomalous sound detection. We evaluated our method on the\nDCASE2021 task2 dataset. The experimental results show that the SSDPT network\nachieves a significant increase in the harmonic mean AUC score, in comparison\nto present state-of-the-art methods of anomalous sound detection.", "published": "2022-08-06 02:17:16", "link": "http://arxiv.org/abs/2208.03421v1", "categories": ["eess.AS", "cs.SD"], "primary_category": "eess.AS"}
