{"title": "Biology-inspired geometric representation of probability and applications to completion and options' pricing", "abstract": "Geometry constitutes a core set of intuitions present in all humans, regardless of their language or schooling [1]. Could brain's built in machinery for processing geometric information take part in uncertainty representation? For decades already traders have been citing the price of uncertainty based FX optional contracts in terms of implied volatility, a dummy variable related to the standard deviation, instead of pricing with units of money. This work introduces a methodology for geometric representation of probability in terms of implied volatility and attempts to find ways to approximate certain probability distributions using intuitive geometric symmetry. In particular, it is shown how any probability distribution supported on $\\mathbb{R}_{+}$ and having finite expectation may be represented with a planar curve whose geometric characteristics can be further analyzed. Log-normal distributions are represented with circles centered at the origin. Certain non-log-normal distributions with bell-shaped density profiles are represented by curves that can be closely approximated with circles whose centers are translated away from the origin. Only three points are needed to define a circle while it represents the candidate probability density approximating the distribution along the entire $\\mathbb{R}_{+}$. Just three numbers: scaling and translations along the $x$ and $y$ axes map one circle to another. It is possible to introduce equivalence classes whose member distributions can be obtained by transitive actions of geometric transformations on any of corresponding representations. Approximate completion of probability with non-circular shapes and cases when probability is supported outside of $\\mathbb{R}_{+}$ are considered too. Proposed completion of implied volatility is compared to the vanna-volga method.", "published": "2022-09-09 11:57:17", "link": "http://arxiv.org/abs/2209.04264v1", "categories": ["q-fin.PR", "math.PR", "q-fin.MF"], "primary_category": "q-fin.PR"}
