{"title": "Cryptocurrencies Are Becoming Part of the World Global Financial Market", "abstract": "In this study the cross-correlations between the cryptocurrency market represented by the two most liquid and highest-capitalized cryptocurrencies: bitcoin and ethereum, on the one side, and the instruments representing the traditional financial markets: stock indices, Forex, commodities, on the other side, are measured in the period: January 2020--October 2022. Our purpose is to address the question whether the cryptocurrency market still preserves its autonomy with respect to the traditional financial markets or it has already aligned with them in expense of its independence. We are motivated by the fact that some previous related studies gave mixed results. By calculating the $q$-dependent detrended cross-correlation coefficient based on the high frequency 10 s data in the rolling window, the dependence on various time scales, different fluctuation magnitudes, and different market periods are examined. There is a strong indication that the dynamics of the bitcoin and ethereum price changes since the March 2020 Covid-19 panic is no longer independent. Instead, it is related to the dynamics of the traditional financial markets, which is especially evident now in 2022, when the bitcoin and ethereum coupling to the US tech stocks is observed during the market bear phase. It is also worth emphasizing that the cryptocurrencies have begun to react to the economic data such as the Consumer Price Index readings in a similar way as traditional instruments. Such a spontaneous coupling of the so far independent degrees of freedom can be interpreted as a kind of phase transition that resembles the collective phenomena typical for the complex systems. Our results indicate that the cryptocurrencies cannot be considered as a safe haven for the financial investments.", "published": "2023-02-18 15:41:22", "link": "http://arxiv.org/abs/2303.00495v1", "categories": ["q-fin.ST", "stat.AP"], "primary_category": "q-fin.ST"}
