{"title": "Heterogeneous Beliefs Model of Stock Market Predictability", "abstract": "This paper proposes a theory of stock market predictability patterns based on\na model of heterogeneous beliefs. In a discrete finite time framework, some\nagents receive news about an asset's fundamental value through a noisy signal.\nThe investors are heterogeneous in that they have different beliefs about the\nstochastic supply. A momentum in the stock price arises from those agents who\nincorrectly underestimate the signal accuracy, dampening the initial price\nimpact of the signal. A reversal in price occurs because the price reverts to\nthe fundamental value in the long run. An extension of the model to multiple\nassets case predicts co-movement and lead-lag effect, in addition to\ncross-sectional momentum and reversal. The heterogeneous beliefs of investors\nabout news demonstrate how the main predictability anomalies arise endogenously\nin a model of bounded rationality.", "published": "2024-06-12 17:39:36", "link": "http://arxiv.org/abs/2406.08448v1", "categories": ["q-fin.PR", "q-fin.GN", "q-fin.TR"], "primary_category": "q-fin.PR"}
{"title": "Deep learning for quadratic hedging in incomplete jump market", "abstract": "We propose a deep learning approach to study the minimal variance pricing and\nhedging problem in an incomplete jump diffusion market. It is based upon a\nrigorous stochastic calculus derivation of the optimal hedging portfolio,\noptimal option price, and the corresponding equivalent martingale measure\nthrough the means of the Stackelberg game approach. A deep learning algorithm\nbased on the combination of the feedforward and LSTM neural networks is tested\non three different market models, two of which are incomplete. In contrast, the\ncomplete market Black-Scholes model serves as a benchmark for the algorithm's\nperformance. The results that indicate the algorithm's good performance are\npresented and discussed.\n  In particular, we apply our results to the special incomplete market model\nstudied by Merton and give a detailed comparison between our results based on\nthe minimal variance principle and the results obtained by Merton based on a\ndifferent pricing principle. Using deep learning, we find that the minimal\nvariance principle leads to typically higher option prices than those deduced\nfrom the Merton principle. On the other hand, the minimal variance principle\nleads to lower losses than the Merton principle.", "published": "2024-06-12 09:45:35", "link": "http://arxiv.org/abs/2407.13688v1", "categories": ["q-fin.TR", "math.PR"], "primary_category": "q-fin.TR"}
{"title": "Deep reinforcement learning with positional context for intraday trading", "abstract": "Deep reinforcement learning (DRL) is a well-suited approach to financial\ndecision-making, where an agent makes decisions based on its trading strategy\ndeveloped from market observations. Existing DRL intraday trading strategies\nmainly use price-based features to construct the state space. They neglect the\ncontextual information related to the position of the strategy, which is an\nimportant aspect given the sequential nature of intraday trading. In this\nstudy, we propose a novel DRL model for intraday trading that introduces\npositional features encapsulating the contextual information into its sparse\nstate space. The model is evaluated over an extended period of almost a decade\nand across various assets including commodities and foreign exchange\nsecurities, taking transaction costs into account. The results show a notable\nperformance in terms of profitability and risk-adjusted metrics. The feature\nimportance results show that each feature incorporating contextual information\ncontributes to the overall performance of the model. Additionally, through an\nexploration of the agent's intraday trading activity, we unveil patterns that\nsubstantiate the effectiveness of our proposed model.", "published": "2024-06-12 09:04:45", "link": "http://arxiv.org/abs/2406.08013v1", "categories": ["q-fin.TR"], "primary_category": "q-fin.TR"}
