{"title": "Asset pricing under model uncertainty with finite time and states", "abstract": "In this study, we consider the asset pricing under model uncertainty with\nfinite time and under a family of probability, and explore its relationship\nwith risk neutral probability meastates structure. For the single-period\nsecurities model, we give a novel definition of arbitrage sure. Focusing on the\nfinancial market with short sales prohibitions, we separately investigate the\nnecessary and sufficient conditions for no-arbitrage asset pricing based on\nnonlinear expectation which composed with a family of probability. When each\nlinear expectation driven by the probability in the family of probability\nbecomes martingale measure, the necessary and sufficient conditions are same,\nand coincide with the existing results. Furthermore, we expand the main results\nof single-period securities model to the case of multi-period securities model.\nBy-product, we obtain the superhedging prices of contingent claim under model\nuncertainty.", "published": "2024-08-23 13:12:02", "link": "http://arxiv.org/abs/2408.13048v1", "categories": ["q-fin.MF"], "primary_category": "q-fin.MF"}
{"title": "Causal Hierarchy in the Financial Market Network -- Uncovered by the Helmholtz-Hodge-Kodaira Decomposition", "abstract": "Granger causality can uncover the cause and effect relationships in financial\nnetworks. However, such networks can be convoluted and difficult to interpret,\nbut the Helmholtz-Hodge-Kodaira decomposition can split them into a rotational\nand gradient component which reveals the hierarchy of Granger causality flow.\nUsing Kenneth French's business sector return time series, it is revealed that\nduring the Covid crisis, precious metals and pharmaceutical products are causal\ndrivers of the financial network. Moreover, the estimated Granger causality\nnetwork shows a high connectivity during crisis which means that the research\npresented here can be especially useful to better understand crises in the\nmarket by revealing the dominant drivers of the crisis dynamics.", "published": "2024-08-23 05:09:10", "link": "http://arxiv.org/abs/2408.12839v1", "categories": ["q-fin.ST", "physics.data-an", "stat.AP"], "primary_category": "q-fin.ST"}
{"title": "Controllable Financial Market Generation with Diffusion Guided Meta Agent", "abstract": "Order flow modeling stands as the most fundamental and essential financial\ntask, as orders embody the minimal unit within a financial market. However,\ncurrent approaches often result in unsatisfactory fidelity in generating order\nflow, and their generation lacks controllability, thereby limiting their\napplication scenario. In this paper, we advocate incorporating controllability\ninto the market generation process, and propose a Diffusion Guided meta\nAgent(DiGA) model to address the problem. Specifically, we utilize a diffusion\nmodel to capture dynamics of market state represented by time-evolving\ndistribution parameters about mid-price return rate and order arrival rate, and\ndefine a meta agent with financial economic priors to generate orders from the\ncorresponding distributions. Extensive experimental results demonstrate that\nour method exhibits outstanding controllability and fidelity in generation.\nFurthermore, we validate DiGA's effectiveness as generative environment for\ndownstream financial applications.", "published": "2024-08-23 11:15:36", "link": "http://arxiv.org/abs/2408.12991v2", "categories": ["cs.CE", "q-fin.TR"], "primary_category": "cs.CE"}
