{"title": "Whack-a-mole Online Learning: Physics-Informed Neural Network for Intraday Implied Volatility Surface", "abstract": "Calibrating the time-dependent Implied Volatility Surface (IVS) using sparse\nmarket data is an essential challenge in computational finance, particularly\nfor real-time applications. This task requires not only fitting market data but\nalso satisfying a specified partial differential equation (PDE) and\nno-arbitrage conditions modelled by differential inequalities. This paper\nproposes a novel Physics-Informed Neural Networks (PINNs) approach called\nWhack-a-mole Online Learning (WamOL) to address this multi-objective\noptimisation problem. WamOL integrates self-adaptive and auto-balancing\nprocesses for each loss term, efficiently reweighting objective functions to\nensure smooth surface fitting while adhering to PDE and no-arbitrage\nconstraints and updating for intraday predictions. In our experiments, WamOL\ndemonstrates superior performance in calibrating intraday IVS from uneven and\nsparse market data, effectively capturing the dynamic evolution of option\nprices and associated risk profiles. This approach offers an efficient solution\nfor intraday IVS calibration, extending PINNs applications and providing a\nmethod for real-time financial modelling.", "published": "2024-11-04 18:44:31", "link": "http://arxiv.org/abs/2411.02375v1", "categories": ["q-fin.CP"], "primary_category": "q-fin.CP"}
{"title": "Stochastic Optimal Control of an Industrial Power-to-Heat System with High-Temperature Heat Pump and Thermal Energy Storage", "abstract": "The optimal control of sustainable energy supply systems, including renewable\nenergies and energy storage, takes a central role in the decarbonization of\nindustrial systems. However, the use of fluctuating renewable energies leads to\nfluctuations in energy generation and requires a suitable control strategy for\nthe complex systems in order to ensure energy supply. In this paper, we\nconsider an electrified power-to-heat system which is designed to supply heat\nin form of superheated steam for industrial processes. The system consists of a\nhigh-temperature heat pump for heat supply, a wind turbine for power\ngeneration, a sensible thermal energy storage for storing excess heat and a\nsteam generator for providing steam. If the system's energy demand cannot be\ncovered by electricity from the wind turbine, additional electricity must be\npurchased from the power grid. For this system, we investigate the cost-optimal\noperation aiming to minimize the electricity cost from the grid by a suitable\nsystem control depending on the available wind power and the amount of stored\nthermal energy. This is a decision making problem under uncertainties about the\nfuture prices for electricity from the grid and the future generation of wind\npower. The resulting stochastic optimal control problem is treated as\nfinite-horizon Markov decision process for a multi-dimensional controlled state\nprocess. We first consider the classical backward recursion techniques for\nsolving the associated dynamic programming equation for the value function and\ncompute the optimal decision rule. Since that approach suffers from the curse\nof dimensionality we also apply Q-learning techniques that are able to provide\na good approximate solution to the optimization problem within reasonable time.", "published": "2024-11-04 16:06:30", "link": "http://arxiv.org/abs/2411.02211v2", "categories": ["math.OC", "q-fin.CP", "93E20, 90-08, 90C40, 68T05, 91G60"], "primary_category": "math.OC"}
{"title": "Real-world models for multiple term structures: a unifying HJM semimartingale framework", "abstract": "We develop a unified framework for modeling multiple term structures arising\nin financial, insurance, and energy markets, adopting an extended\nHeath-Jarrow-Morton (HJM) approach under the real-world probability. We study\nmarket viability and characterize the set of local martingale deflators. We\nconduct an analysis of the associated stochastic partial differential equation\n(SPDE), addressing existence and uniqueness of solutions, invariance properties\nand existence of affine realizations.", "published": "2024-11-04 11:10:20", "link": "http://arxiv.org/abs/2411.01983v2", "categories": ["q-fin.MF", "math.PR"], "primary_category": "q-fin.MF"}
{"title": "Enhancing Risk Assessment in Transformers with Loss-at-Risk Functions", "abstract": "In the financial field, precise risk assessment tools are essential for\ndecision-making. Recent studies have challenged the notion that traditional\nnetwork loss functions like Mean Square Error (MSE) are adequate, especially\nunder extreme risk conditions that can lead to significant losses during market\nupheavals. Transformers and Transformer-based models are now widely used in\nfinancial forecasting according to their outstanding performance in\ntime-series-related predictions. However, these models typically lack\nsensitivity to extreme risks and often underestimate great financial losses. To\naddress this problem, we introduce a novel loss function, the Loss-at-Risk,\nwhich incorporates Value at Risk (VaR) and Conditional Value at Risk (CVaR)\ninto Transformer models. This integration allows Transformer models to\nrecognize potential extreme losses and further improves their capability to\nhandle high-stakes financial decisions. Moreover, we conduct a series of\nexperiments with highly volatile financial datasets to demonstrate that our\nLoss-at-Risk function improves the Transformers' risk prediction and management\ncapabilities without compromising their decision-making accuracy or efficiency.\nThe results demonstrate that integrating risk-aware metrics during training\nenhances the Transformers' risk assessment capabilities while preserving their\ncore strengths in decision-making and reasoning across diverse scenarios.", "published": "2024-11-04 19:44:43", "link": "http://arxiv.org/abs/2411.02558v1", "categories": ["cs.LG", "cs.CL", "q-fin.RM", "q-fin.ST"], "primary_category": "cs.LG"}
{"title": "Advancing DeFi Analytics: Efficiency Analysis with Decentralized Exchanges Comparison Service", "abstract": "This empirical study presents the Decentralized Exchanges Comparison Service\n(DECS), a novel tool developed by 1inch Analytics to assess exchange efficiency\nin decentralized finance. The DECS utilizes swap transaction monitoring and\nsimulation techniques to provide unbiased comparisons of swap rates across\nvarious DEXes and aggregators. Analysis of almost 1.2 million transactions\nacross multiple blockchain networks demonstrates that both 1inch Classic and\n1inch Fusion consistently outperform competitors. These findings not only\nvalidate 1inch's superior rates but also provide valuable insights for\ncontinuous protocol optimization and underscore the critical role of\ndata-driven decision-making in advancing DeFi infrastructure.", "published": "2024-11-04 10:21:46", "link": "http://arxiv.org/abs/2411.01950v1", "categories": ["q-fin.TR"], "primary_category": "q-fin.TR"}
