{"title": "Periodic portfolio selection with quasi-hyperbolic discounting", "abstract": "We introduce an infinite-horizon, continuous-time portfolio selection problem\nfaced by an agent with periodic S-shaped preference and present bias. The\ninclusion of a quasi-hyperbolic discount function leads to time-inconsistency\nand we characterize the optimal portfolio for a pre-committing, naive and\nsophisticated agent respectively. In the more theoretically challenging problem\nwith a sophisticated agent, the time-consistent planning strategy can be\nformulated as an equilibrium to a static mean field game. Interestingly,\npresent bias and naivety do not necessarily result in less desirable risk\ntaking behaviors, while agent's sophistication may lead to excessive leverage\n(underinvestement) in the bad (good) states of the world.", "published": "2024-10-23 19:34:45", "link": "http://arxiv.org/abs/2410.18240v1", "categories": ["q-fin.PM", "econ.GN", "q-fin.EC", "q-fin.GN", "q-fin.MF", "49L99, 49N90, 91A10, 91E99, 91G10, 93E20"], "primary_category": "q-fin.PM"}
{"title": "Enhancing literature review with LLM and NLP methods. Algorithmic trading case", "abstract": "This study utilizes machine learning algorithms to analyze and organize\nknowledge in the field of algorithmic trading. By filtering a dataset of 136\nmillion research papers, we identified 14,342 relevant articles published\nbetween 1956 and Q1 2020. We compare traditional practices-such as\nkeyword-based algorithms and embedding techniques-with state-of-the-art topic\nmodeling methods that employ dimensionality reduction and clustering. This\ncomparison allows us to assess the popularity and evolution of different\napproaches and themes within algorithmic trading. We demonstrate the usefulness\nof Natural Language Processing (NLP) in the automatic extraction of knowledge,\nhighlighting the new possibilities created by the latest iterations of Large\nLanguage Models (LLMs) like ChatGPT. The rationale for focusing on this topic\nstems from our analysis, which reveals that research articles on algorithmic\ntrading are increasing at a faster rate than the overall number of\npublications. While stocks and main indices comprise more than half of all\nassets considered, certain asset classes, such as cryptocurrencies, exhibit a\nmuch stronger growth trend. Machine learning models have become the most\npopular methods in recent years. The study demonstrates the efficacy of LLMs in\nrefining datasets and addressing intricate questions about the analyzed\narticles, such as comparing the efficiency of different models. Our research\nshows that by decomposing tasks into smaller components and incorporating\nreasoning steps, we can effectively tackle complex questions supported by case\nanalyses. This approach contributes to a deeper understanding of algorithmic\ntrading methodologies and underscores the potential of advanced NLP techniques\nin literature reviews.", "published": "2024-10-23 13:37:27", "link": "http://arxiv.org/abs/2411.05013v1", "categories": ["q-fin.ST", "cs.AI", "cs.LG", "q-fin.TR"], "primary_category": "q-fin.ST"}
