{"title": "No Tick-Size Too Small: A General Method for Modelling Small Tick Limit Order Books", "abstract": "Tick sizes not only influence the granularity of the price formation process\nbut also affect market agents' behavior. We investigate the disparity in the\nmicrostructural properties of the Limit Order Book (LOB) across different\nrelative tick sizes. A key contribution of this study is the identification of\nseveral stylized facts, which are used to differentiate between large, medium,\nand small tick stocks, along with clear metrics for their measurement. We\nprovide cross-asset visualizations to illustrate how these attributes vary with\nrelative tick size. Further, we propose a Hawkes Process model that accounts\nfor sparsity, multi-tick level price moves, and the shape of the book in\nsmall-tick stocks. Through simulation studies, we demonstrate the universality\nof the model and identify key variables that determine whether a simulated LOB\nresembles a large-tick or small-tick stock. Our tests show that stylized facts\nlike sparsity, shape, and relative returns distribution can be smoothly\ntransitioned from a large-tick to a small-tick asset using our model. We test\nthis model's assumptions, showcase its challenges and propose questions for\nfurther directions in this area of research.", "published": "2024-10-11 12:02:21", "link": "http://arxiv.org/abs/2410.08744v2", "categories": ["q-fin.TR", "cs.CE", "q-fin.CP"], "primary_category": "q-fin.TR"}
{"title": "Scalable Signature-Based Distribution Regression via Reference Sets", "abstract": "Distribution Regression (DR) on stochastic processes describes the learning\ntask of regression on collections of time series. Path signatures, a technique\nprevalent in stochastic analysis, have been used to solve the DR problem.\nRecent works have demonstrated the ability of such solutions to leverage the\ninformation encoded in paths via signature-based features. However, current\nstate of the art DR solutions are memory intensive and incur a high computation\ncost. This leads to a trade-off between path length and the number of paths\nconsidered. This computational bottleneck limits the application to small\nsample sizes which consequently introduces estimation uncertainty. In this\npaper, we present a methodology for addressing the above issues; resolving\nestimation uncertainties whilst also proposing a pipeline that enables us to\nuse DR for a wide variety of learning tasks. Integral to our approach is our\nnovel distance approximator. This allows us to seamlessly apply our methodology\nacross different application domains, sampling rates, and stochastic process\ndimensions. We show that our model performs well in applications related to\nestimation theory, quantitative finance, and physical sciences. We demonstrate\nthat our model generalises well, not only to unseen data within a given\ndistribution, but also under unseen regimes (unseen classes of stochastic\nmodels).", "published": "2024-10-11 18:58:28", "link": "http://arxiv.org/abs/2410.09196v1", "categories": ["cs.LG", "q-fin.MF", "stat.ML"], "primary_category": "cs.LG"}
{"title": "Term structure shapes and their consistent dynamics in the Svensson family", "abstract": "We examine the shapes attainable by the forward- and yield-curve in the\nwidely-used Svensson family, including the Nelson-Siegel and Bliss subfamilies.\nWe provide a complete classification of all attainable shapes and partition the\nparameter space of each family according to these shapes. Building upon these\nresults, we then examine the consistent dynamic evolution of the Svensson\nfamily under absence of arbitrage. Our analysis shows that consistent dynamics\nfurther restrict the set of attainable shapes, and we demonstrate that certain\ncomplex shapes can no longer appear after a deterministic time horizon.\nMoreover a single shape (either inverse of normal curves) must dominate in the\nlong-run.", "published": "2024-10-11 13:46:52", "link": "http://arxiv.org/abs/2410.08808v1", "categories": ["q-fin.MF", "econ.TH", "math.DS", "91G30"], "primary_category": "q-fin.MF"}
{"title": "Cross-Currency Basis Swaps Referencing Backward-Looking Rates", "abstract": "The financial industry has undergone a significant transition from the London\nInterbank Offered Rate (LIBOR) to Risk Free Rates (RFR) such as, e.g., the\nSecured Overnight Financing Rate (SOFR) in the U.S. and the AUD Overnight Index\nAverage (AONIA) in Australia, as the primary benchmark rate for borrowing\ncosts. The paper examines the pricing and hedging method for SOFR-related\nfinancial products in a cross-currency context with the special emphasis on the\nCompound SOFR vs Average AONIA cross-currency basis swaps. While the SOFR and\nAONIA serve as a particular case of a cross-currency basis swap (CCBS), the\napproach developed is able to handle backward-looking term rates for any two\ncurrencies. We give explicit pricing and hedging results for collateralized\ncross-currency basis swaps using interest rate and currency futures contracts\nas hedging tools within an arbitrage-free multi-curve setting.", "published": "2024-10-11 03:09:39", "link": "http://arxiv.org/abs/2410.08477v1", "categories": ["q-fin.MF", "0H10, 60H30, 91G30, 91G40"], "primary_category": "q-fin.MF"}
