{"title": "A Random Forest approach to detect and identify Unlawful Insider Trading", "abstract": "According to The Exchange Act, 1934 unlawful insider trading is the abuse of\naccess to privileged corporate information. While a blurred line between\n\"routine\" the \"opportunistic\" insider trading exists, detection of strategies\nthat insiders mold to maneuver fair market prices to their advantage is an\nuphill battle for hand-engineered approaches. In the context of detailed\nhigh-dimensional financial and trade data that are structurally built by\nmultiple covariates, in this study, we explore, implement and provide detailed\ncomparison to the existing study (Deng et al. (2019)) and independently\nimplement automated end-to-end state-of-art methods by integrating principal\ncomponent analysis to the random forest (PCA-RF) followed by a standalone\nrandom forest (RF) with 320 and 3984 randomly selected, semi-manually labeled\nand normalized transactions from multiple industry. The settings successfully\nuncover latent structures and detect unlawful insider trading. Among the\nmultiple scenarios, our best-performing model accurately classified 96.43\npercent of transactions. Among all transactions the models find 95.47 lawful as\nlawful and $98.00$ unlawful as unlawful percent. Besides, the model makes very\nfew mistakes in classifying lawful as unlawful by missing only 2.00 percent. In\naddition to the classification task, model generated Gini Impurity based\nfeatures ranking, our analysis show ownership and governance related features\nbased on permutation values play important roles. In summary, a simple yet\npowerful automated end-to-end method relieves labor-intensive activities to\nredirect resources to enhance rule-making and tracking the uncaptured unlawful\ninsider trading transactions. We emphasize that developed financial and trading\nfeatures are capable of uncovering fraudulent behaviors.", "published": "2024-11-09 18:01:19", "link": "http://arxiv.org/abs/2411.13564v1", "categories": ["q-fin.ST", "cs.LG", "q-fin.RM", "q-fin.TR"], "primary_category": "q-fin.ST"}
{"title": "The lexical ratio: A new perspective on portfolio diversification", "abstract": "Portfolio diversification, traditionally measured through asset correlations\nand volatilitybased metrics, is fundamental to managing financial risk.\nHowever, existing diversification metrics often overlook non-numerical\nrelationships between assets that can impact portfolio stability, particularly\nduring market stresses. This paper introduces the lexical ratio (LR), a novel\nmetric that leverages textual data to capture diversification dimensions absent\nin standard approaches. By treating each asset as a unique document composed of\nsectorspecific and financial keywords, the LR evaluates portfolio\ndiversification by distributing these terms across assets, incorporating\nentropy-based insights from information theory. We thoroughly analyze LR's\nproperties, including scale invariance, concavity, and maximality,\ndemonstrating its theoretical robustness and ability to enhance risk-adjusted\nportfolio returns. Using empirical tests on S&P 500 portfolios, we compare LR's\nperformance to established metrics such as Markowitz's volatility-based\nmeasures and diversification ratios. Our tests reveal LR's superiority in\noptimizing portfolio returns, especially under varied market conditions. Our\nfindings show that LR aligns with conventional metrics and captures unique\ndiversification aspects, suggesting it is a viable tool for portfolio managers.", "published": "2024-11-09 06:26:11", "link": "http://arxiv.org/abs/2411.06080v1", "categories": ["q-fin.PM", "q-fin.RM", "q-fin.ST", "91G10, 62H20, 94A17, 91G70", "I.2.7; G.3"], "primary_category": "q-fin.PM"}
{"title": "BreakGPT: Leveraging Large Language Models for Predicting Asset Price Surges", "abstract": "This paper introduces BreakGPT, a novel large language model (LLM)\narchitecture adapted specifically for time series forecasting and the\nprediction of sharp upward movements in asset prices. By leveraging both the\ncapabilities of LLMs and Transformer-based models, this study evaluates\nBreakGPT and other Transformer-based models for their ability to address the\nunique challenges posed by highly volatile financial markets. The primary\ncontribution of this work lies in demonstrating the effectiveness of combining\ntime series representation learning with LLM prediction frameworks. We showcase\nBreakGPT as a promising solution for financial forecasting with minimal\ntraining and as a strong competitor for capturing both local and global\ntemporal dependencies.", "published": "2024-11-09 05:40:32", "link": "http://arxiv.org/abs/2411.06076v1", "categories": ["q-fin.ST", "cs.LG"], "primary_category": "q-fin.ST"}
