{"title": "Systematic comparison of deep generative models applied to multivariate financial time series", "abstract": "Financial time series (FTS) generation models are a core pillar to\napplications in finance. Risk management and portfolio optimization rely on\nrealistic multivariate price generation models. Accordingly, there is a strong\nmodelling literature dating back to Bachelier's Theory of Speculation in 1901.\nGenerating FTS using deep generative models (DGMs) is still in its infancy. In\nthis work, we systematically compare DGMs against state-of-the-art parametric\nalternatives for multivariate FTS generation. We initially compare both DGMs\nand parametric models over increasingly complex synthetic datasets. The models\nare evaluated through distance measures for varying distribution moments of\nboth the full and rolling FTS. We then apply the best performing DGM models to\nempirical data, demonstrating the benefit of DGMs through a implied volatility\ntrading task.", "published": "2024-12-09 11:48:07", "link": "http://arxiv.org/abs/2412.06417v1", "categories": ["q-fin.ST", "q-fin.CP"], "primary_category": "q-fin.ST"}
{"title": "Stock Type Prediction Model Based on Hierarchical Graph Neural Network", "abstract": "This paper introduces a novel approach to stock data analysis by employing a\nHierarchical Graph Neural Network (HGNN) model that captures multi-level\ninformation and relational structures in the stock market. The HGNN model\nintegrates stock relationship data and hierarchical attributes to predict stock\ntypes effectively. The paper discusses the construction of a stock industry\nrelationship graph and the extraction of temporal information from historical\nprice sequences. It also highlights the design of a graph convolution operation\nand a temporal attention aggregator to model the macro market state. The\nintegration of these features results in a comprehensive stock prediction model\nthat addresses the challenges of utilizing stock relationship data and modeling\nhierarchical attributes in the stock market.", "published": "2024-12-09 08:08:03", "link": "http://arxiv.org/abs/2412.06862v1", "categories": ["cs.LG", "q-fin.CP"], "primary_category": "cs.LG"}
{"title": "Diffusion on the circle and a stochastic correlation model", "abstract": "We propose analytically tractable SDE models for correlation in financial\nmarkets. We study diffusions on the circle, namely the Brownian motion on the\ncircle and the von Mises process, and consider these as models for correlation.\nThe von Mises process was proposed in Kent (1975) as a probabilistic\njustification for the von Mises distribution which is widely used in Circular\nstatistics. The transition density of the von Mises process has been unknown,\nwe identify an approximate analytic transition density for the von Mises\nprocess. We discuss the estimation of these diffusion models and a stochastic\ncorrelation model in finance. We illustrate the application of the proposed\nmodel on real-data of equity-currency pairs.", "published": "2024-12-09 09:51:38", "link": "http://arxiv.org/abs/2412.06343v3", "categories": ["math.ST", "q-fin.MF", "stat.TH"], "primary_category": "math.ST"}
