{"title": "Dynamic Graph Representation with Contrastive Learning for Financial Market Prediction: Integrating Temporal Evolution and Static Relations", "abstract": "Temporal Graph Learning (TGL) is crucial for capturing the evolving nature of\nstock markets. Traditional methods often ignore the interplay between dynamic\ntemporal changes and static relational structures between stocks. To address\nthis issue, we propose the Dynamic Graph Representation with Contrastive\nLearning (DGRCL) framework, which integrates dynamic and static graph relations\nto improve the accuracy of stock trend prediction. Our framework introduces two\nkey components: the Embedding Enhancement (EE) module and the Contrastive\nConstrained Training (CCT) module. The EE module focuses on dynamically\ncapturing the temporal evolution of stock data, while the CCT module enforces\nstatic constraints based on stock relations, refined within contrastive\nlearning. This dual-relation approach allows for a more comprehensive\nunderstanding of stock market dynamics. Our experiments on two major U.S. stock\nmarket datasets, NASDAQ and NYSE, demonstrate that DGRCL significantly\noutperforms state-of-the-art TGL baselines. Ablation studies indicate the\nimportance of both modules. Overall, DGRCL not only enhances prediction ability\nbut also provides a robust framework for integrating temporal and relational\ndata in dynamic graphs. Code and data are available for public access.", "published": "2024-12-05 10:15:56", "link": "http://arxiv.org/abs/2412.04034v1", "categories": ["cs.LG", "cs.NE", "q-fin.CP"], "primary_category": "cs.LG"}
{"title": "Inverting the Markovian projection for pure jump processes", "abstract": "Markovian projections arise in problems where we aim to mimic the\none-dimensional marginal laws of an It\\^o semimartingale by using another It\\^o\nprocess with simpler dynamics. In applications, Markovian projections are\nuseful in calibrating jump-diffusion models with both local and stochastic\nfeatures, leading to the study of the inversion problems. In this paper, we\ninvert the Markovian projections for pure jump processes, which can be used to\nconstruct calibrated local stochastic intensity (LSI) models for credit risk\napplications. Such models are jump process analogues of the notoriously hard to\nconstruct local stochastic volatility (LSV) models used in equity modeling.", "published": "2024-12-05 20:10:17", "link": "http://arxiv.org/abs/2412.04589v1", "categories": ["math.PR", "q-fin.MF"], "primary_category": "math.PR"}
{"title": "Correlation without Factors in Retail Cryptocurrency Markets", "abstract": "A simple model-free and distribution-free statistic, the functional\nrelationship between the number of \"effective\" degrees of freedom and portfolio\nsize, or N*(N), is used to discriminate between two alternative models for the\ncorrelation of daily cryptocurrency returns within a retail universe of defined\nby the list of tradable assets available to account holders at the Robinhood\nbrokerage. The average pairwise correlation between daily cryptocurrency\nreturns is found to be high (of order 60%) and the data collected supports\ndescription of the cross-section of returns by a simple isotropic correlation\nmodel distinct from a decomposition into a linear factor model with additive\nnoise with high confidence. This description appears to be relatively stable\nthrough time.", "published": "2024-12-05 15:44:51", "link": "http://arxiv.org/abs/2412.04263v1", "categories": ["q-fin.PM", "q-fin.RM", "q-fin.ST", "62"], "primary_category": "q-fin.PM"}
