{"title": "Financial News-Driven LLM Reinforcement Learning for Portfolio Management", "abstract": "Reinforcement learning (RL) has emerged as a transformative approach for\nfinancial trading, enabling dynamic strategy optimization in complex markets.\nThis study explores the integration of sentiment analysis, derived from large\nlanguage models (LLMs), into RL frameworks to enhance trading performance.\nExperiments were conducted on single-stock trading with Apple Inc. (AAPL) and\nportfolio trading with the ING Corporate Leaders Trust Series B (LEXCX). The\nsentiment-enhanced RL models demonstrated superior net worth and cumulative\nprofit compared to RL models without sentiment and, in the portfolio\nexperiment, outperformed the actual LEXCX portfolio's buy-and-hold strategy.\nThese results highlight the potential of incorporating qualitative market\nsignals to improve decision-making, bridging the gap between quantitative and\nqualitative approaches in financial trading.", "published": "2024-11-17 12:46:01", "link": "http://arxiv.org/abs/2411.11059v1", "categories": ["q-fin.CP"], "primary_category": "q-fin.CP"}
{"title": "IVE: Enhanced Probabilistic Forecasting of Intraday Volume Ratio with Transformers", "abstract": "This paper presents a new approach to volume ratio prediction in financial\nmarkets, specifically targeting the execution of Volume-Weighted Average Price\n(VWAP) strategies. Recognizing the importance of accurate volume profile\nforecasting, our research leverages the Transformer architecture to predict\nintraday volume ratio at a one-minute scale. We diverge from prior models that\nuse log-transformed volume or turnover rates, instead opting for a prediction\nmodel that accounts for the intraday volume ratio's high variability,\nstabilized via log-normal transformation. Our input data incorporates not only\nthe statistical properties of volume but also external volume-related features,\nabsolute time information, and stock-specific characteristics to enhance\nprediction accuracy. The model structure includes an encoder-decoder\nTransformer architecture with a distribution head for greedy sampling,\noptimizing performance on high-liquidity stocks across both Korean and American\nmarkets. We extend the capabilities of our model beyond point prediction by\nintroducing probabilistic forecasting that captures the mean and standard\ndeviation of volume ratios, enabling the anticipation of significant intraday\nvolume spikes. Furthermore, an agent with a simple trading logic demonstrates\nthe practical application of our model through live trading tests in the Korean\nmarket, outperforming VWAP benchmarks over a period of two and a half months.\nOur findings underscore the potential of Transformer-based probabilistic models\nfor volume ratio prediction and pave the way for future research advancements\nin this domain.", "published": "2024-11-17 04:07:26", "link": "http://arxiv.org/abs/2411.10956v2", "categories": ["q-fin.CP", "cs.CE"], "primary_category": "q-fin.CP"}
