{"title": "ajdmom: A Python Package for Deriving Moment Formulas of Affine Jump Diffusion Processes", "abstract": "We introduce ajdmom, a Python package designed for automatically deriving\nmoment formulae for the well-established affine jump diffusion processes with\nstate-independent jump intensities. ajdmom can produce explicit closed-form\nexpressions for conditional and unconditional moments of any order,\nsignificantly enhancing the usability of these models. Additionally, ajdmom can\ncompute partial derivatives of these moments with respect to the model\nparameters, offering a valuable tool for sensitivity analysis. The package's\nmodular architecture makes it easy for adaptation and extension by researchers.\najdmom is open-source and readily available for installation from GitHub or the\nPython package index (PyPI).", "published": "2024-11-10 14:55:10", "link": "http://arxiv.org/abs/2411.06484v2", "categories": ["q-fin.MF"], "primary_category": "q-fin.MF"}
{"title": "Optimal Execution with Reinforcement Learning", "abstract": "This study investigates the development of an optimal execution strategy\nthrough reinforcement learning, aiming to determine the most effective approach\nfor traders to buy and sell inventory within a limited time frame. Our proposed\nmodel leverages input features derived from the current state of the limit\norder book.\n  To simulate this environment and overcome the limitations associated with\nrelying on historical data, we utilize the multi-agent market simulator ABIDES,\nwhich provides a diverse range of depth levels within the limit order book.\n  We present a custom MDP formulation followed by the results of our\nmethodology and benchmark the performance against standard execution\nstrategies. Our findings suggest that the reinforcement learning-based approach\ndemonstrates significant potential.", "published": "2024-11-10 08:21:03", "link": "http://arxiv.org/abs/2411.06389v1", "categories": ["q-fin.TR", "cs.LG"], "primary_category": "q-fin.TR"}
