{"title": "Blending Ensemble for Classification with Genetic-algorithm generated Alpha factors and Sentiments (GAS)", "abstract": "With the increasing maturity and expansion of the cryptocurrency market,\nunderstanding and predicting its price fluctuations has become an important\nissue in the field of financial engineering. This article introduces an\ninnovative Genetic Algorithm-generated Alpha Sentiment (GAS) blending ensemble\nmodel specifically designed to predict Bitcoin market trends. The model\nintegrates advanced ensemble learning methods, feature selection algorithms,\nand in-depth sentiment analysis to effectively capture the complexity and\nvariability of daily Bitcoin trading data. The GAS framework combines 34 Alpha\nfactors with 8 news economic sentiment factors to provide deep insights into\nBitcoin price fluctuations by accurately analyzing market sentiment and\ntechnical indicators. The core of this study is using a stacked model\n(including LightGBM, XGBoost, and Random Forest Classifier) for trend\nprediction which demonstrates excellent performance in traditional buy-and-hold\nstrategies. In addition, this article also explores the effectiveness of using\ngenetic algorithms to automate alpha factor construction as well as enhancing\npredictive models through sentiment analysis. Experimental results show that\nthe GAS model performs competitively in daily Bitcoin trend prediction\nespecially when analyzing highly volatile financial assets with rich data.", "published": "2024-11-05 12:15:01", "link": "http://arxiv.org/abs/2411.03035v1", "categories": ["q-fin.CP", "cs.LG", "q-fin.TR", "68T07, 91G60, 62M45", "I.2.6; G.3; I.5.4"], "primary_category": "q-fin.CP"}
{"title": "Time-Causal VAE: Robust Financial Time Series Generator", "abstract": "We build a time-causal variational autoencoder (TC-VAE) for robust generation\nof financial time series data. Our approach imposes a causality constraint on\nthe encoder and decoder networks, ensuring a causal transport from the real\nmarket time series to the fake generated time series. Specifically, we prove\nthat the TC-VAE loss provides an upper bound on the causal Wasserstein distance\nbetween market distributions and generated distributions. Consequently, the\nTC-VAE loss controls the discrepancy between optimal values of various dynamic\nstochastic optimization problems under real and generated distributions. To\nfurther enhance the model's ability to approximate the latent representation of\nthe real market distribution, we integrate a RealNVP prior into the TC-VAE\nframework. Finally, extensive numerical experiments show that TC-VAE achieves\npromising results on both synthetic and real market data. This is done by\ncomparing real and generated distributions according to various statistical\ndistances, demonstrating the effectiveness of the generated data for downstream\nfinancial optimization tasks, as well as showcasing that the generated data\nreproduces stylized facts of real financial market data.", "published": "2024-11-05 09:44:15", "link": "http://arxiv.org/abs/2411.02947v1", "categories": ["cs.LG", "q-fin.CP", "37M10, 68T07"], "primary_category": "cs.LG"}
{"title": "Utilizing RNN for Real-time Cryptocurrency Price Prediction and Trading Strategy Optimization", "abstract": "This study explores the use of Recurrent Neural Networks (RNN) for real-time\ncryptocurrency price prediction and optimized trading strategies. Given the\nhigh volatility of the cryptocurrency market, traditional forecasting models\noften fall short. By leveraging RNNs' capability to capture long-term patterns\nin time-series data, this research aims to improve accuracy in price prediction\nand develop effective trading strategies. The project follows a structured\napproach involving data collection, preprocessing, and model refinement,\nfollowed by rigorous backtesting for profitability and risk assessment. This\nwork contributes to both the academic and practical fields by providing a\nrobust predictive model and optimized trading strategies that address the\nchallenges of cryptocurrency trading.", "published": "2024-11-05 22:44:52", "link": "http://arxiv.org/abs/2411.05829v1", "categories": ["q-fin.ST", "cs.AI", "cs.LG", "stat.ML"], "primary_category": "q-fin.ST"}
{"title": "Beyond the Traditional VIX: A Novel Approach to Identifying Uncertainty Shocks in Financial Markets", "abstract": "We introduce a new identification strategy for uncertainty shocks to explain\nmacroeconomic volatility in financial markets. The Chicago Board Options\nExchange Volatility Index (VIX) measures market expectations of future\nvolatility, but traditional methods based on second-moment shocks and\ntime-varying volatility of the VIX often fail to capture the non-Gaussian,\nheavy-tailed nature of asset returns. To address this, we construct a revised\nVIX by fitting a double-subordinated Normal Inverse Gaussian Levy process to\nS&P 500 option prices, providing a more comprehensive measure of volatility\nthat reflects the extreme movements and heavy tails observed in financial data.\nUsing an axiomatic approach, we introduce a general family of risk-reward\nratios, computed with our revised VIX and fitted over a fractional time series\nto more accurately identify uncertainty shocks in financial markets.", "published": "2024-11-05 04:34:27", "link": "http://arxiv.org/abs/2411.02804v1", "categories": ["econ.EM", "q-fin.ST"], "primary_category": "econ.EM"}
