{"title": "COMEX Copper Futures Volatility Forecasting: Econometric Models and Deep Learning", "abstract": "This paper investigates the forecasting performance of COMEX copper futures\nrealized volatility across various high-frequency intervals using both\neconometric volatility models and deep learning recurrent neural network\nmodels. The econometric models considered are GARCH and HAR, while the deep\nlearning models include RNN (Recurrent Neural Network), LSTM (Long Short-Term\nMemory), and GRU (Gated Recurrent Unit). In forecasting daily realized\nvolatility for COMEX copper futures with a rolling window approach, the\neconometric models, particularly HAR, outperform recurrent neural networks\noverall, with HAR achieving the lowest QLIKE loss function value. However, when\nthe data is replaced with hourly high-frequency realized volatility, the deep\nlearning models outperform the GARCH model, and HAR attains a comparable QLIKE\nloss function value. Despite the black-box nature of machine learning models,\nthe deep learning models demonstrate superior forecasting performance,\nsurpassing the fixed QLIKE value of HAR in the experiment. Moreover, as the\nforecast horizon extends for daily realized volatility, deep learning models\ngradually close the performance gap with the GARCH model in certain loss\nfunction metrics. Nonetheless, HAR remains the most effective model overall for\ndaily realized volatility forecasting in copper futures.", "published": "2024-09-12 18:44:31", "link": "http://arxiv.org/abs/2409.08356v1", "categories": ["q-fin.MF", "cs.LG"], "primary_category": "q-fin.MF"}
{"title": "A market resilient data-driven approach to option pricing", "abstract": "In this paper, we present a data-driven ensemble approach for option price\nprediction whose derivation is based on the no-arbitrage theory of option\npricing. Using the theoretical treatment, we derive a common representation\nspace for achieving domain adaptation. The success of an implementation of this\nidea is shown using some real data. Then we report several experimental results\nfor critically examining the performance of the derived pricing models.", "published": "2024-09-12 16:46:07", "link": "http://arxiv.org/abs/2409.08205v1", "categories": ["q-fin.MF"], "primary_category": "q-fin.MF"}
{"title": "On the macroeconomic fundamentals of long-term volatilities and dynamic correlations in COMEX copper futures", "abstract": "This paper examines the influence of low-frequency macroeconomic variables on\nthe high-frequency returns of copper futures and the long-term correlation with\nthe S&P 500 index, employing GARCH-MIDAS and DCC-MIDAS modeling frameworks. The\nestimated results of GARCH-MIDAS show that realized volatility (RV), level of\ninterest rates (IR), industrial production (IP) and producer price index (PPI),\nvolatility of Slope, PPI, consumer sentiment index (CSI), and dollar index (DI)\nhave significant impacts on Copper futures returns, among which PPI is the most\nefficient macroeconomic variable. From comparison among DCC-GARCH and DCC-MIDAS\nmodel, the added MIDAS filter of PPI improves the model fitness and have better\nperformance than RV in effecting the long-run relationship between Copper\nfutures and S&P 500.", "published": "2024-09-12 18:41:09", "link": "http://arxiv.org/abs/2409.08355v1", "categories": ["q-fin.ST"], "primary_category": "q-fin.ST"}
