{"title": "Multi-asset and generalised Local Volatility. An efficient implementation", "abstract": "This article presents a generic hybrid numerical method to price a wide range\nof options on one or several assets, as well as assets with stochastic drift or\nvolatility. In particular for equity and interest rate hybrid with local\nvolatility.", "published": "2024-11-08 09:16:59", "link": "http://arxiv.org/abs/2411.05425v1", "categories": ["q-fin.CP", "q-fin.PR"], "primary_category": "q-fin.CP"}
{"title": "Optimal reinsurance and investment via stochastic projected gradient method based on Malliavin calculus", "abstract": "This paper proposes a new approach using the stochastic projected gradient\nmethod and Malliavin calculus for optimal reinsurance and investment\nstrategies. Unlike traditional methodologies, we aim to optimize static\ninvestment and reinsurance strategies by directly minimizing the ruin\nprobability. Furthermore, we provide a convergence analysis of the stochastic\nprojected gradient method for general constrained optimization problems whose\nobjective function has H\\\"older continuous gradient. Numerical experiments show\nthe effectiveness of our proposed method.", "published": "2024-11-08 09:12:02", "link": "http://arxiv.org/abs/2411.05417v1", "categories": ["q-fin.MF", "math.OC", "q-fin.CP"], "primary_category": "q-fin.MF"}
{"title": "Enforcing asymptotic behavior with DNNs for approximation and regression in finance", "abstract": "We propose a simple methodology to approximate functions with given\nasymptotic behavior by specifically constructed terms and an unconstrained deep\nneural network (DNN).\n  The methodology we describe extends to various asymptotic behaviors and\nmultiple dimensions and is easy to implement. In this work we demonstrate it\nfor linear asymptotic behavior in one-dimensional examples. We apply it to\nfunction approximation and regression problems where we measure approximation\nof only function values (``Vanilla Machine Learning''-VML) or also\napproximation of function and derivative values (``Differential Machine\nLearning''-DML) on several examples. We see that enforcing given asymptotic\nbehavior leads to better approximation and faster convergence.", "published": "2024-11-08 01:11:58", "link": "http://arxiv.org/abs/2411.05257v1", "categories": ["q-fin.CP", "cs.NA", "math.NA", "q-fin.PR"], "primary_category": "q-fin.CP"}
{"title": "Model-free portfolio allocation in continuous-time", "abstract": "We present a non-probabilistic, path-by-path framework for studying\npath-dependent (i.e., where weight is a functional of time and historical\ntime-series), long-only portfolio allocation in continuous-time based on [Chiu\n& Cont '23], where the fundamental concept of self-financing was introduced,\nindependent of any integration theory. In this article, we extend this concept\nto a portfolio allocation strategy and characterize it by a path-dependent\npartial differential equation. We derive the general explicit solution that\ndescribes the evolution of wealth in generic markets, including price paths\nthat may not evolve continuously or exhibit variation of any order. Explicit\nsolution examples are provided.\n  As an application of our continuous-time, path-dependent framework, we extend\nan aggregating algorithm of [Vovk '90] and the universal algorithm of [Cover\n'91] to continuous-time algorithms that combine multiple strategies into a\nsingle strategy. These continuous-time (meta) algorithms take multiple\nstrategies as input (which may themselves be generated by other algorithms) and\ntrack the wealth generated by the best individual strategy and the best convex\ncombination of strategies, with tracking error bounds in log wealth of order\nO(1) and O(ln t), respectively. This work extends Cover's theorem [Cover '91,\nThm 6.1] to a continuous-time, model-free setting.", "published": "2024-11-08 10:48:54", "link": "http://arxiv.org/abs/2411.05470v2", "categories": ["q-fin.MF"], "primary_category": "q-fin.MF"}
{"title": "Filling in Missing FX Implied Volatilities with Uncertainties: Improving VAE-Based Volatility Imputation", "abstract": "Missing data is a common problem in finance and often requires methods to\nfill in the gaps, or in other words, imputation. In this work, we focused on\nthe imputation of missing implied volatilities for FX options. Prior work has\nused variational autoencoders (VAEs), a neural network-based approach, to solve\nthis problem; however, using stronger classical baselines such as Heston with\njumps can significantly outperform their results. We show that simple\nmodifications to the architecture of the VAE lead to significant imputation\nperformance improvements (e.g., in low missingness regimes, nearly cutting the\nerror by half), removing the necessity of using $\\beta$-VAEs. Further, we\nmodify the VAE imputation algorithm in order to better handle the uncertainty\nin data, as well as to obtain accurate uncertainty estimates around imputed\nvalues.", "published": "2024-11-08 22:30:28", "link": "http://arxiv.org/abs/2411.05998v1", "categories": ["q-fin.ST", "cs.LG", "stat.ML"], "primary_category": "q-fin.ST"}
{"title": "Approaching multifractal complexity in decentralized cryptocurrency trading", "abstract": "Multifractality is a concept that helps compactly grasping the most essential\nfeatures of the financial dynamics. In its fully developed form, this concept\napplies to essentially all mature financial markets and even to more liquid\ncryptocurrencies traded on the centralized exchanges. A new element that adds\ncomplexity to cryptocurrency markets is the possibility of decentralized\ntrading. Based on the extracted tick-by-tick transaction data from the\nUniversal Router contract of the Uniswap decentralized exchange, from June 6,\n2023, to June 30, 2024, the present study using Multifractal Detrended\nFluctuation Analysis (MFDFA) shows that even though liquidity on these new\nexchanges is still much lower compared to centralized exchanges convincing\ntraces of multifractality are already emerging on this new trading as well. The\nresulting multifractal spectra are however strongly left-side asymmetric which\nindicates that this multifractality comes primarily from large fluctuations and\nsmall ones are more of the uncorrelated noise type. What is particularly\ninteresting here is the fact that multifractality is more developed for time\nseries representing transaction volumes than rates of return. On the level of\nthese larger events a trace of multifractal cross-correlations between the two\ncharacteristics is also observed.", "published": "2024-11-08 20:27:31", "link": "http://arxiv.org/abs/2411.05951v1", "categories": ["q-fin.ST", "cs.CE", "q-fin.TR", "stat.AP"], "primary_category": "q-fin.ST"}
{"title": "How Wash Traders Exploit Market Conditions in Cryptocurrency Markets", "abstract": "Wash trading, the practice of simultaneously placing buy and sell orders for\nthe same asset to inflate trading volume, has been prevalent in cryptocurrency\nmarkets. This paper investigates whether wash traders in Bitcoin act\ndeliberately to exploit market conditions and identifies the characteristics of\nsuch manipulative behavior. Using a unique dataset of 18 million transactions\nfrom Mt. Gox, once the largest Bitcoin exchange, I find that wash trading\nintensifies when legitimate trading volume is low and diminishes when it is\nhigh, indicating strategic timing to maximize impact in less liquid markets.\nThe activity also exhibits spillover effects across platforms and decreases\nwhen trading volumes in other asset classes like stocks or gold rise,\nsuggesting sensitivity to broader market dynamics. Additionally, wash traders\nexploit periods of heightened media attention and online rumors to amplify\ntheir influence, causing rapid but short-lived spikes in legitimate trading\nvolume. Using an exogenous demand shock associated with illicit online\nmarketplaces, I find that wash trading responds to contemporaneous events\naffecting Bitcoin demand. These results advance the understanding of\nmanipulative practices in digital currency markets and have significant\nimplications for regulators aiming to detect and prevent wash trading.", "published": "2024-11-08 17:32:01", "link": "http://arxiv.org/abs/2411.08720v1", "categories": ["q-fin.TR", "econ.GN", "q-fin.EC", "91G80", "J.4"], "primary_category": "q-fin.TR"}
