{"title": "Modeling News Interactions and Influence for Financial Market Prediction", "abstract": "The diffusion of financial news into market prices is a complex process,\nmaking it challenging to evaluate the connections between news events and\nmarket movements. This paper introduces FININ (Financial Interconnected News\nInfluence Network), a novel market prediction model that captures not only the\nlinks between news and prices but also the interactions among news items\nthemselves. FININ effectively integrates multi-modal information from both\nmarket data and news articles. We conduct extensive experiments on two\ndatasets, encompassing the S&P 500 and NASDAQ 100 indices over a 15-year period\nand over 2.7 million news articles. The results demonstrate FININ's\neffectiveness, outperforming advanced market prediction models with an\nimprovement of 0.429 and 0.341 in the daily Sharpe ratio for the two markets\nrespectively. Moreover, our results reveal insights into the financial news,\nincluding the delayed market pricing of news, the long memory effect of news,\nand the limitations of financial sentiment analysis in fully extracting\npredictive power from news data.", "published": "2024-10-14 15:19:49", "link": "http://arxiv.org/abs/2410.10614v1", "categories": ["cs.CE", "cs.AI", "cs.CL", "q-fin.CP"], "primary_category": "cs.CE"}
{"title": "European Option Pricing in Regime Switching Framework via Physics-Informed Residual Learning", "abstract": "In this article, we employ physics-informed residual learning (PIRL) and\npropose a pricing method for European options under a regime-switching\nframework, where closed-form solutions are not available. We demonstrate that\nthe proposed approach serves an efficient alternative to competing pricing\ntechniques for regime-switching models in the literature. Specifically, we\ndemonstrate that PIRLs eliminate the need for retraining and become nearly\ninstantaneous once trained, thus, offering an efficient and flexible tool for\npricing options across a broad range of specifications and parameters.", "published": "2024-10-14 13:09:10", "link": "http://arxiv.org/abs/2410.10474v1", "categories": ["q-fin.CP"], "primary_category": "q-fin.CP"}
{"title": "Representation Learning for Regime detection in Block Hierarchical Financial Markets", "abstract": "We consider financial market regime detection from the perspective of deep\nrepresentation learning of the causal information geometry underpinning traded\nasset systems using a hierarchical correlation structure to characterise market\nevolution. We assess the robustness of three toy models: SPDNet, SPD-NetBN and\nU-SPDNet whose architectures respect the underlying Riemannian manifold of\ninput block hierarchical SPD correlation matrices. Market phase detection for\neach model is carried out using three data configurations: randomised JSE Top\n60 data, synthetically-generated block hierarchical SPD matrices and\nblock-resampled chronology-preserving JSE Top 60 data. We show that using a\nsingular performance metric is misleading in our financial market investment\nuse cases where deep learning models overfit in learning spatio-temporal\ncorrelation dynamics.", "published": "2024-10-14 20:23:00", "link": "http://arxiv.org/abs/2410.22346v1", "categories": ["q-fin.ST", "cs.LG"], "primary_category": "q-fin.ST"}
{"title": "News-Driven Stock Price Forecasting in Indian Markets: A Comparative Study of Advanced Deep Learning Models", "abstract": "Forecasting stock market prices remains a complex challenge for traders,\nanalysts, and engineers due to the multitude of factors that influence price\nmovements. Recent advancements in artificial intelligence (AI) and natural\nlanguage processing (NLP) have significantly enhanced stock price prediction\ncapabilities. AI's ability to process vast and intricate data sets has led to\nmore sophisticated forecasts. However, achieving consistently high accuracy in\nstock price forecasting remains elusive. In this paper, we leverage 30 years of\nhistorical data from national banks in India, sourced from the National Stock\nExchange, to forecast stock prices. Our approach utilizes state-of-the-art deep\nlearning models, including multivariate multi-step Long Short-Term Memory\n(LSTM), Facebook Prophet with LightGBM optimized through Optuna, and Seasonal\nAuto-Regressive Integrated Moving Average (SARIMA). We further integrate\nsentiment analysis from tweets and reliable financial sources such as Business\nStandard and Reuters, acknowledging their crucial influence on stock price\nfluctuations.", "published": "2024-10-14 15:30:06", "link": "http://arxiv.org/abs/2411.05788v1", "categories": ["q-fin.ST", "cs.LG"], "primary_category": "q-fin.ST"}
