{"title": "SeQwen at the Financial Misinformation Detection Challenge Task: Sequential Learning for Claim Verification and Explanation Generation in Financial Domains", "abstract": "This paper presents the system description of our entry for the COLING 2025\nFMD challenge, focusing on misinformation detection in financial domains. We\nexperimented with a combination of large language models, including Qwen,\nMistral, and Gemma-2, and leveraged pre-processing and sequential learning for\nnot only identifying fraudulent financial content but also generating coherent,\nand concise explanations that clarify the rationale behind the classifications.\nOur approach achieved competitive results with an F1-score of 0.8283 for\nclassification, and ROUGE-1 of 0.7253 for explanations. This work highlights\nthe transformative potential of LLMs in financial applications, offering\ninsights into their capabilities for combating misinformation and enhancing\ntransparency while identifying areas for future improvement in robustness and\ndomain adaptation.", "published": "2024-11-30 18:03:04", "link": "http://arxiv.org/abs/2412.00549v1", "categories": ["cs.CL", "cs.CE", "cs.LG", "q-fin.CP"], "primary_category": "cs.CL"}
{"title": "Detecting imbalanced financial markets through time-varying optimization and nonlinear functionals", "abstract": "This paper studies the time-varying structure of the equity market with\nrespect to market capitalization. First, we analyze the distribution of the 100\nlargest companies' market capitalizations over time, in terms of inequality,\nconcentration at the top, and overall discrepancies in the distribution between\ndifferent times. In the next section, we introduce a mathematical framework of\nlinear and nonlinear functionals of time-varying portfolios. We apply this to\nstudy the market capitalization exposure and spread of optimal portfolios\nchosen by a Sharpe optimization procedure. These methods could be more widely\nused to study various measures of optimal portfolios and measure different\naspects of market exposure while holding portfolios selected by an optimization\nroutine that changes over time.", "published": "2024-11-30 13:05:19", "link": "http://arxiv.org/abs/2412.00468v2", "categories": ["q-fin.MF"], "primary_category": "q-fin.MF"}
