{"title": "Pricing and Hedging Strategies for Cross-Currency Equity Protection Swaps", "abstract": "In this paper, we explore the pricing and hedging strategies for an\ninnovative insurance product called the equity protection swap(EPS). Notably,\nwe focus on the application of EPSs involving cross-currency reference\nportfolios, reflecting the realities of investor asset diversification across\ndifferent economies. The research examines key considerations regarding\nexchange rate fluctuations, pricing and hedging frameworks, in order to satisfy\ndynamic requirements from EPS buyers. We differentiate between two hedging\nparadigms: one where domestic and foreign equities are treated separately using\ntwo EPS products and another that integrates total returns across currencies.\nThrough detailed analysis, we propose various hedging strategies with\nconsideration of different types of returns - nominal, effective, and quanto -\nfor EPS products in both separate and aggregated contexts. The aggregated\nhedging portfolios contain basket options with cross-currency underlying asset,\nwhich only exists in the OTC market, thus we further consider a superhedging\nstrategy using single asset European options for aggregated returns. A\nnumerical study assesses hedging costs and performance metrics associated with\nthese hedging strategies, illuminating practical implications for EPS providers\nand investors engaged in international markets. We further employ Monte Carlo\nsimulations for the basket option pricing, together with two other\napproximation methods - geometric averaging and moment matching. This work\ncontributes to enhancing fair pricing mechanisms and risk management strategies\nin the evolving landscape of cross-currency financial derivatives.", "published": "2024-09-28 15:27:28", "link": "http://arxiv.org/abs/2409.19387v1", "categories": ["q-fin.MF", "91G20, 91G60", "G.1.10; G.1.8"], "primary_category": "q-fin.MF"}
{"title": "Time-Consistent Portfolio Selection for Rank-Dependent Utilities in an Incomplete Market", "abstract": "We investigate the portfolio selection problem for an agent with\nrank-dependent utility in an incomplete financial market. For a\nconstant-coefficient market and CRRA utilities, we characterize the\ndeterministic strict equilibrium strategies. In the case of time-invariant\nprobability weighting function, we provide a comprehensive characterization of\nthe deterministic strict equilibrium strategy. The unique non-zero equilibrium,\nif exists, can be determined by solving an autonomous ODE. In the case of\ntime-variant probability weighting functions, we observe that there may be\ninfinitely many non-zero deterministic strict equilibrium strategies, which are\nderived from the positive solutions to a nonlinear singular ODE. By specifying\nthe maximal solution to the singular ODE, we are able to identify all the\npositive solutions. In addition, we address the issue of selecting an optimal\nstrategy from the numerous equilibrium strategies available.", "published": "2024-09-28 06:28:06", "link": "http://arxiv.org/abs/2409.19259v1", "categories": ["q-fin.MF", "math.OC"], "primary_category": "q-fin.MF"}
{"title": "Evaluating Financial Relational Graphs: Interpretation Before Prediction", "abstract": "Accurate and robust stock trend forecasting has been a crucial and\nchallenging task, as stock price changes are influenced by multiple factors.\nGraph neural network-based methods have recently achieved remarkable success in\nthis domain by constructing stock relationship graphs that reflect internal\nfactors and relationships between stocks. However, most of these methods rely\non predefined factors to construct static stock relationship graphs due to the\nlack of suitable datasets, failing to capture the dynamic changes in stock\nrelationships. Moreover, the evaluation of relationship graphs in these methods\nis often tied to the performance of neural network models on downstream tasks,\nleading to confusion and imprecision. To address these issues, we introduce the\nSPNews dataset, collected based on S\\&P 500 Index stocks, to facilitate the\nconstruction of dynamic relationship graphs. Furthermore, we propose a novel\nset of financial relationship graph evaluation methods that are independent of\ndownstream tasks. By using the relationship graph to explain historical\nfinancial phenomena, we assess its validity before constructing a graph neural\nnetwork, ensuring the graph's effectiveness in capturing relevant financial\nrelationships. Experimental results demonstrate that our evaluation methods can\neffectively differentiate between various financial relationship graphs,\nyielding more interpretable results compared to traditional approaches. We make\nour source code publicly available on GitHub to promote reproducibility and\nfurther research in this area.", "published": "2024-09-28 22:43:00", "link": "http://arxiv.org/abs/2410.07216v1", "categories": ["q-fin.ST", "cs.AI", "cs.LG", "I.2.4"], "primary_category": "q-fin.ST"}
{"title": "Multi-Factor Polynomial Diffusion Models and Inter-Temporal Futures Dynamics", "abstract": "In stochastic multi-factor commodity models, it is often the case that\nfutures prices are explained by two latent state variables which represent the\nshort and long term stochastic factors. In this work, we develop the family of\nstochastic models using polynomial diffusion to obtain the unobservable spot\nprice to be used for modelling futures curve dynamics. The polynomial family of\ndiffusion models allows one to incorporate a variety of non-linear,\nhigher-order effects, into a multi-factor stochastic model, which is a\ngeneralisation of Schwartz and Smith (2000) two-factor model. Two filtering\nmethods are used for the parameter and the latent factor estimation to address\nthe non-linearity. We provide a comparative analysis of the performance of the\nestimation procedures. We discuss the parameter identification problem present\nin the polynomial diffusion case, regardless, the futures prices can still be\nestimated accurately. Moreover, we study the effects of different methods of\ncalculating matrix exponential in the polynomial diffusion model. As the\npolynomial order increases, accurately and efficiently approximating the\nhigh-dimensional matrix exponential becomes essential in the polynomial\ndiffusion model.", "published": "2024-09-28 15:25:12", "link": "http://arxiv.org/abs/2409.19386v1", "categories": ["q-fin.ST"], "primary_category": "q-fin.ST"}
{"title": "PDSim: A Shiny App for Polynomial Diffusion Model Simulation and Estimation", "abstract": "PDSim is an R package that enables users to simulate commodity futures prices\nusing the polynomial diffusion model introduced in Filipovic and Larsson (2016)\nthrough both a Shiny web application and R scripts. It also provides state\nvariables and contract estimations via the Extended Kalman Filter (EKF) or\nUnscented Kalman Filter (UKF). With its user-friendly interface, PDSim makes\nthe features of simulations and estimations accessible to all users. To date,\nit is the only package specifically designed for the simulation and estimation\nof the polynomial diffusion model. Additionally, the package integrates the\nSchwartz and Smith two-factor model (Schwartz & Smith, 2000) as an alternative\napproach. PDSim offers versatile deployment options, including running locally,\nvia the Shiny server, or through Docker.", "published": "2024-09-28 15:20:53", "link": "http://arxiv.org/abs/2409.19385v1", "categories": ["q-fin.ST"], "primary_category": "q-fin.ST"}
{"title": "Optimizing Time Series Forecasting: A Comparative Study of Adam and Nesterov Accelerated Gradient on LSTM and GRU networks Using Stock Market data", "abstract": "Several studies have discussed the impact different optimization techniques\nin the context of time series forecasting across different Neural network\narchitectures. This paper examines the effectiveness of Adam and Nesterov's\nAccelerated Gradient (NAG) optimization techniques on LSTM and GRU neural\nnetworks for time series prediction, specifically stock market time-series. Our\nstudy was done by training LSTM and GRU models with two different optimization\ntechniques - Adam and Nesterov Accelerated Gradient (NAG), comparing and\nevaluating their performance on Apple Inc's closing price data over the last\ndecade. The GRU model optimized with Adam produced the lowest RMSE,\noutperforming the other model-optimizer combinations in both accuracy and\nconvergence speed. The GRU models with both optimizers outperformed the LSTM\nmodels, whilst the Adam optimizer outperformed the NAG optimizer for both model\narchitectures. The results suggest that GRU models optimized with Adam are\nwell-suited for practitioners in time-series prediction, more specifically\nstock price time series prediction producing accurate and computationally\nefficient models. The code for the experiments in this project can be found at\nhttps://github.com/AhmadMak/Time-Series-Optimization-Research Keywords:\nTime-series Forecasting, Neural Network, LSTM, GRU, Adam Optimizer, Nesterov\nAccelerated Gradient (NAG) Optimizer", "published": "2024-09-28 08:35:19", "link": "http://arxiv.org/abs/2410.01843v1", "categories": ["q-fin.ST"], "primary_category": "q-fin.ST"}
