{"title": "Calculating Profits and Losses for Algorithmic Trading Strategies: A Short Guide", "abstract": "We present a series of equations that track the total realized and unrealized\nprofits and losses at any time, incorporating the spread. The resulting\nformalism is ideally suited to evaluate the performance of trading model\nalgorithms.", "published": "2024-11-21 12:31:14", "link": "http://arxiv.org/abs/2411.14068v1", "categories": ["q-fin.TR"], "primary_category": "q-fin.TR"}
{"title": "Market Making without Regret", "abstract": "We consider a sequential decision-making setting where, at every round $t$, a\nmarket maker posts a bid price $B_t$ and an ask price $A_t$ to an incoming\ntrader (the taker) with a private valuation for one unit of some asset. If the\ntrader's valuation is lower than the bid price, or higher than the ask price,\nthen a trade (sell or buy) occurs. If a trade happens at round $t$, then\nletting $M_t$ be the market price (observed only at the end of round $t$), the\nmaker's utility is $M_t - B_t$ if the maker bought the asset, and $A_t - M_t$\nif they sold it. We characterize the maker's regret with respect to the best\nfixed choice of bid and ask pairs under a variety of assumptions (adversarial,\ni.i.d., and their variants) on the sequence of market prices and valuations.\nOur upper bound analysis unveils an intriguing connection relating market\nmaking to first-price auctions and dynamic pricing. Our main technical\ncontribution is a lower bound for the i.i.d. case with Lipschitz distributions\nand independence between prices and valuations. The difficulty in the analysis\nstems from the unique structure of the reward and feedback functions, allowing\nan algorithm to acquire information by graduating the \"cost of exploration\" in\nan arbitrary way.", "published": "2024-11-21 10:13:55", "link": "http://arxiv.org/abs/2411.13993v1", "categories": ["cs.GT", "cs.LG", "q-fin.TR"], "primary_category": "cs.GT"}
{"title": "Does the square-root price impact law belong to the strict universal scalings?: quantitative support by a complete survey of the Tokyo stock exchange market", "abstract": "Universal power laws have been scrutinised in physics and beyond, and a\nlong-standing debate exists in econophysics regarding the strict universality\nof the nonlinear price impact, commonly referred to as the square-root law\n(SRL). The SRL posits that the average price impact $I$ follows a power law\nwith respect to transaction volume $Q$, such that $I(Q) \\propto Q^{\\delta}$\nwith $\\delta \\approx 1/2$. Some researchers argue that the exponent $\\delta$\nshould be system-specific, without universality. Conversely, others contend\nthat $\\delta$ should be exactly $1/2$ for all stocks across all countries,\nimplying universality. However, resolving this debate requires high-precision\nmeasurements of $\\delta$ with errors of around $0.1$ across hundreds of stocks,\nwhich has been extremely challenging due to the scarcity of large microscopic\ndatasets -- those that enable tracking the trading behaviour of all individual\naccounts. Here we conclusively support the universality hypothesis of the SRL\nby a complete survey of all trading accounts for all liquid stocks on the Tokyo\nStock Exchange (TSE) over eight years. Using this comprehensive microscopic\ndataset, we show that the exponent $\\delta$ is equal to $1/2$ within\nstatistical errors at both the individual stock level and the individual trader\nlevel. Additionally, we rejected two prominent models supporting the\nnonuniversality hypothesis: the Gabaix-Gopikrishnan-Plerou-Stanley and the\nFarmer-Gerig-Lillo-Waelbroeck models. Our work provides exceptionally\nhigh-precision evidence for the universality hypothesis in social science and\ncould prove useful in evaluating the price impact by large investors -- an\nimportant topic even among practitioners.", "published": "2024-11-21 09:28:26", "link": "http://arxiv.org/abs/2411.13965v1", "categories": ["q-fin.TR", "cond-mat.stat-mech", "econ.GN", "q-fin.EC", "q-fin.PM", "q-fin.RM"], "primary_category": "q-fin.TR"}
