{"title": "Unsupervised learning-based calibration scheme for Rough Bergomi model", "abstract": "Current deep learning-based calibration schemes for rough volatility models\nare based on the supervised learning framework, which can be costly due to a\nlarge amount of training data being generated. In this work, we propose a novel\nunsupervised learning-based scheme for the rough Bergomi (rBergomi) model which\ndoes not require accessing training data. The main idea is to use the backward\nstochastic differential equation (BSDE) derived in [Bayer, Qiu and Yao, {SIAM\nJ. Financial Math.}, 2022] and simultaneously learn the BSDE solutions with the\nmodel parameters. We establish that the mean squares error between the option\nprices under the learned model parameters and the historical data is bounded by\nthe loss function. Moreover, the loss can be made arbitrarily small under\nsuitable conditions on the fitting ability of the rBergomi model to the market\nand the universal approximation capability of neural networks. Numerical\nexperiments for both simulated and historical data confirm the efficiency of\nscheme.", "published": "2024-12-03 03:48:09", "link": "http://arxiv.org/abs/2412.02135v2", "categories": ["q-fin.CP", "91G20, 60H15, 91G60, 60H35, 91G80"], "primary_category": "q-fin.CP"}
{"title": "An Integral Equation in Portfolio Selection with Time-Inconsistent Preferences", "abstract": "This paper discusses a nonlinear integral equation arising from portfolio\nselection with a class of time-inconsistent preferences. We propose a unified\nframework requiring minimal assumptions, such as right-continuity of market\ncoefficients and square-integrability of the market price of risk. Our main\ncontribution is proving the existence and uniqueness of the square-integrable\nsolution for the integral equation under mild conditions. Illustrative\napplications include the mean-variance portfolio selection and the utility\nmaximization with random risk aversion.", "published": "2024-12-03 13:30:05", "link": "http://arxiv.org/abs/2412.02446v2", "categories": ["q-fin.MF", "91G10, 91B70"], "primary_category": "q-fin.MF"}
{"title": "Uncertain Regulations, Definite Impacts: The Impact of the US Securities and Exchange Commission's Regulatory Interventions on Crypto Assets", "abstract": "This study employs an event study methodology to investigate the market\nimpact of the U.S. Securities and Exchange Commission's (SEC) classification of\ncrypto assets as securities. It explores how SEC interventions influence asset\nreturns and trading volumes, focusing on explicitly named crypto assets. The\nempirical analysis highlights significant adverse market reactions, notably\nreturns plummeting 12% over one week post-announcement, persisting for a month.\nWe demonstrate that the severity of market reaction depends on sentiment and\nasset characteristics such as market size, age, volatility, and illiquidity.\nFurther, we identify significant ex-ante trading volume effects indicative of\npre-announcement informed trading.", "published": "2024-12-03 13:38:02", "link": "http://arxiv.org/abs/2412.02452v1", "categories": ["q-fin.GN", "q-fin.RM", "q-fin.TR", "91G15, 91G30, 91G45, 91G70, 62P20", "K.4.1; I.6.5"], "primary_category": "q-fin.GN"}
