{"title": "Robust Elicitable Functionals", "abstract": "Elicitable functionals and (strictly) consistent scoring functions are of\ninterest due to their utility of determining (uniquely) optimal forecasts, and\nthus the ability to effectively backtest predictions. However, in practice,\nassuming that a distribution is correctly specified is too strong a belief to\nreliably hold. To remediate this, we incorporate a notion of statistical\nrobustness into the framework of elicitable functionals, meaning that our\nrobust functional accounts for \"small\" misspecifications of a baseline\ndistribution. Specifically, we propose a robustified version of elicitable\nfunctionals by using the Kullback-Leibler divergence to quantify potential\nmisspecifications from a baseline distribution. We show that the robust\nelicitable functionals admit unique solutions lying at the boundary of the\nuncertainty region, and provide conditions for existence and uniqueness. Since\nevery elicitable functional possesses infinitely many scoring functions, we\npropose the class of b-homogeneous strictly consistent scoring functions, for\nwhich the robust functionals maintain desirable statistical properties. We show\nthe applicability of the robust elicitable functional in several examples: in a\nreinsurance setting and in robust regression problems.", "published": "2024-09-06 17:15:56", "link": "http://arxiv.org/abs/2409.04412v2", "categories": ["stat.ME", "q-fin.MF", "q-fin.RM"], "primary_category": "stat.ME"}
{"title": "Ergodicity and Law-of-large numbers for the Volterra Cox-Ingersoll-Ross process", "abstract": "We study the Volterra Volterra Cox-Ingersoll-Ross process on $\\mathbb{R}_+$\nand its stationary version. Based on a fine asymptotic analysis of the\ncorresponding Volterra Riccati equation combined with the affine transformation\nformula, we first show that the finite-dimensional distributions of this\nprocess are asymptotically independent. Afterwards, we prove a law-of-large\nnumbers in $L^p$(\\Omega)$ with $p \\geq 2$ and show that the stationary process\nis ergodic. As an application, we prove the consistency of the method of\nmoments and study the maximum-likelihood estimation for continuous and discrete\nhigh-frequency observations.", "published": "2024-09-06 15:08:19", "link": "http://arxiv.org/abs/2409.04496v1", "categories": ["math.PR", "q-fin.MF"], "primary_category": "math.PR"}
{"title": "Optimal post-retirement investment under longevity risk in collective funds", "abstract": "We study the optimal investment problem for a homogeneous collective of $n$\nindividuals investing in a Black-Scholes model subject to longevity risk with\nEpstein--Zin preferences. %and with preferences given by power utility. We\ncompute analytic formulae for the optimal investment strategy, consumption is\nin discrete-time and there is no systematic longevity risk. We develop a\nstylised model of systematic longevity risk in continuous time which allows us\nto also obtain an analytic solution to the optimal investment problem in this\ncase. We numerically solve the same problem using a continuous-time version of\nthe Cairns--Blake--Dowd model. We apply our results to estimate the potential\nbenefits of pooling longevity risk over purchasing an insurance product such as\nan annuity, and to estimate the benefits of optimal longevity risk pooling in a\nsmall heterogeneous fund.", "published": "2024-09-06 13:19:51", "link": "http://arxiv.org/abs/2409.15325v1", "categories": ["q-fin.MF"], "primary_category": "q-fin.MF"}
