{"title": "Direct Inversion for the Squared Bessel Process and Applications", "abstract": "In this paper we derive a new direct inversion method to simulate squared\nBessel processes. Since the transition probability of these processes can be\nrepresented by a non-central chi-square distribution, we construct an efficient\nand accurate algorithm to simulate non-central chi-square variables. In this\nmethod, the dimension of the squared Bessel process, equivalently the degrees\nof freedom of the chi-square distribution, is treated as a variable. We\ntherefore use a two-dimensional Chebyshev expansion to approximate the inverse\nfunction of the central chi-square distribution with one variable being the\ndegrees of freedom. The method is accurate and efficient for any value of\ndegrees of freedom including the computationally challenging case of small\nvalues. One advantage of the method is that noncentral chi-square samples can\nbe generated for a whole range of values of degrees of freedom using the same\nChebyshev coefficients. The squared Bessel process is a building block for the\nwell-known Cox-Ingersoll-Ross (CIR) processes, which can be generated from\nsquared Bessel processes through time change and linear transformation. Our\ndirect inversion method thus allows the efficient and accurate simulation of\nthese processes, which are used as models in a wide variety of applications.", "published": "2024-12-21 14:55:34", "link": "http://arxiv.org/abs/2412.16655v1", "categories": ["stat.CO", "math.PR", "q-fin.CP", "stat.ME"], "primary_category": "stat.CO"}
{"title": "Path-dependent Fractional Volterra Equations and the Microstructure of Rough Volatility Models driven by Poisson Random Measures", "abstract": "We consider a microstructure foundation for rough volatility models driven by\nPoisson random measures. In our model the volatility is driven by self-exciting\narrivals of market orders as well as self-exciting arrivals of limit orders and\ncancellations. The impact of market order on future order arrivals is captured\nby a Hawkes kernel with power law decay, and is hence persistent. The impact of\nlimit orders on future order arrivals is temporary, yet possibly long-lived.\nAfter suitable scaling the volatility process converges to a fractional Heston\nmodel driven by an additional Poisson random measure. The random measure\ngenerates occasional spikes and clusters of spikes in the volatility process.\nOur results are based on novel existence and uniqueness of solutions results\nfor stochastic path-dependent Volterra equations driven by Poisson random\nmeasures.", "published": "2024-12-21 01:53:22", "link": "http://arxiv.org/abs/2412.16436v1", "categories": ["math.PR", "q-fin.MF", "Primary 60G55, 60F05, secondary 60G22"], "primary_category": "math.PR"}
