{"title": "Risk measures on incomplete markets: a new non-solid paradigm", "abstract": "We study risk measures $\\varphi:E\\longrightarrow\\mathbb{R}\\cup\\{\\infty\\}$,\nwhere $E$ is a vector space of random variables which a priori has no lattice\nstructure$\\unicode{x2014}$a blind spot of the existing risk measures\nliterature. In particular, we address when $\\varphi$ admits a tractable dual\nrepresentation (one which does not contain non-$\\sigma$-additive signed\nmeasures), and whether one can extend $\\varphi$ to a solid superspace of $E$.\nThe existence of a tractable dual representation is shown to be equivalent,\nmodulo certain technicalities, to a Fatou-like property, while extension\ntheorems are established under the existence of a sufficiently regular lift, a\npotentially non-linear mechanism of assigning random variable extensions to\ncertain linear functionals on $E$. Our motivation is broadening the theory of\nrisk measures to spaces without a lattice structure, which are ubiquitous in\nfinancial economics, especially when markets are incomplete.", "published": "2024-09-08 19:12:52", "link": "http://arxiv.org/abs/2409.05194v2", "categories": ["q-fin.RM", "math.FA", "math.PR", "q-fin.MF", "46E30, 46N30, 91G70"], "primary_category": "q-fin.RM"}
{"title": "Bellwether Trades: Characteristics of Trades influential in Predicting Future Price Movements in Markets", "abstract": "In this study, we leverage powerful non-linear machine learning methods to\nidentify the characteristics of trades that contain valuable information.\nFirst, we demonstrate the effectiveness of our optimized neural network\npredictor in accurately predicting future market movements. Then, we utilize\nthe information from this successful neural network predictor to pinpoint the\nindividual trades within each data point (trading window) that had the most\nimpact on the optimized neural network's prediction of future price movements.\nThis approach helps us uncover important insights about the heterogeneity in\ninformation content provided by trades of different sizes, venues, trading\ncontexts, and over time.", "published": "2024-09-08 18:59:52", "link": "http://arxiv.org/abs/2409.05192v1", "categories": ["q-fin.TR", "cs.LG", "econ.EM", "stat.ML"], "primary_category": "q-fin.TR"}
