{"title": "Robust forward investment and consumption under drift and volatility uncertainties: A randomization approach", "abstract": "This paper studies robust forward investment and consumption preferences and\noptimal strategies for a risk-averse and ambiguity-averse agent in an\nincomplete financial market with drift and volatility uncertainties. We focus\non non-zero volatility and constant relative risk aversion (CRRA) forward\npreferences. Given the non-convexity of the Hamiltonian with respect to\nuncertain volatilities, we first construct robust randomized forward\npreferences through endogenous randomization in an auxiliary market. We derive\nthe corresponding optimal and robust investment and consumption strategies.\nFurthermore, we show that such forward preferences and strategies, developed in\nthe auxiliary market, remain optimal and robust in the physical market,\noffering a comprehensive framework for forward investment and consumption under\nmodel uncertainty.", "published": "2024-10-02 09:48:28", "link": "http://arxiv.org/abs/2410.01378v1", "categories": ["q-fin.PM", "q-fin.MF", "60H30, 91G10"], "primary_category": "q-fin.PM"}
{"title": "Distilling Analysis from Generative Models for Investment Decisions", "abstract": "Professionals' decisions are the focus of every field. For example,\npoliticians' decisions will influence the future of the country, and stock\nanalysts' decisions will impact the market. Recognizing the influential role of\nprofessionals' perspectives, inclinations, and actions in shaping\ndecision-making processes and future trends across multiple fields, we propose\nthree tasks for modeling these decisions in the financial market. To facilitate\nthis, we introduce a novel dataset, A3, designed to simulate professionals'\ndecision-making processes. While we find current models present challenges in\nforecasting professionals' behaviors, particularly in making trading decisions,\nthe proposed Chain-of-Decision approach demonstrates promising improvements. It\nintegrates an opinion-generator-in-the-loop to provide subjective analysis\nbased on each news item, further enhancing the proposed tasks' performance.", "published": "2024-10-02 01:39:42", "link": "http://arxiv.org/abs/2410.07225v1", "categories": ["q-fin.ST", "cs.CL", "cs.LG"], "primary_category": "q-fin.ST"}
{"title": "Mean field equilibrium asset pricing model under partial observation: An exponential quadratic Gaussian approach", "abstract": "This paper studies an asset pricing model in a partially observable market\nwith a large number of heterogeneous agents using the mean field game theory.\nIn this model, we assume that investors can only observe stock prices and must\ninfer the risk premium from these observations when determining trading\nstrategies. We characterize the equilibrium risk premium in such a market\nthrough a solution to the mean field backward stochastic differential equation\n(BSDE). Specifically, the solution to the mean field BSDE can be expressed\nsemi-analytically by employing an exponential quadratic Gaussian framework. We\nthen construct the risk premium process, which cannot be observed directly by\ninvestors, endogenously using the Kalman-Bucy filtering theory. In addition, we\ninclude a simple numerical simulation to visualize the dynamics of our market\nmodel.", "published": "2024-10-02 09:09:34", "link": "http://arxiv.org/abs/2410.01352v2", "categories": ["q-fin.PR", "q-fin.TR", "49N80, 91B51, 60H10"], "primary_category": "q-fin.PR"}
