{"title": "Optimal Execution under Incomplete Information", "abstract": "We study optimal liquidation strategies under partial information for a\nsingle asset within a finite time horizon. We propose a model tailored for\nhigh-frequency trading, capturing price formation driven solely by order flow\nthrough mutually stimulating marked Hawkes processes. The model assumes a limit\norder book framework, accounting for both permanent price impact and transient\nmarket impact. Importantly, we incorporate liquidity as a hidden Markov\nprocess, influencing the intensities of the point processes governing bid and\nask prices. Within this setting, we formulate the optimal liquidation problem\nas an impulse control problem. We elucidate the dynamics of the hidden Markov\nchain's filter and determine the related normalized filtering equations. We\nthen express the value function as the limit of a sequence of auxiliary\ncontinuous functions, defined recursively. This characterization enables the\nuse of a dynamic programming principle for optimal stopping problems and the\ndetermination of an optimal strategy. It also facilitates the development of an\nimplementable algorithm to approximate the original liquidation problem. We\nenrich our analysis with numerical results and visualizations of candidate\noptimal strategies.", "published": "2024-11-07 10:57:32", "link": "http://arxiv.org/abs/2411.04616v1", "categories": ["q-fin.MF", "q-fin.TR"], "primary_category": "q-fin.MF"}
{"title": "The Role of AI in Financial Forecasting: ChatGPT's Potential and Challenges", "abstract": "The outlook for the future of artificial intelligence (AI) in the financial\nsector, especially in financial forecasting, the challenges and implications.\nThe dynamics of AI technology, including deep learning, reinforcement learning,\nand integration with blockchAIn and the Internet of Things, also highlight the\ncontinued improvement in data processing capabilities. Explore how AI is\nreshaping financial services with precisely tAIlored services that can more\nprecisely meet the diverse needs of individual investors. The integration of AI\nchallenges regulatory and ethical issues in the financial sector, as well as\nthe implications for data privacy protection. Analyze the limitations of\ncurrent AI technology in financial forecasting and its potential impact on the\nfuture financial industry landscape, including changes in the job market, the\nemergence of new financial institutions, and user interface innovations.\nEmphasizing the importance of increasing investor understanding and awareness\nof AI and looking ahead to future trends in AI tools for user experience to\ndrive wider adoption of AI in financial decision making. The huge potential,\nchallenges, and future directions of AI in the financial sector highlight the\ncritical role of AI technology in driving transformation and innovation in the\nfinancial sector", "published": "2024-11-07 15:35:16", "link": "http://arxiv.org/abs/2411.13562v1", "categories": ["q-fin.ST", "cs.AI", "cs.CY"], "primary_category": "q-fin.ST"}
{"title": "Enhancing Investment Analysis: Optimizing AI-Agent Collaboration in Financial Research", "abstract": "In recent years, the application of generative artificial intelligence\n(GenAI) in financial analysis and investment decision-making has gained\nsignificant attention. However, most existing approaches rely on single-agent\nsystems, which fail to fully utilize the collaborative potential of multiple AI\nagents. In this paper, we propose a novel multi-agent collaboration system\ndesigned to enhance decision-making in financial investment research. The\nsystem incorporates agent groups with both configurable group sizes and\ncollaboration structures to leverage the strengths of each agent group type. By\nutilizing a sub-optimal combination strategy, the system dynamically adapts to\nvarying market conditions and investment scenarios, optimizing performance\nacross different tasks. We focus on three sub-tasks: fundamentals, market\nsentiment, and risk analysis, by analyzing the 2023 SEC 10-K forms of 30\ncompanies listed on the Dow Jones Index. Our findings reveal significant\nperformance variations based on the configurations of AI agents for different\ntasks. The results demonstrate that our multi-agent collaboration system\noutperforms traditional single-agent models, offering improved accuracy,\nefficiency, and adaptability in complex financial environments. This study\nhighlights the potential of multi-agent systems in transforming financial\nanalysis and investment decision-making by integrating diverse analytical\nperspectives.", "published": "2024-11-07 15:28:20", "link": "http://arxiv.org/abs/2411.04788v1", "categories": ["cs.AI", "cs.CL", "cs.LG", "q-fin.ST", "q-fin.TR"], "primary_category": "cs.AI"}
