{"title": "Automated Market Making: the case of Pegged Assets", "abstract": "In this paper, we introduce a novel framework to model the exchange rate\ndynamics between two intrinsically linked cryptoassets, such as stablecoins\npegged to the same fiat currency or a liquid staking token and its associated\nnative token. Our approach employs multi-level nested Ornstein-Uhlenbeck (OU)\nprocesses, for which we derive key properties and develop calibration and\nfiltering techniques. Then, we design an automated market maker (AMM) model\nspecifically tailored for the swapping of closely related cryptoassets.\nDistinct from existing models, our AMM leverages the unique exchange rate\ndynamics provided by the multi-level nested OU processes, enabling more precise\nrisk management and enhanced liquidity provision. We validate the model through\nnumerical simulations using real-world data for the USDC/USDT and wstETH/WETH\npairs, demonstrating that it consistently yields efficient quotes. This\napproach offers significant potential to improve liquidity in markets for\npegged assets.", "published": "2024-11-12 19:47:47", "link": "http://arxiv.org/abs/2411.08145v1", "categories": ["q-fin.TR", "q-fin.CP"], "primary_category": "q-fin.TR"}
{"title": "Implementing Dynamic Pricing Across Multiple Pricing Groups in Real Estate", "abstract": "This article presents a mathematical model of dynamic pricing for real estate\n(RE) that incorporates multiple pricing groups, thereby expanding the\ncapabilities of existing models. The developed model solves the problem of\nmaximizing aggregate cumulative revenue at the end of the sales period while\nmeeting the revenue and sales goals. A method is proposed for distributing\naggregate cumulative revenue goals across different RE pricing groups. The\nmodel is further modified to account for the time value of money and the real\nestate value increase as construction progresses. The algorithm for\nconstructing a pricing policy for multiple pricing groups is described, and\nnumerical simulations are performed to demonstrate how the algorithm operates.", "published": "2024-11-12 11:45:17", "link": "http://arxiv.org/abs/2411.07732v1", "categories": ["q-fin.MF", "econ.TH", "q-fin.CP", "q-fin.TR"], "primary_category": "q-fin.MF"}
{"title": "Reinforcement Learning Framework for Quantitative Trading", "abstract": "The inherent volatility and dynamic fluctuations within the financial stock\nmarket underscore the necessity for investors to employ a comprehensive and\nreliable approach that integrates risk management strategies, market trends,\nand the movement trends of individual securities. By evaluating specific data,\ninvestors can make more informed decisions. However, the current body of\nliterature lacks substantial evidence supporting the practical efficacy of\nreinforcement learning (RL) agents, as many models have only demonstrated\nsuccess in back testing using historical data. This highlights the urgent need\nfor a more advanced methodology capable of addressing these challenges. There\nis a significant disconnect in the effective utilization of financial\nindicators to better understand the potential market trends of individual\nsecurities. The disclosure of successful trading strategies is often restricted\nwithin financial markets, resulting in a scarcity of widely documented and\npublished strategies leveraging RL. Furthermore, current research frequently\noverlooks the identification of financial indicators correlated with various\nmarket trends and their potential advantages.\n  This research endeavors to address these complexities by enhancing the\nability of RL agents to effectively differentiate between positive and negative\nbuy/sell actions using financial indicators. While we do not address all\nconcerns, this paper provides deeper insights and commentary on the utilization\nof technical indicators and their benefits within reinforcement learning. This\nwork establishes a foundational framework for further exploration and\ninvestigation of more complex scenarios.", "published": "2024-11-12 06:44:28", "link": "http://arxiv.org/abs/2411.07585v1", "categories": ["q-fin.TR", "cs.AI", "q-fin.CP"], "primary_category": "q-fin.TR"}
{"title": "New approaches of the DCC-GARCH residual: Application to foreign exchange rates", "abstract": "Two formulations are proposed to filter out correlations in the residuals of\nthe multivariate GARCH model. The first approach is to estimate the correlation\nmatrix as a parameter and transform any joint distribution to have an arbitrary\ncorrelation matrix. The second approach transforms time series data into an\nuncorrelated residual based on the eigenvalue decomposition of a correlation\nmatrix. The empirical performance of these methods is examined through a\nprediction task for foreign exchange rates and compared with other\nmethodologies in terms of the out-of-sample likelihood. By using these\napproaches, the DCC-GARCH residual can be almost independent.", "published": "2024-11-12 23:50:13", "link": "http://arxiv.org/abs/2411.08246v1", "categories": ["q-fin.ST"], "primary_category": "q-fin.ST"}
