{"title": "Optimal payoff under Bregman-Wasserstein divergence constraints", "abstract": "We study optimal payoff choice for an expected utility maximizer under the\nconstraint that their payoff is not allowed to deviate ``too much'' from a\ngiven benchmark. We solve this problem when the deviation is assessed via a\nBregman-Wasserstein (BW) divergence, generated by a convex function $\\phi$.\nUnlike the Wasserstein distance (i.e., when $\\phi(x)=x^2$). The inherent\nasymmetry of the BW divergence makes it possible to penalize positive\ndeviations different than negative ones. As a main contribution, we provide the\noptimal payoff in this setting. Numerical examples illustrate that the choice\nof $\\phi$ allow to better align the payoff choice with the objectives of\ninvestors.", "published": "2024-11-27 14:40:20", "link": "http://arxiv.org/abs/2411.18397v1", "categories": ["q-fin.PM", "q-fin.MF", "q-fin.RM"], "primary_category": "q-fin.PM"}
{"title": "Semiclassical CEV Option Pricing Model: an Analytical Approach", "abstract": "This paper is devoted to obtain closed form solutions for the semiclassical\n(or WKB) approximation of the heat kernel propagator of the diffusion equation\ndefined by the constant elasticity variance (CEV) option pricing model. One of\nthe key points is that our calculations are based on the Van Vleck-Morette\ndeterminant instead of the Van Vleck determinant used by other authors. In\nfact, we compute this determinant in two different ways: by means of the\nsolution of the classical Hamiltonian equations, and by solving the variational\nequations. Furthermore, the calculation reveals an exponential factor in the\nprefactor of the kernel not considered in previous works.", "published": "2024-11-27 09:02:25", "link": "http://arxiv.org/abs/2411.18154v3", "categories": ["q-fin.MF"], "primary_category": "q-fin.MF"}
{"title": "Limit Order Book Event Stream Prediction with Diffusion Model", "abstract": "Limit order book (LOB) is a dynamic, event-driven system that records\nreal-time market demand and supply for a financial asset in a stream flow.\nEvent stream prediction in LOB refers to forecasting both the timing and the\ntype of events. The challenge lies in modeling the time-event distribution to\ncapture the interdependence between time and event type, which has\ntraditionally relied on stochastic point processes. However, modeling complex\nmarket dynamics using stochastic processes, e.g., Hawke stochastic process, can\nbe simplistic and struggle to capture the evolution of market dynamics. In this\nstudy, we present LOBDIF (LOB event stream prediction with diffusion model),\nwhich offers a new paradigm for event stream prediction within the LOB system.\nLOBDIF learns the complex time-event distribution by leveraging a diffusion\nmodel, which decomposes the time-event distribution into sequential steps, with\neach step represented by a Gaussian distribution. Additionally, we propose a\ndenoising network and a skip-step sampling strategy. The former facilitates\neffective learning of time-event interdependence, while the latter accelerates\nthe sampling process during inference. By introducing a diffusion model, our\napproach breaks away from traditional modeling paradigms, offering novel\ninsights and providing an effective and efficient solution for learning the\ntime-event distribution in order streams within the LOB system. Extensive\nexperiments using real-world data from the limit order books of three widely\ntraded assets confirm that LOBDIF significantly outperforms current\nstate-of-the-art methods.", "published": "2024-11-27 19:52:43", "link": "http://arxiv.org/abs/2412.09631v1", "categories": ["q-fin.ST"], "primary_category": "q-fin.ST"}
