{"title": "Continuous Risk Factor Models: Analyzing Asset Correlations through Energy Distance", "abstract": "This paper introduces a novel approach to financial risk analysis that does\nnot rely on traditional price and market data, instead using market news to\nmodel assets as distributions over a metric space of risk factors. By\nrepresenting asset returns as integrals over the scalar field of these risk\nfactors, we derive the covariance structure between asset returns. Utilizing\nencoder-only language models to embed this news data, we explore the\nrelationships between asset return distributions through the concept of Energy\nDistance, establishing connections between distributional differences and\nexcess returns co-movements. This data-agnostic approach provides new insights\ninto portfolio diversification, risk management, and the construction of\nhedging strategies. Our findings have significant implications for both\ntheoretical finance and practical risk management, offering a more robust\nframework for modelling complex financial systems without depending on\nconventional market data.", "published": "2024-10-30 20:39:32", "link": "http://arxiv.org/abs/2410.23447v1", "categories": ["q-fin.CP"], "primary_category": "q-fin.CP"}
{"title": "AI in Investment Analysis: LLMs for Equity Stock Ratings", "abstract": "Investment Analysis is a cornerstone of the Financial Services industry. The\nrapid integration of advanced machine learning techniques, particularly Large\nLanguage Models (LLMs), offers opportunities to enhance the equity rating\nprocess. This paper explores the application of LLMs to generate multi-horizon\nstock ratings by ingesting diverse datasets. Traditional stock rating methods\nrely heavily on the expertise of financial analysts, and face several\nchallenges such as data overload, inconsistencies in filings, and delayed\nreactions to market events. Our study addresses these issues by leveraging LLMs\nto improve the accuracy and consistency of stock ratings. Additionally, we\nassess the efficacy of using different data modalities with LLMs for the\nfinancial domain.\n  We utilize varied datasets comprising fundamental financial, market, and news\ndata from January 2022 to June 2024, along with GPT-4-32k (v0613) (with a\ntraining cutoff in Sep. 2021 to prevent information leakage). Our results show\nthat our benchmark method outperforms traditional stock rating methods when\nassessed by forward returns, specially when incorporating financial\nfundamentals. While integrating news data improves short-term performance,\nsubstituting detailed news summaries with sentiment scores reduces token use\nwithout loss of performance. In many cases, omitting news data entirely\nenhances performance by reducing bias.\n  Our research shows that LLMs can be leveraged to effectively utilize large\namounts of multimodal financial data, as showcased by their effectiveness at\nthe stock rating prediction task. Our work provides a reproducible and\nefficient framework for generating accurate stock ratings, serving as a\ncost-effective alternative to traditional methods. Future work will extend to\nlonger timeframes, incorporate diverse data, and utilize newer models for\nenhanced insights.", "published": "2024-10-30 15:06:57", "link": "http://arxiv.org/abs/2411.00856v1", "categories": ["cs.LG", "cs.AI", "q-fin.CP", "68T50, 91G60 (Primary) 68T07 (Secondary)", "I.2.7"], "primary_category": "cs.LG"}
{"title": "Emerging countries' counter-currency cycles in the face of crises and dominant currencies", "abstract": "This article examines how emerging economies use countercyclical monetary\npolicies to manage economic crises and fluctuations in dominant currencies,\nsuch as the US dollar and the euro. Global economic cycles are marked by phases\nof expansion and recession, often exacerbated by major financial crises. These\ncrises, such as those of 1997, 2008 and the disruption caused by the COVID-19\npandemic, have a particular impact on emerging economies due to their\nheightened vulnerability to foreign capital flows and exports.Counter-cyclical\nmonetary policies, including interest rate adjustments, foreign exchange\ninterventions and capital controls, are essential to stabilize these economies.\nThese measures aim to mitigate the effects of economic shocks, maintain price\nstability and promote sustainable growth. This article presents a theoretical\nanalysis of economic cycles and financial crises, highlighting the role of\ndominant currencies in global economic stability. Currencies such as the dollar\nand the euro strongly influence emerging economies, notably through exchange\nrate variations and international capital movements. Analysis of the monetary\nstrategies of emerging economies, through case studies of Brazil, India and\nNigeria, reveals how these countries use tools such as interest rates, foreign\nexchange interventions and capital controls to manage the impacts of crises and\nfluctuations in dominant currencies. The article also highlights the challenges\nand limitations faced by these countries, including structural and\ninstitutional constraints and the reactions of international financial\nmarkets.Finally, an econometric analysis using a Vector AutoRegression (VAR)\nmodel illustrates the impact of monetary policies on key economic variables,\nsuch as GDP, interest rates, inflation and exchange rates. The results show\nthat emerging economies, although sensitive to external shocks, can adjust\ntheir policies to stabilize economic growth in the medium and long term.", "published": "2024-10-30 13:29:48", "link": "http://arxiv.org/abs/2410.23002v1", "categories": ["q-fin.CP"], "primary_category": "q-fin.CP"}
{"title": "Rebalancing-versus-Rebalancing: Improving the fidelity of Loss-versus-Rebalancing", "abstract": "Automated Market Makers (AMMs) hold assets and are constantly being\nrebalanced by external arbitrageurs to match external market prices.\nLoss-versus-rebalancing (LVR) is a pivotal metric for measuring how an AMM pool\nperforms for its liquidity providers (LPs) relative to an idealised benchmark\nwhere rebalancing is done not via the action of arbitrageurs but instead by\ntrading with a perfect centralised exchange with no fees, spread or slippage.\nThis renders it an imperfect tool for judging rebalancing efficiency between\nexecution platforms.\n  We introduce Rebalancing-versus-rebalancing (RVR), a higher-fidelity model\nthat better captures the frictions present in centralised rebalancing.\n  We perform a battery of experiments comparing managing a portfolio on AMMs vs\nthis new and more realistic centralised exchange benchmark-RVR. We are also\nparticularly interested in dynamic AMMs that run strategies beyond fixed weight\nallocations-Temporal Function Market Makers. This is particularly important for\nasset managers evaluating execution management systems. In this paper we\nsimulate more than 1000 different strategies settings as well as testing\nhundreds of different variations in centralised exchange (CEX) fees, AMM fees &\ngas costs.\n  We find that, under this modeling approach, AMM pools (even with no\nretail/noise traders) often offer superior execution and rebalancing efficiency\ncompared to centralised rebalancing, for all but the lowest CEX fee levels. We\nalso take a simple approach to model noise traders & find that even a small\namount of noise volume increases modeled AMM performance such that CEX\nrebalancing finds it hard to compete. This indicates that decentralised\nAMM-based asset management can offer superior performance and execution\nmanagement for asset managers looking to rebalance portfolios, offering an\nalternative use case for dynamic AMMs beyond core liquidity providing.", "published": "2024-10-30 19:14:59", "link": "http://arxiv.org/abs/2410.23404v1", "categories": ["q-fin.TR"], "primary_category": "q-fin.TR"}
