{"title": "Rough differential equations for volatility", "abstract": "We introduce a canonical way of performing the joint lift of a Brownian\nmotion $W$ and a low-regularity adapted stochastic rough path $\\mathbf{X}$,\nextending [Diehl, Oberhauser and Riedel (2015). A L\\'evy area between Brownian\nmotion and rough paths with applications to robust nonlinear filtering and\nrough partial differential equations]. Applying this construction to the case\nwhere $\\mathbf{X}$ is the canonical lift of a one-dimensional fractional\nBrownian motion (possibly correlated with $W$) completes the partial rough path\nof [Fukasawa and Takano (2024). A partial rough path space for rough\nvolatility]. We use this to model rough volatility with the versatile toolkit\nof rough differential equations (RDEs), namely by taking the price and\nvolatility processes to be the solution to a single RDE. We argue that our\nframework is already interesting when $W$ and $X$ are independent, as\ncorrelation between the price and volatility can be introduced in the dynamics.\nThe lead-lag scheme of [Flint, Hambly, and Lyons (2016). Discretely sampled\nsignals and the rough Hoff process] is extended to our fractional setting as an\napproximation theory for the rough path in the correlated case. Continuity of\nthe solution map transforms this into a numerical scheme for RDEs. We\nnumerically test this framework and use it to calibrate a simple new rough\nvolatility model to market data.", "published": "2024-12-30 18:57:29", "link": "http://arxiv.org/abs/2412.21192v1", "categories": ["q-fin.MF", "math.PR", "60L20, 60L90, 60G22, 65C30, 91G20, 91G60"], "primary_category": "q-fin.MF"}
{"title": "Strategic Learning and Trading in Broker-Mediated Markets", "abstract": "We study strategic interactions in a broker-mediated market. A broker\nprovides liquidity to an informed trader and to noise traders while managing\ninventory in the lit market. The broker and the informed trader maximise their\ntrading performance while filtering each other's private information; the\ntrader estimates the broker's trading activity in the lit market while the\nbroker estimates the informed trader's private signal. Brokers hold a strategic\nadvantage over traders who rely solely on prices to filter information. We find\nthat information leakage in the client's trading flow yields an economic value\nto the broker that is comparable to transaction costs; she speculates\nprofitably and mitigates risk effectively, which, in turn, adversely impacts\nthe informed trader's performance. In contrast, low signal-to-noise sources,\nsuch as prices, result in the broker's trading performance being\nindistinguishable from that of a naive strategy that internalises noise flow,\nexternalises informed flow, and offloads inventory at a constant rate.", "published": "2024-12-30 10:34:44", "link": "http://arxiv.org/abs/2412.20847v1", "categories": ["q-fin.TR"], "primary_category": "q-fin.TR"}
