{"title": "Credit Spreads' Term Structure: Stochastic Modeling with CIR++ Intensity", "abstract": "This paper introduces a novel stochastic model for credit spreads. The\nstochastic approach leverages the diffusion of default intensities via a CIR++\nmodel and is formulated within a risk-neutral probability space. Our research\nprimarily addresses two gaps in the literature. The first is the lack of credit\nspread models founded on a stochastic basis that enables continuous modeling,\nas many existing models rely on factorial assumptions. The second is the\nlimited availability of models that directly yield a term structure of credit\nspreads. An intermediate result of our model is the provision of a term\nstructure for the prices of defaultable bonds. We present the model alongside\nan innovative, practical, and conservative calibration approach that minimizes\nthe error between historical and theoretical volatilities of default\nintensities. We demonstrate the robustness of both the model and its\ncalibration process by comparing its behavior to historical credit spread\nvalues. Our findings indicate that the model not only produces realistic credit\nspread term structure curves but also exhibits consistent diffusion over time.\nAdditionally, the model accurately fits the initial term structure of implied\nsurvival probabilities and provides an analytical expression for the credit\nspread of any given maturity at any future time.", "published": "2024-09-13 20:35:18", "link": "http://arxiv.org/abs/2409.09179v1", "categories": ["q-fin.RM", "q-fin.MF", "60H10, 60J60, 91G30, 91G40", "G.3"], "primary_category": "q-fin.RM"}
{"title": "Tuning into Climate Risks: Extracting Innovation from Television News for Clean Energy Firms", "abstract": "This article develops multiple novel climate risk measures (or variables)\nbased on the television news coverage by Bloomberg, CNBC, and Fox Business, and\nexamines how they affect the systematic and idiosyncratic risks of clean energy\nfirms in the United States. The measures are built on climate related keywords\nand cover the volume of coverage, type of coverage (climate crisis, renewable\nenergy, and government & human initiatives), and media sentiments. We show that\nan increase in the aggregate measure of climate risk, as indicated by coverage\nvolume, reduces idiosyncratic risk while increasing systematic risk. When\nclimate risk is segregated, we find that systematic risk is positively affected\nby the physical risk of climate crises and transition risk from government &\nhuman initiatives, but no such impact is evident for idiosyncratic risk.\nAdditionally, we observe an asymmetry in risk behavior: negative sentiments\ntend to decrease idiosyncratic risk and increase systematic risk, while\npositive sentiments have no significant impact. These findings remain robust to\nincluding print media and climate policy uncertainty variables, though some\ndeviations are noted during the COVID-19 period.", "published": "2024-09-13 10:41:38", "link": "http://arxiv.org/abs/2409.08701v3", "categories": ["q-fin.ST", "q-fin.CP"], "primary_category": "q-fin.ST"}
