{"title": "Long-term decomposition of robust pricing kernels under G-expectation", "abstract": "This study develops a BSDE method for the long-term decomposition of pricing\nkernels under the G-expectation framework. We establish the existence,\nuniqueness, and regularity of solutions to three types of quadratic G-BSDEs:\nfinite-horizon G-BSDEs, infinite-horizon G-BSDEs, and ergodic G-BSDEs.\nMoreover, we explore the Feynman--Kac formula associated with these three types\nof quadratic G-BSDEs. Using these results, a pricing kernel is uniquely\ndecomposed into four components: an exponential discounting component, a\ntransitory component, a symmetric G-martingale, and a decreasing component that\ncaptures the volatility uncertainty of the G-Brownian motion. Furthermore,\nthese components are represented through a solution to a PDE. This study\nextends previous findings obtained under a single fixed probability framework\nto the G-expectation context.", "published": "2024-08-31 19:46:40", "link": "http://arxiv.org/abs/2409.00535v1", "categories": ["q-fin.MF"], "primary_category": "q-fin.MF"}
{"title": "State-Space Dynamic Functional Regression for Multicurve Fixed Income Spread Analysis and Stress Testing", "abstract": "The Nelson-Siegel model is widely used in fixed income markets to produce\nyield curve dynamics. The multiple time-dependent parameter model conveniently\naddresses the level, slope, and curvature dynamics of the yield curves. In this\nstudy, we present a novel state-space functional regression model that\nincorporates a dynamic Nelson-Siegel model and functional regression\nformulations applied to multi-economy setting. This framework offers distinct\nadvantages in explaining the relative spreads in yields between a reference\neconomy and a response economy. To address the inherent challenges of model\ncalibration, a kernel principal component analysis is employed to transform the\nrepresentation of functional regression into a finite-dimensional, tractable\nestimation problem. A comprehensive empirical analysis is conducted to assess\nthe efficacy of the functional regression approach, including an in-sample\nperformance comparison with the dynamic Nelson-Siegel model. We conducted the\nstress testing analysis of yield curves term-structure within a dual economy\nframework. The bond ladder portfolio was examined through a case study focused\non spread modelling using historical data for US Treasury and UK bonds.", "published": "2024-08-31 04:30:05", "link": "http://arxiv.org/abs/2409.00348v2", "categories": ["q-fin.ST"], "primary_category": "q-fin.ST"}
