{"title": "Comparative Study of Long Short-Term Memory (LSTM) and Quantum Long Short-Term Memory (QLSTM): Prediction of Stock Market Movement", "abstract": "In recent years, financial analysts have been trying to develop models to\npredict the movement of a stock price index. The task becomes challenging in\nvague economic, social, and political situations like in Pakistan. In this\nstudy, we employed efficient models of machine learning such as long short-term\nmemory (LSTM) and quantum long short-term memory (QLSTM) to predict the Karachi\nStock Exchange (KSE) 100 index by taking monthly data of twenty-six economic,\nsocial, political, and administrative indicators from February 2004 to December\n2020. The comparative results of LSTM and QLSTM predicted values of the KSE 100\nindex with the actual values suggested QLSTM a potential technique to predict\nstock market trends.", "published": "2024-09-04 19:34:37", "link": "http://arxiv.org/abs/2409.08297v1", "categories": ["q-fin.ST", "cs.AI", "cs.LG", "quant-ph"], "primary_category": "q-fin.ST"}
{"title": "Predicting Foreign Exchange EUR/USD direction using machine learning", "abstract": "The Foreign Exchange market is a significant market for speculators,\ncharacterized by substantial transaction volumes and high volatility.\nAccurately predicting the directional movement of currency pairs is essential\nfor formulating a sound financial investment strategy. This paper conducts a\ncomparative analysis of various machine learning models for predicting the\ndaily directional movement of the EUR/USD currency pair in the Foreign Exchange\nmarket. The analysis includes both decorrelated and non-decorrelated feature\nsets using Principal Component Analysis. Additionally, this study explores\nmeta-estimators, which involve stacking multiple estimators as input for\nanother estimator, aiming to achieve improved predictive performance.\nUltimately, our approach yielded a prediction accuracy of 58.52% for one-day\nahead forecasts, coupled with an annual return of 32.48% for the year 2022.", "published": "2024-09-04 12:05:03", "link": "http://arxiv.org/abs/2409.04471v2", "categories": ["q-fin.ST"], "primary_category": "q-fin.ST"}
{"title": "Fitting an Equation to Data Impartially", "abstract": "We consider the problem of fitting a relationship (e.g. a potential\nscientific law) to data involving multiple variables. Ordinary (least squares)\nregression is not suitable for this because the estimated relationship will\ndiffer according to which variable is chosen as being dependent, and the\ndependent variable is unrealistically assumed to be the only variable which has\nany measurement error (noise). We present a very general method for estimating\na linear functional relationship between multiple noisy variables, which are\ntreated impartially, i.e. no distinction between dependent and independent\nvariables. The data are not assumed to follow any distribution, but all\nvariables are treated as being equally reliable. Our approach extends the\ngeometric mean functional relationship to multiple dimensions. This is\nespecially useful with variables measured in different units, as it is\nnaturally scale-invariant, whereas orthogonal regression is not. This is\nbecause our approach is not based on minimizing distances, but on the symmetric\nconcept of correlation. The estimated coefficients are easily obtained from the\ncovariances or correlations, and correspond to geometric means of associated\nleast squares coefficients. The ease of calculation will hopefully allow\nwidespread application of impartial fitting to estimate relationships in a\nneutral way.", "published": "2024-09-04 09:48:26", "link": "http://arxiv.org/abs/2409.02573v1", "categories": ["stat.ME", "econ.EM", "math.ST", "physics.data-an", "q-fin.ST", "stat.TH"], "primary_category": "stat.ME"}
{"title": "Fundamental properties of linear factor models", "abstract": "We study conditional linear factor models in the context of asset pricing\npanels. Our analysis focuses on conditional means and covariances to\ncharacterize the cross-sectional and inter-temporal properties of returns and\nfactors as well as their interrelationships. We also review the conditions\noutlined in Kozak and Nagel (2024) and show how the conditional mean-variance\nefficient portfolio of an unbalanced panel can be spanned by low-dimensional\nfactor portfolios, even without assuming invertibility of the conditional\ncovariance matrices. Our analysis provides a comprehensive foundation for the\nspecification and estimation of conditional linear factor models.", "published": "2024-09-04 08:29:45", "link": "http://arxiv.org/abs/2409.02521v3", "categories": ["q-fin.ST", "stat.AP", "62P20"], "primary_category": "q-fin.ST"}
{"title": "MarS: a Financial Market Simulation Engine Powered by Generative Foundation Model", "abstract": "Generative models aim to simulate realistic effects of various actions across\ndifferent contexts, from text generation to visual effects. Despite significant\nefforts to build real-world simulators, the application of generative models to\nvirtual worlds, like financial markets, remains under-explored. In financial\nmarkets, generative models can simulate complex market effects of participants\nwith various behaviors, enabling interaction under different market conditions,\nand training strategies without financial risk. This simulation relies on the\nfinest structured data in financial market like orders thus building the finest\nrealistic simulation. We propose Large Market Model (LMM), an order-level\ngenerative foundation model, for financial market simulation, akin to language\nmodeling in the digital world. Our financial Market Simulation engine (MarS),\npowered by LMM, addresses the domain-specific need for realistic, interactive\nand controllable order generation. Key observations include LMM's strong\nscalability across data size and model complexity, and MarS's robust and\npracticable realism in controlled generation with market impact. We showcase\nMarS as a forecast tool, detection system, analysis platform, and agent\ntraining environment, thus demonstrating MarS's \"paradigm shift\" potential for\na variety of financial applications. We release the code of MarS at\nhttps://github.com/microsoft/MarS/.", "published": "2024-09-04 08:16:22", "link": "http://arxiv.org/abs/2409.07486v2", "categories": ["q-fin.CP", "cs.AI", "cs.CE", "cs.LG", "q-fin.TR"], "primary_category": "q-fin.CP"}
