{"title": "Transfer learning for financial data predictions: a systematic review", "abstract": "Literature highlighted that financial time series data pose significant\nchallenges for accurate stock price prediction, because these data are\ncharacterized by noise and susceptibility to news; traditional statistical\nmethodologies made assumptions, such as linearity and normality, which are not\nsuitable for the non-linear nature of financial time series; on the other hand,\nmachine learning methodologies are able to capture non linear relationship in\nthe data. To date, neural network is considered the main machine learning tool\nfor the financial prices prediction. Transfer Learning, as a method aimed at\ntransferring knowledge from source tasks to target tasks, can represent a very\nuseful methodological tool for getting better financial prediction capability.\nCurrent reviews on the above body of knowledge are mainly focused on neural\nnetwork architectures, for financial prediction, with very little emphasis on\nthe transfer learning methodology; thus, this paper is aimed at going deeper on\nthis topic by developing a systematic review with respect to application of\nTransfer Learning for financial market predictions and to challenges/potential\nfuture directions of the transfer learning methodologies for stock market\npredictions.", "published": "2024-09-24 20:52:32", "link": "http://arxiv.org/abs/2409.17183v1", "categories": ["q-fin.TR", "cs.AI", "cs.LG", "q-fin.CP"], "primary_category": "q-fin.TR"}
{"title": "Predicting Distance matrix with large language models", "abstract": "Structural prediction has long been considered critical in RNA research,\nespecially following the success of AlphaFold2 in protein studies, which has\ndrawn significant attention to the field. While recent advances in machine\nlearning and data accumulation have effectively addressed many biological\ntasks, particularly in protein related research. RNA structure prediction\nremains a significant challenge due to data limitations. Obtaining RNA\nstructural data is difficult because traditional methods such as nuclear\nmagnetic resonance spectroscopy, Xray crystallography, and electron microscopy\nare expensive and time consuming. Although several RNA 3D structure prediction\nmethods have been proposed, their accuracy is still limited. Predicting RNA\nstructural information at another level, such as distance maps, remains highly\nvaluable. Distance maps provide a simplified representation of spatial\nconstraints between nucleotides, capturing essential relationships without\nrequiring a full 3D model. This intermediate level of structural information\ncan guide more accurate 3D modeling and is computationally less intensive,\nmaking it a useful tool for improving structural predictions. In this work, we\ndemonstrate that using only primary sequence information, we can accurately\ninfer the distances between RNA bases by utilizing a large pretrained RNA\nlanguage model coupled with a well trained downstream transformer.", "published": "2024-09-24 10:28:55", "link": "http://arxiv.org/abs/2409.16333v1", "categories": ["q-bio.BM", "cs.CV", "cs.LG", "q-fin.CP"], "primary_category": "q-bio.BM"}
