{"title": "Deep Learning Methods for S Shaped Utility Maximisation with a Random Reference Point", "abstract": "We consider the portfolio optimisation problem where the terminal function is\nan S-shaped utility applied at the difference between the wealth and a random\nbenchmark process. We develop several numerical methods for solving the problem\nusing deep learning and duality methods. We use deep learning methods to solve\nthe associated Hamilton-Jacobi-Bellman equation for both the primal and dual\nproblems, and the adjoint equation arising from the stochastic maximum\nprinciple. We compare the solution of this non-concave problem to that of\nconcavified utility, a random function depending on the benchmark, in both\ncomplete and incomplete markets. We give some numerical results for power and\nlog utilities to show the accuracy of the suggested algorithms.", "published": "2024-10-07 22:07:59", "link": "http://arxiv.org/abs/2410.05524v1", "categories": ["q-fin.CP", "math.OC", "stat.ML"], "primary_category": "q-fin.CP"}
{"title": "Temporal Relational Reasoning of Large Language Models for Detecting Stock Portfolio Crashes", "abstract": "Stock portfolios are often exposed to rare consequential events (e.g., 2007\nglobal financial crisis, 2020 COVID-19 stock market crash), as they do not have\nenough historical information to learn from. Large Language Models (LLMs) now\npresent a possible tool to tackle this problem, as they can generalize across\ntheir large corpus of training data and perform zero-shot reasoning on new\nevents, allowing them to detect possible portfolio crash events without\nrequiring specific training data. However, detecting portfolio crashes is a\ncomplex problem that requires more than basic reasoning abilities. Investors\nneed to dynamically process the impact of each new information found in the\nnews articles, analyze the the relational network of impacts across news events\nand portfolio stocks, as well as understand the temporal context between\nimpacts across time-steps, in order to obtain the overall aggregated effect on\nthe target portfolio. In this work, we propose an algorithmic framework named\nTemporal Relational Reasoning (TRR). It seeks to emulate the spectrum of human\ncognitive capabilities used for complex problem-solving, which include\nbrainstorming, memory, attention and reasoning. Through extensive experiments,\nwe show that TRR is able to outperform state-of-the-art solutions on detecting\nstock portfolio crashes, and demonstrate how each of the proposed components\nhelp to contribute to its performance through an ablation study. Additionally,\nwe further explore the possible applications of TRR by extending it to other\nrelated complex problems, such as the detection of possible global crisis\nevents in Macroeconomics.", "published": "2024-10-07 11:15:52", "link": "http://arxiv.org/abs/2410.17266v1", "categories": ["q-fin.RM", "cs.AI", "cs.CL", "cs.LG", "q-fin.CP"], "primary_category": "q-fin.RM"}
{"title": "Numerical analysis of American option pricing in a two-asset jump-diffusion model", "abstract": "This paper addresses a significant gap in rigorous numerical treatments for\npricing American options under correlated two-asset jump-diffusion models using\nthe viscosity solution approach, with a particular focus on the Merton model.\nThe pricing of these options is governed by complex two-dimensional (2-D)\nvariational inequalities that incorporate cross-derivative terms and nonlocal\nintegro-differential terms due to the presence of jumps. Existing numerical\nmethods, primarily based on finite differences, often struggle with preserving\nmonotonicity in the approximation of cross-derivatives-a key requirement for\nensuring convergence to the viscosity solution. In addition, these methods face\nchallenges in accurately discretizing 2-D jump integrals.\n  We introduce a novel approach to effectively tackle the aforementioned\nvariational inequalities, seamlessly managing cross-derivative terms and\nnonlocal integro-differential terms through an efficient and\nstraightforward-to-implement monotone integration scheme. Within each timestep,\nour approach explicitly tackles the variational inequality constraint,\nresulting in a 2-D Partial Integro-Differential Equation (PIDE) to solve. Its\nsolution is then expressed as a 2-D convolution integral involving the Green's\nfunction of the PIDE. We derive an infinite series representation of this\nGreen's function, where each term is strictly positive and computable. This\nseries facilitates the numerical approximation of the PIDE solution through a\nmonotone integration method, such as the composite quadrature rule.\n  The proposed method is demonstrated to be both $\\ell_{\\infty} $-stable and\nconsistent in the viscosity sense, ensuring its convergence to the viscosity\nsolution of the variational inequality. Extensive numerical results validate\nthe effectiveness and robustness of our approach, highlighting its practical\napplicability and theoretical soundness.", "published": "2024-10-07 04:29:46", "link": "http://arxiv.org/abs/2410.04745v2", "categories": ["q-fin.CP", "65R20, 91-08, 65D30, 65T50"], "primary_category": "q-fin.CP"}
{"title": "Hedging via Perpetual Derivatives: Trinomial Option Pricing and Implied Parameter Surface Analysis", "abstract": "We introduce a fairly general, recombining trinomial tree model in the\nnatural world. Market-completeness is ensured by considering a market\nconsisting of two risky assets, a riskless asset, and a European option. The\ntwo risky assets consist of a stock and a perpetual derivative of that stock.\nThe option has the stock and its derivative as its underlying. Using a\nreplicating portfolio, we develop prices for European options and generate the\nunique relationships between the risk-neutral and real-world parameters of the\nmodel. We discuss calibration of the model to empirical data in the cases in\nwhich the risky asset returns are treated as either arithmetic or logarithmic.\nFrom historical price and call option data for select large cap stocks, we\ndevelop implied parameter surfaces for the real-world parameters in the model.", "published": "2024-10-07 04:40:39", "link": "http://arxiv.org/abs/2410.04748v2", "categories": ["q-fin.MF", "q-fin.PR"], "primary_category": "q-fin.MF"}
{"title": "Functional Clustering of Discount Functions for Behavioral Investor Profiling", "abstract": "Classical finance models are based on the premise that investors act\nrationally and utilize all available information when making portfolio\ndecisions. However, these models often fail to capture the anomalies observed\nin intertemporal choices and decision-making under uncertainty, particularly\nwhen accounting for individual differences in preferences and consumption\npatterns. Such limitations hinder traditional finance theory's ability to\naddress key questions like: How do personal preferences shape investment\nchoices? What drives investor behaviour? And how do individuals select their\nportfolios? One prominent contribution is Pompian's model of four Behavioral\nInvestor Types (BITs), which links behavioural finance studies with Keirsey's\ntemperament theory, highlighting the role of personality in financial\ndecision-making. Yet, traditional parametric models struggle to capture how\nthese distinct temperaments influence intertemporal decisions, such as how\nindividuals evaluate trade-offs between present and future outcomes. To address\nthis gap, the present study employs Functional Data Analysis (FDA) to\nspecifically investigate temporal discounting behaviours revealing nuanced\npatterns in how different temperaments perceive and manage uncertainty over\ntime. Our findings show heterogeneity within each temperament, suggesting that\ninvestor profiles are far more diverse than previously thought. This refined\nclassification provides deeper insights into the role of temperament in shaping\nintertemporal financial decisions, offering practical implications for\nfinancial advisors to better tailor strategies to individual risk preferences\nand decision-making styles.", "published": "2024-10-07 12:30:37", "link": "http://arxiv.org/abs/2410.16307v1", "categories": ["q-fin.ST", "stat.AP", "stat.ME", "91G10, 91G80, 91B50, 62P20, 62H30, 91B06", "G.3; I.5.1; I.2.6; J.4; H.1.2"], "primary_category": "q-fin.ST"}
{"title": "Optimal execution with deterministically time varying liquidity: well posedness and price manipulation", "abstract": "We investigate the well-posedness in the Hadamard sense and the absence of\nprice manipulation in the optimal execution problem within the Almgren-Chriss\nframework, where the temporary and permanent impact parameters vary\ndeterministically over time. We present sufficient conditions for the existence\nof a unique solution and provide second-order conditions for the problem, with\na particular focus on scenarios where impact parameters change monotonically\nover time. Additionally, we establish conditions to prevent\ntransaction-triggered price manipulation in the optimal solution, i.e. the\noccurence of buying and selling in the same trading program. Our findings are\nsupported by numerical analyses that explore various regimes in simple\nparametric settings for the dynamics of impact parameters.", "published": "2024-10-07 09:33:30", "link": "http://arxiv.org/abs/2410.04867v1", "categories": ["math.OC", "q-fin.TR", "91G80"], "primary_category": "math.OC"}
