{"title": "Joint multifractality in the cross-correlations between grains \\& oilseeds indices and external uncertainties", "abstract": "This study investigates the relationships between agricultural spot markets\nand external uncertainties via the multifractal detrending moving-average\ncross-correlation analysis (MF-X-DMA). The dataset contains the Grains \\&\nOilseeds Index (GOI) and its five sub-indices of wheat, maize, soyabeans, rice,\nand barley. Moreover, we use three uncertainty proxies, namely, economic policy\nuncertainty (EPU), geopolitical risk (GPR), and volatility Index (VIX). We\nobserve the presence of multifractal cross-correlations between agricultural\nmarkets and uncertainties. Further, statistical tests show that maize has\nintrinsic joint multifractality with all the uncertainty proxies, exhibiting a\nhigh degree of sensitivity. Additionally, intrinsic multifractality among\nGOI-GPR, wheat-GPR and soyabeans-VIX is illustrated. However, other series have\napparent multifractal cross-correlations with high possibilities. Moreover, our\nanalysis suggests that among the three kinds of external uncertainties,\ngeopolitical risk has a relatively stronger association with grain prices.", "published": "2024-09-18 14:27:26", "link": "http://arxiv.org/abs/2410.02798v1", "categories": ["q-fin.ST"], "primary_category": "q-fin.ST"}
{"title": "How does liquidity shape the yield curve?", "abstract": "The phenomenology of the forward rate curve (FRC) can be accurately\nunderstood by the fluctuations of a stiff elastic string (Le Coz and Bouchaud,\n2024). By relating the exogenous shocks driving such fluctuations to the\nsurprises in the order flows, we elevate the model from purely describing price\nvariations to a microstructural model that incorporates the joint dynamics of\nprices and order flows, accounting for both impact and cross-impact effects.\nRemarkably, this framework allows for at least the same explanatory power as\nexisting cross-impact models, while using significantly fewer parameters. In\naddition, our model generates liquidity-dependent correlations between the\nforward rate of one tenor and the order flow of another, consistent with recent\nempirical findings. We show that the model also account for the non-martingale\nbehavior of prices at short timescales.", "published": "2024-09-18 19:33:02", "link": "http://arxiv.org/abs/2409.12282v2", "categories": ["q-fin.TR", "cond-mat.stat-mech"], "primary_category": "q-fin.TR"}
