{"title": "Can an unsupervised clustering algorithm reproduce a categorization system?", "abstract": "Peer analysis is a critical component of investment management, often relying\non expert-provided categorization systems. These systems' consistency is\nquestioned when they do not align with cohorts from unsupervised clustering\nalgorithms optimized for various metrics. We investigate whether unsupervised\nclustering can reproduce ground truth classes in a labeled dataset, showing\nthat success depends on feature selection and the chosen distance metric. Using\ntoy datasets and fund categorization as real-world examples we demonstrate that\naccurately reproducing ground truth classes is challenging. We also highlight\nthe limitations of standard clustering evaluation metrics in identifying the\noptimal number of clusters relative to the ground truth classes. We then show\nthat if appropriate features are available in the dataset, and a proper\ndistance metric is known (e.g., using a supervised Random Forest-based distance\nmetric learning method), then an unsupervised clustering can indeed reproduce\nthe ground truth classes as distinct clusters.", "published": "2024-08-19 18:27:14", "link": "http://arxiv.org/abs/2408.10340v1", "categories": ["stat.ML", "cs.LG", "q-fin.ST", "stat.AP"], "primary_category": "stat.ML"}
{"title": "Combining supervised and unsupervised learning methods to predict financial market movements", "abstract": "The decisions traders make to buy or sell an asset depend on various\nanalyses, with expertise required to identify patterns that can be exploited\nfor profit. In this paper we identify novel features extracted from emergent\nand well-established financial markets using linear models and Gaussian Mixture\nModels (GMM) with the aim of finding profitable opportunities. We used\napproximately six months of data consisting of minute candles from the Bitcoin,\nPepecoin, and Nasdaq markets to derive and compare the proposed novel features\nwith commonly used ones. These features were extracted based on the previous 59\nminutes for each market and used to identify predictions for the hour ahead. We\nexplored the performance of various machine learning strategies, such as Random\nForests (RF) and K-Nearest Neighbours (KNN) to classify market movements. A\nnaive random approach to selecting trading decisions was used as a benchmark,\nwith outcomes assumed to be equally likely. We used a temporal cross-validation\napproach using test sets of 40%, 30% and 20% of total hours to evaluate the\nlearning algorithms' performances. Our results showed that filtering the time\nseries facilitates algorithms' generalisation. The GMM filtering approach\nrevealed that the KNN and RF algorithms produced higher average returns than\nthe random algorithm.", "published": "2024-08-19 13:17:36", "link": "http://arxiv.org/abs/2409.03762v1", "categories": ["q-fin.ST", "cs.LG"], "primary_category": "q-fin.ST"}
{"title": "High-Frequency Trading Liquidity Analysis | Application of Machine Learning Classification", "abstract": "This research presents a comprehensive framework for analyzing liquidity in\nfinancial markets, particularly in the context of high-frequency trading. By\nleveraging advanced machine learning classification techniques, including\nLogistic Regression, Support Vector Machine, and Random Forest, the study aims\nto predict minute-level price movements using an extensive set of liquidity\nmetrics derived from the Trade and Quote (TAQ) data. The findings reveal that\nemploying a broad spectrum of liquidity measures yields higher predictive\naccuracy compared to models utilizing a reduced subset of features. Key\nliquidity metrics, such as Liquidity Ratio, Flow Ratio, and Turnover,\nconsistently emerged as significant predictors across all models, with the\nRandom Forest algorithm demonstrating superior accuracy. This study not only\nunderscores the critical role of liquidity in market stability and transaction\ncosts but also highlights the complexities involved in short-interval market\npredictions. The research suggests that a comprehensive set of liquidity\nmeasures is essential for accurate prediction, and proposes future work to\nvalidate these findings across different stock datasets to assess their\ngeneralizability.", "published": "2024-08-19 14:11:46", "link": "http://arxiv.org/abs/2408.10016v1", "categories": ["q-fin.TR"], "primary_category": "q-fin.TR"}
