{"title": "Can GANs Learn the Stylized Facts of Financial Time Series?", "abstract": "In the financial sector, a sophisticated financial time series simulator is\nessential for evaluating financial products and investment strategies.\nTraditional back-testing methods have mainly relied on historical data-driven\napproaches or mathematical model-driven approaches, such as various stochastic\nprocesses. However, in the current era of AI, data-driven approaches, where\nmodels learn the intrinsic characteristics of data directly, have emerged as\npromising techniques. Generative Adversarial Networks (GANs) have surfaced as\npromising generative models, capturing data distributions through adversarial\nlearning. Financial time series, characterized 'stylized facts' such as random\nwalks, mean-reverting patterns, unexpected jumps, and time-varying volatility,\npresent significant challenges for deep neural networks to learn their\nintrinsic characteristics. This study examines the ability of GANs to learn\ndiverse and complex temporal patterns (i.e., stylized facts) of both univariate\nand multivariate financial time series. Our extensive experiments revealed that\nGANs can capture various stylized facts of financial time series, but their\nperformance varies significantly depending on the choice of generator\narchitecture. This suggests that naively applying GANs might not effectively\ncapture the intricate characteristics inherent in financial time series,\nhighlighting the importance of carefully considering and validating the\nmodeling choices.", "published": "2024-10-13 14:20:56", "link": "http://arxiv.org/abs/2410.09850v1", "categories": ["q-fin.CP"], "primary_category": "q-fin.CP"}
{"title": "Backtesting Framework for Concentrated Liquidity Market Makers on Uniswap V3 Decentralized Exchange", "abstract": "Decentralized finance (DeFi) has revolutionized the financial landscape, with\nprotocols like Uniswap offering innovative automated market-making mechanisms.\nThis article explores the development of a backtesting framework specifically\ntailored for concentrated liquidity market makers (CLMM). The focus is on\nleveraging the liquidity distribution approximated using a parametric model, to\nestimate the rewards within liquidity pools.\n  The article details the design, implementation, and insights derived from\nthis novel approach to backtesting within the context of Uniswap V3. The\ndeveloped backtester was successfully utilized to assess reward levels across\nseveral pools using historical data from 2023 (pools Uniswap v3 for pairs of\naltcoins, stablecoins and USDC/ETH with different fee levels). Moreover, the\nerror in modeling the level of rewards for the period under review for each\npool was less than 1\\%. This demonstrated the effectiveness of the backtester\nin quantifying liquidity pool rewards and its potential in estimating LP's\nrevenues as part of the pool rewards, as focus of our next research.\n  The backtester serves as a tool to simulate trading strategies and liquidity\nprovision scenarios, providing a quantitative assessment of potential returns\nfor liquidity providers (LP). By incorporating statistical tools to mirror CLMM\npool liquidity dynamics, this framework can be further leveraged for strategy\nenhancement and risk evaluation for LPs operating within decentralized\nexchanges.", "published": "2024-10-13 19:56:11", "link": "http://arxiv.org/abs/2410.09983v1", "categories": ["q-fin.MF"], "primary_category": "q-fin.MF"}
{"title": "No arbitrage and the existence of ACLMMs in general diffusion models", "abstract": "In a seminal paper, F. Delbaen and W. Schachermayer proved that the classical\nNA (\"no arbitrage\") condition implies the existence of an \"absolutely\ncontinuous local martingale measure\" (ACLMM). It is known that in general the\nexistence of an ACLMM alone is not sufficient for NA. In this paper we\ninvestigate how close these notions are for single asset general diffusion\nmarket models. We show that NA is equivalent to the existence of an ACLMM plus\na mild regularity condition on the scale function and the absence of reflecting\nboundaries. For infinite time horizon scenarios, the regularity assumption and\nthe requirement on the boundaries can be dropped, showing equivalence between\nNA and the existence of an ACLMM. By means of counterexamples, we show that our\ncharacterization of NA for finite time horizons is sharp in the sense that\nneither the regularity condition on the scale function nor the absence of\nreflecting boundaries can be dropped.", "published": "2024-10-13 10:08:52", "link": "http://arxiv.org/abs/2410.09789v1", "categories": ["q-fin.MF", "math.PR", "60G44, 60H10, 60J60, 91B70, 91G15"], "primary_category": "q-fin.MF"}
{"title": "Achilles, Neural Network to Predict the Gold Vs US Dollar Integration with Trading Bot for Automatic Trading", "abstract": "Predicting the stock market is a big challenge for the machine learning\nworld. It is known how difficult it is to have accurate and consistent\npredictions with ML models. Some architectures are able to capture the movement\nof stocks but almost never are able to be launched to the production world. We\npresent Achilles, with a classical architecture of LSTM(Long Short Term Memory)\nneural network this model is able to predict the Gold vs USD commodity. With\nthe predictions minute-per-minute of this model we implemented a trading bot to\nrun during 23 days of testing excluding weekends. At the end of the testing\nperiod we generated $1623.52 in profit with the methodology used. The results\nof our method demonstrate Machine Learning can successfully be implemented to\npredict the Gold vs USD commodity.", "published": "2024-10-13 00:45:30", "link": "http://arxiv.org/abs/2410.21291v3", "categories": ["q-fin.ST", "cs.LG"], "primary_category": "q-fin.ST"}
