{"title": "A Hype-Adjusted Probability Measure for NLP Stock Return Forecasting", "abstract": "This article introduces a Hype-Adjusted Probability Measure in the context of\na new Natural Language Processing (NLP) approach for stock return and\nvolatility forecasting. A novel sentiment score equation is proposed to\nrepresent the impact of intraday news on forecasting next-period stock return\nand volatility for selected U.S. semiconductor tickers, a very vibrant industry\nsector. This work improves the forecast accuracy by addressing news bias,\nmemory, and weight, and incorporating shifts in sentiment direction. More\nimportantly, it extends the use of the remarkable tool of change of Probability\nMeasure developed in the finance of Asset Pricing to NLP forecasting by\nconstructing a Hype-Adjusted Probability Measure, obtained from a\nredistribution of the weights in the probability space, meant to correct for\nexcessive or insufficient news.", "published": "2024-12-10 15:23:31", "link": "http://arxiv.org/abs/2412.07587v6", "categories": ["q-fin.CP", "cs.LG"], "primary_category": "q-fin.CP"}
{"title": "A Consolidated Volatility Prediction with Back Propagation Neural Network and Genetic Algorithm", "abstract": "This paper provides a unique approach with AI algorithms to predict emerging\nstock markets volatility. Traditionally, stock volatility is derived from\nhistorical volatility,Monte Carlo simulation and implied volatility as well. In\nthis paper, the writer designs a consolidated model with back-propagation\nneural network and genetic algorithm to predict future volatility of emerging\nstock markets and found that the results are quite accurate with low errors.", "published": "2024-12-10 06:19:08", "link": "http://arxiv.org/abs/2412.07223v4", "categories": ["q-fin.CP", "cs.LG", "cs.NE"], "primary_category": "q-fin.CP"}
{"title": "A theory of passive market impact", "abstract": "While the market impact of aggressive orders has been extensively studied,\nthe impact of passive orders, those executed through limit orders, remains less\nunderstood. The goal of this paper is to investigate passive market impact by\ndeveloping a microstructure model connecting liquidity dynamics and price\nmoves. A key innovation of our approach is to replace the traditional\nassumption of constant information content for each trade by a function that\ndepends on the available volume in the limit order book. Within this framework,\nwe explore scaling limits and analyze the market impact of passive metaorders.\nAdditionally, we derive useful approximations for the shape of market impact\ncurves, leading to closed-form formulas that can be easily applied in practice.", "published": "2024-12-10 12:30:27", "link": "http://arxiv.org/abs/2412.07461v1", "categories": ["q-fin.MF", "math.PR", "q-fin.TR", "60G55, 62P05, 91G80"], "primary_category": "q-fin.MF"}
{"title": "How to Choose a Threshold for an Evaluation Metric for Large Language Models", "abstract": "To ensure and monitor large language models (LLMs) reliably, various\nevaluation metrics have been proposed in the literature. However, there is\nlittle research on prescribing a methodology to identify a robust threshold on\nthese metrics even though there are many serious implications of an incorrect\nchoice of the thresholds during deployment of the LLMs. Translating the\ntraditional model risk management (MRM) guidelines within regulated industries\nsuch as the financial industry, we propose a step-by-step recipe for picking a\nthreshold for a given LLM evaluation metric. We emphasize that such a\nmethodology should start with identifying the risks of the LLM application\nunder consideration and risk tolerance of the stakeholders. We then propose\nconcrete and statistically rigorous procedures to determine a threshold for the\ngiven LLM evaluation metric using available ground-truth data. As a concrete\nexample to demonstrate the proposed methodology at work, we employ it on the\nFaithfulness metric, as implemented in various publicly available libraries,\nusing the publicly available HaluBench dataset. We also lay a foundation for\ncreating systematic approaches to select thresholds, not only for LLMs but for\nany GenAI applications.", "published": "2024-12-10 21:57:25", "link": "http://arxiv.org/abs/2412.12148v1", "categories": ["stat.ML", "cs.CL", "cs.LG", "q-fin.ST", "stat.AP"], "primary_category": "stat.ML"}
{"title": "A Joint Energy and Differentially-Private Smart Meter Data Market", "abstract": "Given the vital role that smart meter data could play in handling uncertainty\nin energy markets, data markets have been proposed as a means to enable\nincreased data access. However, most extant literature considers energy markets\nand data markets separately, which ignores the interdependence between them. In\naddition, existing data market frameworks rely on a trusted entity to clear the\nmarket. This paper proposes a joint energy and data market focusing on the\nday-ahead retailer energy procurement problem with uncertain demand. The\nretailer can purchase differentially-private smart meter data from consumers to\nreduce uncertainty. The problem is modelled as an integrated forecasting and\noptimisation problem providing a means of valuing data directly rather than\nvaluing forecasts or forecast accuracy. Value is determined by the Wasserstein\ndistance, enabling privacy to be preserved during the valuation and procurement\nprocess. The value of joint energy and data clearing is highlighted through\nnumerical case studies using both synthetic and real smart meter data.", "published": "2024-12-10 17:25:14", "link": "http://arxiv.org/abs/2412.07688v1", "categories": ["eess.SY", "cs.GT", "cs.SY", "econ.GN", "q-fin.EC", "q-fin.PM", "q-fin.TR"], "primary_category": "eess.SY"}
