{"title": "Automated Market Making and Decentralized Finance", "abstract": "Automated market makers (AMMs) are a new type of trading venues which are\nrevolutionising the way market participants interact. At present, the majority\nof AMMs are constant function market makers (CFMMs) where a deterministic\ntrading function determines how markets are cleared. Within CFMMs, we focus on\nconstant product market makers (CPMMs) which implements the concentrated\nliquidity (CL) feature. In this thesis we formalise and study the trading\nmechanism of CPMMs with CL, and we develop liquidity provision and liquidity\ntaking strategies. Our models are motivated and tested with market data.\n  We derive optimal strategies for liquidity takers (LTs) who trade orders of\nlarge size and execute statistical arbitrages. First, we consider an LT who\ntrades in a CPMM with CL and uses the dynamics of prices in competing venues as\nmarket signals. We use Uniswap v3 data to study price, liquidity, and trading\ncost dynamics, and to motivate the model. Next, we consider an LT who trades a\nbasket of crypto-currencies whose constituents co-move. We use market data to\nstudy lead-lag effects, spillover effects, and causality between trading\nvenues.\n  We derive optimal strategies for strategic liquidity providers (LPs) who\nprovide liquidity in CPMM with CL. First, we use stochastic control tools to\nderive a self-financing and closed-form optimal liquidity provision strategy\nwhere the width of the LP's liquidity range is determined by the profitability\nof the pool, the dynamics of the LP's position, and concentration risk. Next,\nwe use a model-free approach to solve the problem of an LP who provides\nliquidity in multiple CPMMs with CL. We do not specify a model for the\nstochastic processes observed by LPs, and use a long short-term memory (LSTM)\nneural network to approximate the optimal liquidity provision strategy.", "published": "2024-07-23 23:38:19", "link": "http://arxiv.org/abs/2407.16885v1", "categories": ["q-fin.TR"], "primary_category": "q-fin.TR"}
{"title": "Stablecoin Runs and Disclosure Policy in the Presence of Large Sales", "abstract": "Stablecoins have historically depegged due from par to large sales, possibly\nof speculative nature, or poor reserve asset quality. Using a global game which\naddresses both concerns, we show that the selling pressure on stablecoin\nholders increases in the presence of a large sale. While precise public\nknowledge reduces (increases) the probability of a run when fundamentals are\nstrong (weak), interestingly, more precise private signals increase (reduce)\nthe probability of a run when fundamentals are strong (weak), potentially\nexplaining the stability of opaque stablecoins. The total run probability can\nbe decomposed into components representing risks from large sales and poor\ncollateral. By analyzing how these risk components vary with respect to\ninformation uncertainty and fundamentals, we can split the fundamental space\ninto regions based on the type of risk a stablecoin issuer is more prone to. We\nsuggest testable implications and connect our model's implications to\nreal-world applications, including depegging events and the no-questions-asked\nproperty of money.", "published": "2024-07-23 19:37:02", "link": "http://arxiv.org/abs/2408.07227v1", "categories": ["q-fin.TR", "econ.TH"], "primary_category": "q-fin.TR"}
{"title": "The Hybrid Forecast of S&P 500 Volatility ensembled from VIX, GARCH and LSTM models", "abstract": "Predicting the S&P 500 index volatility is crucial for investors and\nfinancial analysts as it helps assess market risk and make informed investment\ndecisions. Volatility represents the level of uncertainty or risk related to\nthe size of changes in a security's value, making it an essential indicator for\nfinancial planning. This study explores four methods to improve the accuracy of\nvolatility forecasts for the S&P 500: the established GARCH model, known for\ncapturing historical volatility patterns; an LSTM network that utilizes past\nvolatility and log returns; a hybrid LSTM-GARCH model that combines the\nstrengths of both approaches; and an advanced version of the hybrid model that\nalso factors in the VIX index to gauge market sentiment. This analysis is based\non a daily dataset that includes S&P 500 and VIX index data, covering the\nperiod from January 3, 2000, to December 21, 2023. Through rigorous testing and\ncomparison, we found that machine learning approaches, particularly the hybrid\nLSTM models, significantly outperform the traditional GARCH model. Including\nthe VIX index in the hybrid model further enhances its forecasting ability by\nincorporating real-time market sentiment. The results of this study offer\nvaluable insights for achieving more accurate volatility predictions, enabling\nbetter risk management and strategic investment decisions in the volatile\nenvironment of the S&P 500.", "published": "2024-07-23 18:28:16", "link": "http://arxiv.org/abs/2407.16780v1", "categories": ["q-fin.TR", "q-fin.PM", "q-fin.ST", "stat.ML"], "primary_category": "q-fin.TR"}
{"title": "The Negative Drift of a Limit Order Fill", "abstract": "Market making refers to a form of trading in financial markets characterized\nby passive orders which add liquidity to limit order books. Market makers are\nimportant for the proper functioning of financial markets worldwide. Given the\nimportance, financial mathematics has endeavored to derive optimal strategies\nfor placing limit orders in this context. This paper identifies a key\ndiscrepancy between popular model assumptions and the realities of real\nmarkets, specifically regarding the dynamics around limit order fills.\nTraditionally, market making models rely on an assumption of low-cost random\nfills, when in reality we observe a high-cost non-random fill behavior. Namely,\nlimit order fills are caused by and coincide with adverse price movements,\nwhich create a drag on the market maker's profit and loss. We refer to this\nphenomenon as \"the negative drift\" associated with limit order fills. We\ndescribe a discrete market model and prove theoretically that the negative\ndrift exists. We also provide a detailed empirical simulation using one of the\nmost traded financial instruments in the world, the 10 Year US Treasury Bond\nfutures, which also confirms its existence. To our knowledge, this is the first\npaper to describe and prove this phenomenon in such detail.", "published": "2024-07-23 14:39:42", "link": "http://arxiv.org/abs/2407.16527v1", "categories": ["q-fin.MF", "q-fin.ST", "q-fin.TR"], "primary_category": "q-fin.MF"}
{"title": "Reinforcement Learning Pair Trading: A Dynamic Scaling approach", "abstract": "Cryptocurrency is a cryptography-based digital asset with extremely volatile\nprices. Around USD 70 billion worth of cryptocurrency is traded daily on\nexchanges. Trading cryptocurrency is difficult due to the inherent volatility\nof the crypto market. This study investigates whether Reinforcement Learning\n(RL) can enhance decision-making in cryptocurrency algorithmic trading compared\nto traditional methods. In order to address this question, we combined\nreinforcement learning with a statistical arbitrage trading technique, pair\ntrading, which exploits the price difference between statistically correlated\nassets. We constructed RL environments and trained RL agents to determine when\nand how to trade pairs of cryptocurrencies. We developed new reward shaping and\nobservation/action spaces for reinforcement learning. We performed experiments\nwith the developed reinforcement learner on pairs of BTC-GBP and BTC-EUR data\nseparated by 1 min intervals (n=263,520). The traditional non-RL pair trading\ntechnique achieved an annualized profit of 8.33%, while the proposed RL-based\npair trading technique achieved annualized profits from 9.94% to 31.53%,\ndepending upon the RL learner. Our results show that RL can significantly\noutperform manual and traditional pair trading techniques when applied to\nvolatile markets such as~cryptocurrencies.", "published": "2024-07-23 00:16:27", "link": "http://arxiv.org/abs/2407.16103v2", "categories": ["q-fin.CP", "cs.LG", "q-fin.TR", "91-08"], "primary_category": "q-fin.CP"}
