{"title": "Kullback-Leibler cluster entropy to quantify volatility correlation and risk diversity", "abstract": "The Kullback-Leibler cluster entropy $\\mathcal{D_{C}}[P \\| Q] $ is evaluated\nfor the empirical and model probability distributions $P$ and $Q$ of the\nclusters formed in the realized volatility time series of five assets (SP\\&500,\nNASDAQ, DJIA, DAX, FTSEMIB). The Kullback-Leibler functional $\\mathcal{D_{C}}[P\n\\| Q] $ provides complementary perspectives about the stochastic volatility\nprocess compared to the Shannon functional $\\mathcal{S_{C}}[P]$. While\n$\\mathcal{D_{C}}[P \\| Q] $ is maximum at the short time scales,\n$\\mathcal{S_{C}}[P]$ is maximum at the large time scales leading to\ncomplementary optimization criteria tracing back respectively to the maximum\nand minimum relative entropy evolution principles. The realized volatility is\nmodelled as a time-dependent fractional stochastic process characterized by\npower-law decaying distributions with positive correlation ($H>1/2$). As a case\nstudy, a multiperiod portfolio built on diversity indexes derived from the\nKullback-Leibler entropy measure of the realized volatility. The portfolio is\nrobust and exhibits better performances over the horizon periods. A comparison\nwith the portfolio built either according to the uniform distribution or in the\nframework of the Markowitz theory is also reported.", "published": "2024-09-01 14:16:06", "link": "http://arxiv.org/abs/2409.10543v1", "categories": ["q-fin.ST", "physics.data-an", "q-fin.PM"], "primary_category": "q-fin.ST"}
{"title": "Simulation of Social Media-Driven Bubble Formation in Financial Markets using an Agent-Based Model with Hierarchical Influence Network", "abstract": "We propose that a tree-like hierarchical structure represents a simple and\neffective way to model the emergent behaviour of financial markets, especially\nmarkets where there exists a pronounced intersection between social media\ninfluences and investor behaviour. To explore this hypothesis, we introduce an\nagent-based model of financial markets, where trading agents are embedded in a\nhierarchical network of communities, and communities influence the strategies\nand opinions of traders. Empirical analysis of the model shows that its\nbehaviour conforms to several stylized facts observed in real financial\nmarkets; and the model is able to realistically simulate the effects that\nsocial media-driven phenomena, such as echo chambers and pump-and-dump schemes,\nhave on financial markets.", "published": "2024-09-01 15:09:35", "link": "http://arxiv.org/abs/2409.00742v1", "categories": ["cs.MA", "cs.AI", "q-fin.TR", "I.2.11"], "primary_category": "cs.MA"}
