{"title": "Dynamic ETF Portfolio Optimization Using enhanced Transformer-Based Models for Covariance and Semi-Covariance Prediction(Work in Progress)", "abstract": "This study explores the use of Transformer-based models to predict both\ncovariance and semi-covariance matrices for ETF portfolio optimization.\nTraditional portfolio optimization techniques often rely on static covariance\nestimates or impose strict model assumptions, which may fail to capture the\ndynamic and non-linear nature of market fluctuations. Our approach leverages\nthe power of Transformer models to generate adaptive, real-time predictions of\nasset covariances, with a focus on the semi-covariance matrix to account for\ndownside risk. The semi-covariance matrix emphasizes negative correlations\nbetween assets, offering a more nuanced approach to risk management compared to\ntraditional methods that treat all volatility equally.\n  Through a series of experiments, we demonstrate that Transformer-based\npredictions of both covariance and semi-covariance significantly enhance\nportfolio performance. Our results show that portfolios optimized using the\nsemi-covariance matrix outperform those optimized with the standard covariance\nmatrix, particularly in volatile market conditions. Moreover, the use of the\nSortino ratio, a risk-adjusted performance metric that focuses on downside\nrisk, further validates the effectiveness of our approach in managing risk\nwhile maximizing returns.\n  These findings have important implications for asset managers and investors,\noffering a dynamic, data-driven framework for portfolio construction that\nadapts more effectively to shifting market conditions. By integrating\nTransformer-based models with the semi-covariance matrix for improved risk\nmanagement, this research contributes to the growing field of machine learning\nin finance and provides valuable insights for optimizing ETF portfolios.", "published": "2024-11-29 12:05:30", "link": "http://arxiv.org/abs/2411.19649v1", "categories": ["q-fin.PM", "q-fin.CP"], "primary_category": "q-fin.PM"}
{"title": "Capital Asset Pricing Model with Size Factor and Normalizing by Volatility Index", "abstract": "The Capital Asset Pricing Model (CAPM) relates a well-diversified stock\nportfolio to a benchmark portfolio. We insert size effect in CAPM, capturing\nthe observation that small stocks have higher risk and return than large\nstocks, on average. Dividing stock index returns by the Volatility Index makes\nthem independent and normal. In this article, we combine these ideas to create\na new discrete-time model, which includes volatility, relative size, and CAPM.\nWe fit this model using real-world data, prove the long-term stability, and\nconnect this research to Stochastic Portfolio Theory. We fill important gaps in\nour previous article on CAPM with the size factor.", "published": "2024-11-29 03:03:08", "link": "http://arxiv.org/abs/2411.19444v3", "categories": ["q-fin.MF", "math.PR", "q-fin.ST", "60G50, 62J05, 62M10, 62P05, 91G15"], "primary_category": "q-fin.MF"}
{"title": "Ergodic optimal liquidations in DeFi", "abstract": "We address the liquidation problem arising from the credit risk management in\ndecentralised finance (DeFi) by formulating it as an ergodic optimal control\nproblem. In decentralised derivatives exchanges, liquidation is triggered\nwhenever the parties fail to maintain sufficient collateral for their open\npositions. Consequently, effectively managing and liquidating disposal of\npositions accrued through liquidations is a critical concern for decentralised\nderivatives exchanges. By simplifying the model (linear temporary and permanent\nprice impacts, simplified cash balance dynamics), we derive the closed-form\nsolutions for the optimal liquidation strategies, which balance immediate\nexecutions with the temporary and permanent price impacts, and the optimal\nlong-term average reward. Numerical simulations further highlight the\neffectiveness of the proposed optimal strategy and demonstrate that the\nsimplified model closely approximates the original market environment. Finally,\nwe provide the method for calibrating the parameters in the model from the\navailable data.", "published": "2024-11-29 11:39:40", "link": "http://arxiv.org/abs/2411.19637v1", "categories": ["q-fin.TR", "math.OC", "Primary 93E20, Secondary 91G80"], "primary_category": "q-fin.TR"}
