{"title": "Alpha Mining and Enhancing via Warm Start Genetic Programming for Quantitative Investment", "abstract": "Traditional genetic programming (GP) often struggles in stock alpha factor\ndiscovery due to its vast search space, overwhelming computational burden, and\nsporadic effective alphas. We find that GP performs better when focusing on\npromising regions rather than random searching. This paper proposes a new GP\nframework with carefully chosen initialization and structural constraints to\nenhance search performance and improve the interpretability of the alpha\nfactors. This approach is motivated by and mimics the alpha searching practice\nand aims to boost the efficiency of such a process. Analysis of 2020-2024\nChinese stock market data shows that our method yields superior out-of-sample\nprediction results and higher portfolio returns than the benchmark.", "published": "2024-12-01 17:13:54", "link": "http://arxiv.org/abs/2412.00896v1", "categories": ["q-fin.ST", "cs.NE", "q-fin.CP"], "primary_category": "q-fin.ST"}
{"title": "A model of strategic sustainable investment", "abstract": "We study a problem of optimal irreversible investment and emission reduction\nformulated as a nonzero-sum dynamic game between an investor with environmental\npreferences and a firm. The game is set in continuous time on an infinite-time\nhorizon. The firm generates profits with a stochastic dynamics and may spend\npart of its revenues towards emission reduction (e.g., renovating the\ninfrastructure). The firm's objective is to maximize the discounted expectation\nof a function of its profits. The investor participates in the profits and may\ndecide to invest to support the firm's production capacity. The investor uses a\nprofit function which accounts for both financial and environmental factors.\nNash equilibria of the game are obtained via a system of variational\ninequalities. We formulate a general verification theorem for this system in a\ndiffusive setup and construct an explicit solution in the zero-noise limit. Our\nexplicit results and numerical approximations show that both the investor's and\nthe firm's optimal actions are triggered by moving boundaries that increase\nwith the total amount of emission abatement.", "published": "2024-12-01 22:27:00", "link": "http://arxiv.org/abs/2412.00986v1", "categories": ["q-fin.MF", "math.OC", "93E20, 91A15, 49N90, 65K15"], "primary_category": "q-fin.MF"}
{"title": "Probabilistic Predictions of Option Prices Using Multiple Sources of Data", "abstract": "A new modular approximate Bayesian inferential framework is proposed that\nenables fast calculation of probabilistic predictions of future option prices.\nWe exploit multiple information sources, including daily spot returns,\nhigh-frequency spot data and option prices. A benefit of this modular Bayesian\napproach is that it allows us to work with the theoretical option pricing\nmodel, without needing to specify an arbitrary statistical model that links the\ntheoretical prices to their observed counterparts. We show that our approach\nproduces accurate probabilistic predictions of option prices in realistic\nscenarios and, despite not explicitly modelling pricing errors, the method is\nshown to be robust to their presence. Predictive accuracy based on the Heston\nstochastic volatility model, with predictions produced via rapid real-time\nupdates, is illustrated empirically for short-maturity options.", "published": "2024-12-01 03:40:38", "link": "http://arxiv.org/abs/2412.00658v1", "categories": ["q-fin.ST", "stat.CO", "stat.ME"], "primary_category": "q-fin.ST"}
