{"title": "Risk-indifference Pricing of American-style Contingent Claims", "abstract": "This paper studies the pricing of contingent claims of American style, using\nindifference pricing by fully dynamic convex risk measures. We provide a\ngeneral definition of risk-indifference prices for buyers and sellers in\ncontinuous time, in a setting where buyer and seller have potentially different\ninformation, and show that these definitions are consistent with no-arbitrage\nprinciples. Specifying to stochastic volatility models, we characterize\nindifference prices via solutions of Backward Stochastic Differential Equations\nreflected at Backward Stochastic Differential Equations and show that this\ncharacterization provides a basis for the implementation of numerical methods\nusing deep learning.", "published": "2024-08-26 20:35:27", "link": "http://arxiv.org/abs/2409.00095v1", "categories": ["q-fin.PR", "math.PR", "q-fin.MF", "60"], "primary_category": "q-fin.PR"}
{"title": "LSR-IGRU: Stock Trend Prediction Based on Long Short-Term Relationships and Improved GRU", "abstract": "Stock price prediction is a challenging problem in the field of finance and\nreceives widespread attention. In recent years, with the rapid development of\ntechnologies such as deep learning and graph neural networks, more research\nmethods have begun to focus on exploring the interrelationships between stocks.\nHowever, existing methods mostly focus on the short-term dynamic relationships\nof stocks and directly integrating relationship information with temporal\ninformation. They often overlook the complex nonlinear dynamic characteristics\nand potential higher-order interaction relationships among stocks in the stock\nmarket. Therefore, we propose a stock price trend prediction model named\nLSR-IGRU in this paper, which is based on long short-term stock relationships\nand an improved GRU input. Firstly, we construct a long short-term relationship\nmatrix between stocks, where secondary industry information is employed for the\nfirst time to capture long-term relationships of stocks, and overnight price\ninformation is utilized to establish short-term relationships. Next, we improve\nthe inputs of the GRU model at each step, enabling the model to more\neffectively integrate temporal information and long short-term relationship\ninformation, thereby significantly improving the accuracy of predicting stock\ntrend changes. Finally, through extensive experiments on multiple datasets from\nstock markets in China and the United States, we validate the superiority of\nthe proposed LSR-IGRU model over the current state-of-the-art baseline models.\nWe also apply the proposed model to the algorithmic trading system of a\nfinancial company, achieving significantly higher cumulative portfolio returns\ncompared to other baseline methods. Our sources are released at\nhttps://github.com/ZP1481616577/Baselines_LSR-IGRU.", "published": "2024-08-26 02:58:37", "link": "http://arxiv.org/abs/2409.08282v2", "categories": ["q-fin.ST", "cs.CE", "cs.LG"], "primary_category": "q-fin.ST"}
