{"title": "Comparative Statics of Trading Boundary in Finite Horizon Portfolio Selection with Proportional Transaction Costs", "abstract": "We consider the Merton's problem with proportional transaction costs. It is\nwell-known that the optimal investment strategy is characterized by two trading\nboundaries, i.e., the buy boundary and the sell boundary, between which is the\nno-trading region. We study how the two trading boundaries vary with\ntransaction costs. We reveal that the cost-adjusted trading boundaries are\nmonotone in transaction costs. Our result indicates that (i) the Merton line\nmust lie between two cost-adjusted trading boundaries; (ii) when the Merton\nline is positive, the buy boundary and the sell boundary are monotone in\ntransaction costs and the Merton line lies in the no-trading region as a\nresult.", "published": "2024-12-18 09:52:47", "link": "http://arxiv.org/abs/2412.13669v1", "categories": ["q-fin.MF"], "primary_category": "q-fin.MF"}
{"title": "Strictly monotone mean-variance preferences with dynamic portfolio management", "abstract": "This paper is devoted to extending the monotone mean-variance (MMV)\npreference to a large class of strictly monotone mean-variance (SMMV)\npreferences, and illustrating its application to single-period/continuous-time\nportfolio selection problems. The properties and equivalent representations of\nthe SMMV preference are also studied. To illustrate applications, we provide\nthe gradient condition for the single-period portfolio problem with SMMV\npreferences, and investigate its association with the optimal mean-variance\nstatic strategy. For the continuous-time portfolio problem with SMMV\npreferences and continuous price processes, we show the condition that the\nsolution is the same as the corresponding optimal mean-variance strategy. When\nthis consistency condition is not satisfied, the primal problems are unbounded,\nand we turn to study a sequence of approximate linear-quadratic problems\ngenerated by penalty function method. The solution can be characterized by\nstochastic Hamilton-Jacobi-Bellman-Isaacs equation, but it is still difficult\nto derive a closed-form expression. We take a joint adoption of embedding\nmethod and convex duality method to derive an analytical solution. In\nparticular, if the parameter that characterizes the strict monotonicity of SMMV\npreference is a constant, the solution can be given by two equations in the\nform of Black-Scholes formula.", "published": "2024-12-18 05:47:06", "link": "http://arxiv.org/abs/2412.13523v1", "categories": ["q-fin.MF", "Primary: 91G10, 49N10, Secondary: 91B05, 49N90"], "primary_category": "q-fin.MF"}
{"title": "On stochastic control problems with higher-order moments", "abstract": "In this paper, we focus on a class of time-inconsistent stochastic control\nproblems, where the objective function includes the mean and several\nhigher-order central moments of the terminal value of state. To tackle the\ntime-inconsistency, we seek both the closed-loop and the open-loop Nash\nequilibrium controls as time-consistent solutions. We establish a partial\ndifferential equation (PDE) system for deriving a closed-loop Nash equilibrium\ncontrol, which does not include the equilibrium value function and is different\nfrom the extended Hamilton-Jacobi-Bellman (HJB) equations as in Bj\\\"ork et al.\n(Finance Stoch. 21: 331-360, 2017). We show that our PDE system is equivalent\nto the extended HJB equations that seems difficult to be solved for our\nhigher-order moment problems. In deriving an open-loop Nash equilibrium\ncontrol, due to the non-separable higher-order moments in the objective\nfunction, we make some moment estimates in addition to the standard\nperturbation argument for developing a maximum principle. Then, the problem is\nreduced to solving a flow of forward-backward stochastic differential\nequations. In particular, we investigate linear controlled dynamics and some\nobjective functions affine in the mean. The closed-loop and the open-loop Nash\nequilibrium controls are identical, which are independent of the state value,\nrandom path and the preference on the odd-order central moments. By sending the\nhighest order of central moments to infinity, we obtain the time-consistent\nsolutions to some control problems whose objective functions include some\npenalty functions for deviation.", "published": "2024-12-18 05:46:13", "link": "http://arxiv.org/abs/2412.13521v2", "categories": ["q-fin.MF", "math.OC", "Primary: 93E20, 91G80, Secondary: 91B08, 49N90"], "primary_category": "q-fin.MF"}
{"title": "Multivariate Rough Volatility", "abstract": "Motivated by empirical evidence from the joint behavior of realized\nvolatility time series, we propose to model the joint dynamics of\nlog-volatilities using a multivariate fractional Ornstein-Uhlenbeck process.\nThis model is a multivariate version of the Rough Fractional Stochastic\nVolatility model proposed in Gatheral, Jaisson, and Rosenbaum, Quant. Finance,\n2018. It allows for different Hurst exponents in the different marginal\ncomponents and non trivial interdependencies.\n  We discuss the main features of the model and propose an estimator that\njointly identifies its parameters. We derive the asymptotic theory of the\nestimator and perform a simulation study that confirms the asymptotic theory in\nfinite sample.\n  We carry out an extensive empirical investigation on all realized volatility\ntime series covering the entire span of about two decades in the Oxford-Man\nrealized library. Our analysis shows that these time series are strongly\ncorrelated and can exhibit asymmetries in their cross-covariance structure,\naccurately captured by our model. These asymmetries lead to spillover effects\nthat we analyse theoretically within the model and then using our empirical\nestimates. Moreover, in accordance with the existing literature, we observe\nbehaviors close to non-stationarity and rough trajectories.", "published": "2024-12-18 21:40:36", "link": "http://arxiv.org/abs/2412.14353v1", "categories": ["q-fin.ST", "60G15, 62M09, 60G22"], "primary_category": "q-fin.ST"}
{"title": "Refining and Robust Backtesting of A Century of Profitable Industry Trends", "abstract": "We revisit the long-only trend-following strategy presented in A Century of\nProfitable Industry Trends by Zarattini and Antonacci, which achieved\nexceptional historical performance with an 18.2% annualized return and a Sharpe\nRatio of 1.39. While the results outperformed benchmarks, practical\nimplementation raises concerns about robustness and evolving market conditions.\nThis study explores modifications addressing reliance on T-bills, alternative\nfallback allocations, and industry exclusions. Despite attempts to enhance\nadaptability through momentum signals, parameter optimization, and Walk-Forward\nAnalysis, results reveal persistent challenges. The results highlight\nchallenges in adapting historical strategies to modern markets and offer\ninsights for future trend-following frameworks.", "published": "2024-12-18 21:57:08", "link": "http://arxiv.org/abs/2412.14361v2", "categories": ["q-fin.PM", "q-fin.TR"], "primary_category": "q-fin.PM"}
