{"title": "Stylized facts in Web3", "abstract": "This paper presents a comprehensive statistical analysis of the Web3\necosystem, comparing various Web3 tokens with traditional financial assets\nacross multiple time scales. We examine probability distributions, tail\nbehaviors, and other key stylized facts of the returns for a diverse range of\ntokens, including decentralized exchanges, liquidity pools, and centralized\nexchanges. Despite functional differences, most tokens exhibit well-established\nempirical facts, including unconditional probability density of returns with\nheavy tails gradually becoming Gaussian and volatility clustering. Furthermore,\nwe compare assets traded on centralized (CEX) and decentralized (DEX)\nexchanges, finding that DEXs exhibit similar stylized facts despite different\ntrading mechanisms and often divergent long-term performance. We propose that\nthis similarity is attributable to arbitrageurs striving to maintain similar\ncentralized and decentralized prices. Our study contributes to a better\nunderstanding of the dynamics of Web3 tokens and the relationship between CEX\nand DEX markets, with important implications for risk management, pricing\nmodels, and portfolio construction in the rapidly evolving DeFi landscape.\nThese results add to the growing body of literature on cryptocurrency markets\nand provide insights that can guide the development of more accurate models for\nDeFi markets.", "published": "2024-08-14 16:28:05", "link": "http://arxiv.org/abs/2408.07653v3", "categories": ["q-fin.ST"], "primary_category": "q-fin.ST"}
{"title": "Model-based and empirical analyses of stochastic fluctuations in economy and finance", "abstract": "The objective of this work is the investigation of complexity, asymmetry,\nstochasticity and non-linearity of the financial and economic systems by using\nthe tools of statistical mechanics and information theory. More precisely, this\nthesis concerns statistical-based modeling and empirical analyses with\napplications in finance, forecasting, production processes and game theory. In\nthese areas the time dependence of probability distributions is of prime\ninterest and can be measured or exactly calculated for model systems. The\ncorrelation coefficients and moments are among the useful quantities to\ndescribe the dynamics and the correlations between random variables. However,\nthe full investigation can only be achieved if the probability distribution\nfunction of the variable is known; its derivation is one of the main focuses of\nthe present work.", "published": "2024-08-14 16:17:07", "link": "http://arxiv.org/abs/2408.16010v1", "categories": ["q-fin.ST", "physics.data-an"], "primary_category": "q-fin.ST"}
{"title": "Modeling of Measurement Error in Financial Returns Data", "abstract": "In this paper we consider the modeling of measurement error for fund returns\ndata. In particular, given access to a time-series of discretely observed\nlog-returns and the associated maximum over the observation period, we develop\na stochastic model which models the true log-returns and maximum via a L\\'evy\nprocess and the data as a measurement error there-of. The main technical\ndifficulty of trying to infer this model, for instance Bayesian parameter\nestimation, is that the joint transition density of the return and maximum is\nseldom known, nor can it be simulated exactly. Based upon the novel stick\nbreaking representation of [12] we provide an approximation of the model. We\ndevelop a Markov chain Monte Carlo (MCMC) algorithm to sample from the Bayesian\nposterior of the approximated posterior and then extend this to a multilevel\nMCMC method which can reduce the computational cost to approximate posterior\nexpectations, relative to ordinary MCMC. We implement our methodology on\nseveral applications including for real data.", "published": "2024-08-14 09:24:12", "link": "http://arxiv.org/abs/2408.07405v1", "categories": ["stat.CO", "q-fin.CP", "q-fin.ST"], "primary_category": "stat.CO"}
