{"title": "Boundary treatment for high-order IMEX Runge-Kutta local discontinuous Galerkin schemes for multidimensional nonlinear parabolic PDEs", "abstract": "In this article, we propose novel boundary treatment algorithms to avoid\norder reduction when implicit-explicit Runge-Kutta time discretization is used\nfor solving convection-diffusion-reaction problems with time-dependent\nDi\\-richlet boundary conditions. We consider Cartesian meshes and PDEs with\nstiff terms coming from the diffusive parts of the PDE. The algorithms treat\nboundary values at the implicit-explicit internal stages in the same way as the\ninterior points. The boundary treatment strategy is designed to work with\nmultidimensional problems with possible nonlinear advection and source terms.\nThe proposed methods recover the designed order of convergence by numerical\nverification. For the spatial discretization, in this work, we consider Local\nDiscontinuous Galerkin methods, although the developed boundary treatment\nalgorithms can operate with other discretization schemes in space, such as\nFinite Differences, Finite Elements or Finite Volumes.", "published": "2024-10-03 19:23:28", "link": "http://arxiv.org/abs/2410.02927v1", "categories": ["math.NA", "cs.NA", "q-fin.CP", "q-fin.MF"], "primary_category": "math.NA"}
{"title": "A second order finite volume IMEX Runge-Kutta scheme for two dimensional PDEs in finance", "abstract": "In this article we present a novel and general methodology for building\nsecond order finite volume implicit-explicit (IMEX) numerical schemes for\nsolving two dimensional financial parabolic PDEs with mixed derivatives. In\nparticular, applications to basket and Heston models are presented. The\nobtained numerical schemes have excellent properties and are able to overcome\nthe well-documented difficulties related with numerical approximations in the\nfinancial literature. The methods achieve true second order convergence with\nnon-regular initial conditions. Besides, the IMEX time integrator allows to\novercome the tiny time-step induced by the diffusive term in the explicit\nschemes, also providing very accurate and non-oscillatory approximations of the\nGreeks. Finally, in order to assess all the aforementioned good properties of\nthe developed numerical schemes, we compute extremely accurate semi-analytic\nsolutions using multi-dimensional Fourier cosine expansions. A novel technique\nto truncate the Fourier series for basket options is presented and it is\nefficiently implemented using multi-GPUs.", "published": "2024-10-03 19:18:17", "link": "http://arxiv.org/abs/2410.02925v1", "categories": ["math.NA", "cs.NA", "q-fin.CP", "q-fin.MF"], "primary_category": "math.NA"}
{"title": "Efficient calibration of the shifted square-root diffusion model to credit default swap spreads using asymptotic approximations", "abstract": "We derive a closed-form approximation for the credit default swap (CDS)\nspread in the two-dimensional shifted square-root diffusion (SSRD) model using\nasymptotic coefficient expansion technique to approximate solutions of\nnonlinear partial differential equations. Specifically, we identify the Cauchy\nproblems associated with two terms in the CDS spread formula that lack\nanalytical solutions and derive asymptotic approximations for these terms. Our\napproximation does not require the assumption of uncorrelated interest rate and\ndefault intensity processes as typically required for calibration in the SSRD\nmodel. Through several calibration studies using market data on CDS spread, we\ndemonstrate the accuracy and efficiency of our proposed formula.", "published": "2024-10-03 16:31:19", "link": "http://arxiv.org/abs/2410.02645v1", "categories": ["q-fin.MF"], "primary_category": "q-fin.MF"}
{"title": "Parrondo's effects with aperiodic protocols", "abstract": "In this work, we study the effectiveness of employing archetypal aperiodic\nsequencing -- namely Fibonacci, Thue-Morse, and Rudin-Shapiro -- on the\nParrondian effect. From a capital gain perspective, our results show that these\nseries do yield a Parrondo's Paradox with the Thue-Morse based strategy\noutperforming not only the other two aperiodic strategies but benchmark\nParrondian games with random and periodical ($AABBAABB\\ldots$) switching as\nwell. The least performing of the three aperiodic strategies is the\nRudin-Shapiro. To elucidate the underlying causes of these results, we analyze\nthe cross-correlation between the capital generated by the switching protocols\nand that of the isolated losing games. This analysis reveals that a strong\nanticorrelation with both isolated games is typically required to achieve a\nrobust manifestation of Parrondo's effect. We also study the influence of the\nsequencing on the capital using the lacunarity and persistence measures. In\ngeneral, we observe that the switching protocols tend to become less performing\nin terms of the capital as one increases the persistence and thus approaches\nthe features of an isolated losing game. For the (log-)lacunarity, a property\nrelated to heterogeneity, we notice that for small persistence (less than 0.5)\nthe performance increases with the lacunarity with a maximum around 0.4. In\nrespect of this, our work shows that the optimization of a switching protocol\nis strongly dependent on a fine-tuning between persistence and heterogeneity.", "published": "2024-10-03 20:56:16", "link": "http://arxiv.org/abs/2410.02987v2", "categories": ["physics.soc-ph", "cs.GT", "cs.NA", "math.NA", "q-fin.ST", "stat.AP"], "primary_category": "physics.soc-ph"}
{"title": "A Spatio-Temporal Machine Learning Model for Mortgage Credit Risk: Default Probabilities and Loan Portfolios", "abstract": "We introduce a novel machine learning model for credit risk by combining\ntree-boosting with a latent spatio-temporal Gaussian process model accounting\nfor frailty correlation. This allows for modeling non-linearities and\ninteractions among predictor variables in a flexible data-driven manner and for\naccounting for spatio-temporal variation that is not explained by observable\npredictor variables. We also show how estimation and prediction can be done in\na computationally efficient manner. In an application to a large U.S. mortgage\ncredit risk data set, we find that both predictive default probabilities for\nindividual loans and predictive loan portfolio loss distributions obtained with\nour novel approach are more accurate compared to conventional independent\nlinear hazard models and also linear spatio-temporal models. Using\ninterpretability tools for machine learning models, we find that the likely\nreasons for this outperformance are strong interaction and non-linear effects\nin the predictor variables and the presence of large spatio-temporal frailty\neffects.", "published": "2024-10-03 15:10:55", "link": "http://arxiv.org/abs/2410.02846v1", "categories": ["q-fin.RM", "cs.LG", "q-fin.ST"], "primary_category": "q-fin.RM"}
