{"title": "Forward-backward Contention Resolution Schemes for Fair Rationing", "abstract": "We use contention resolution schemes (CRS) to derive algorithms for the fair\nrationing of a single resource when agents have stochastic demands. We aim to\nprovide ex-ante guarantees on the level of service provided to each agent, who\nmay measure service in different ways (Type-I, II, or III), calling for CRS\nunder different feasibility constraints (rank-1 matroid or knapsack). We are\nparticularly interested in two-order CRS where the agents are equally likely to\narrive in a known forward order or its reverse, which is motivated by online\nrationing at food banks.\n  In particular, we derive a two-order CRS for rank-1 matroids with guarantee\n$1/(1+e^{-1/2})\\approx 0.622$, which we prove is tight. This improves upon the\n$1/2$ guarantee that is best-possible under a single order (Alaei, SIAM J.\nComput. 2014), while achieving separation with the $1-1/e\\approx 0.632$\nguarantee that is possible for random-order CRS (Lee and Singla, ESA 2018).\nBecause CRS guarantees imply prophet inequalities, this also beats the\ntwo-order prophet inequality with ratio $(\\sqrt{5}-1)/2\\approx 0.618$ from\n(Arsenis, SODA 2021), which was tight for single-threshold policies. Rank-1\nmatroids suffice to provide guarantees under Type-II or III service, but Type-I\nservice requires knapsack. Accordingly, we derive a two-order CRS for knapsack\nwith guarantee $1/3$, improving upon the $1/(3+e^{-2})\\approx 0.319$ guarantee\nthat is best-possible under a single order (Jiang et al., SODA 2022). To our\nknowledge, $1/3$ provides the best-known guarantee for knapsack CRS even in the\noffline setting. Finally, we provide an upper bound of $1/(2+e^{-1})\\approx\n0.422$ for two-order knapsack CRS, strictly smaller than the upper bound of\n$(1-e^{-2})/2\\approx0.432$ for random-order knapsack CRS.", "published": "2025-02-13 17:36:12", "link": "http://arxiv.org/abs/2502.09521v1", "categories": ["cs.DS", "cs.DM", "F.2.2; G.2.2"], "primary_category": "cs.DS"}
{"title": "RTD-Conjecture and Concept Classes Induced by Graphs", "abstract": "It is conjectured that the recursive teaching dimension of any finite concept\nclass is upper-bounded by the VC-dimension of this class times a universal\nconstant. In this paper, we confirm this conjecture for two rich families of\nconcept classes where each class is induced by some graph $G$. For each $G$, we\nconsider the class whose concepts represent stars in $G$ as well as the class\nwhose concepts represent connected sets in $G$. We show that, for concept\nclasses of this kind, the recursive teaching dimension either equals the\nVC-dimension or is less by $1$.", "published": "2025-02-13 16:19:58", "link": "http://arxiv.org/abs/2502.09453v1", "categories": ["cs.DM", "68R05 (primary) 05C99 (secondary)", "F.1.3; G.2.1; I.2.6"], "primary_category": "cs.DM"}
{"title": "Depth-Bounds for Neural Networks via the Braid Arrangement", "abstract": "We contribute towards resolving the open question of how many hidden layers\nare required in ReLU networks for exactly representing all continuous and\npiecewise linear functions on $\\mathbb{R}^d$. While the question has been\nresolved in special cases, the best known lower bound in general is still 2. We\nfocus on neural networks that are compatible with certain polyhedral complexes,\nmore precisely with the braid fan. For such neural networks, we prove a\nnon-constant lower bound of $\\Omega(\\log\\log d)$ hidden layers required to\nexactly represent the maximum of $d$ numbers. Additionally, under our\nassumption, we provide a combinatorial proof that 3 hidden layers are necessary\nto compute the maximum of 5 numbers; this had only been verified with an\nexcessive computation so far. Finally, we show that a natural generalization of\nthe best known upper bound to maxout networks is not tight, by demonstrating\nthat a rank-3 maxout layer followed by a rank-2 maxout layer is sufficient to\nrepresent the maximum of 7 numbers.", "published": "2025-02-13 13:37:52", "link": "http://arxiv.org/abs/2502.09324v1", "categories": ["cs.LG", "cs.DM", "cs.NE", "math.CO"], "primary_category": "cs.LG"}
{"title": "Graphical Conditions for the Existence, Unicity and Number of Regular Models", "abstract": "The regular models of a normal logic program are a particular type of partial\n(i.e. 3-valued) models which correspond to stable partial models with minimal\nundefinedness. In this paper, we explore graphical conditions on the dependency\ngraph of a finite ground normal logic program to analyze the existence, unicity\nand number of regular models for the program. We show three main results: 1) a\nnecessary condition for the existence of non-trivial (i.e. non-2-valued)\nregular models, 2) a sufficient condition for the unicity of regular models,\nand 3) two upper bounds for the number of regular models based on positive\nfeedback vertex sets. The first two conditions generalize the finite cases of\nthe two existing results obtained by You and Yuan (1994) for normal logic\nprograms with well-founded stratification. The third result is also new to the\nbest of our knowledge. Key to our proofs is a connection that we establish\nbetween finite ground normal logic programs and Boolean network theory.", "published": "2025-02-13 11:50:20", "link": "http://arxiv.org/abs/2502.09220v1", "categories": ["cs.LO", "cs.AI", "cs.DM"], "primary_category": "cs.LO"}
{"title": "Robust Graph-Based Semi-Supervised Learning via $p$-Conductances", "abstract": "We study the problem of semi-supervised learning on graphs in the regime\nwhere data labels are scarce or possibly corrupted. We propose an approach\ncalled $p$-conductance learning that generalizes the $p$-Laplace and Poisson\nlearning methods by introducing an objective reminiscent of $p$-Laplacian\nregularization and an affine relaxation of the label constraints. This leads to\na family of probability measure mincut programs that balance sparse edge\nremoval with accurate distribution separation. Our theoretical analysis\nconnects these programs to well-known variational and probabilistic problems on\ngraphs (including randomized cuts, effective resistance, and Wasserstein\ndistance) and provides motivation for robustness when labels are diffused via\nthe heat kernel. Computationally, we develop a semismooth Newton-conjugate\ngradient algorithm and extend it to incorporate class-size estimates when\nconverting the continuous solutions into label assignments. Empirical results\non computer vision and citation datasets demonstrate that our approach achieves\nstate-of-the-art accuracy in low label-rate, corrupted-label, and partial-label\nregimes.", "published": "2025-02-13 01:11:25", "link": "http://arxiv.org/abs/2502.08873v1", "categories": ["cs.LG", "cs.DM", "math.OC", "68Q87, 90C35, 05C90, 90C53"], "primary_category": "cs.LG"}
{"title": "LOB-Bench: Benchmarking Generative AI for Finance -- an Application to Limit Order Book Data", "abstract": "While financial data presents one of the most challenging and interesting\nsequence modelling tasks due to high noise, heavy tails, and strategic\ninteractions, progress in this area has been hindered by the lack of consensus\non quantitative evaluation paradigms. To address this, we present LOB-Bench, a\nbenchmark, implemented in python, designed to evaluate the quality and realism\nof generative message-by-order data for limit order books (LOB) in the LOBSTER\nformat. Our framework measures distributional differences in conditional and\nunconditional statistics between generated and real LOB data, supporting\nflexible multivariate statistical evaluation. The benchmark also includes\nfeatures commonly used LOB statistics such as spread, order book volumes, order\nimbalance, and message inter-arrival times, along with scores from a trained\ndiscriminator network. Lastly, LOB-Bench contains \"market impact metrics\", i.e.\nthe cross-correlations and price response functions for specific events in the\ndata. We benchmark generative autoregressive state-space models, a (C)GAN, as\nwell as a parametric LOB model and find that the autoregressive GenAI approach\nbeats traditional model classes.", "published": "2025-02-13 10:56:58", "link": "http://arxiv.org/abs/2502.09172v1", "categories": ["cs.LG", "cs.CE", "q-fin.CP", "q-fin.TR"], "primary_category": "cs.LG"}
{"title": "Quantifying Cryptocurrency Unpredictability: A Comprehensive Study of Complexity and Forecasting", "abstract": "This paper offers a thorough examination of the univariate predictability in\ncryptocurrency time-series. By exploiting a combination of complexity measure\nand model predictions we explore the cryptocurrencies time-series forecasting\ntask focusing on the exchange rate in USD of Litecoin, Binance Coin, Bitcoin,\nEthereum, and XRP. On one hand, to assess the complexity and the randomness of\nthese time-series, a comparative analysis has been performed using Brownian and\ncolored noises as a benchmark. The results obtained from the Complexity-Entropy\ncausality plane and power density spectrum analysis reveal that cryptocurrency\ntime-series exhibit characteristics closely resembling those of Brownian noise\nwhen analyzed in a univariate context. On the other hand, the application of a\nwide range of statistical, machine and deep learning models for time-series\nforecasting demonstrates the low predictability of cryptocurrencies. Notably,\nour analysis reveals that simpler models such as Naive models consistently\noutperform the more complex machine and deep learning ones in terms of\nforecasting accuracy across different forecast horizons and time windows. The\ncombined study of complexity and forecasting accuracies highlights the\ndifficulty of predicting the cryptocurrency market. These findings provide\nvaluable insights into the inherent characteristics of the cryptocurrency data\nand highlight the need to reassess the challenges associated with predicting\ncryptocurrency's price movements.", "published": "2025-02-13 08:53:13", "link": "http://arxiv.org/abs/2502.09079v1", "categories": ["q-fin.ST", "cs.LG", "q-fin.CP"], "primary_category": "q-fin.ST"}
{"title": "A class of locally state-dependent models for forward curves", "abstract": "We present a dynamic model for forward curves within the Heath-Jarrow-Morton\nframework under the Musiela parametrization. The forward curves take values in\na function space H, and their dynamics follows a stochastic partial\ndifferential equation with state-dependent coefficients. In particular, the\ncoefficients are defined through point-wise operating maps on H, resulting in a\nlocally state-dependent structure. We first explore conditions under which\nthese point-wise operators are well defined on H. Next, we determine conditions\nto ensure that the resulting coefficient functions satisfy local growth and\nLipschitz properties, so to guarantee the existence and uniqueness of mild\nsolutions. The proposed model captures the behavior of the entire forward curve\nthrough a single equation, yet retains remarkable simplicity. Notably, we\ndemonstrate that certain one-dimensional projections of the model are Markovian\nand satisfy a one-dimensional stochastic differential equation. This connects\nour Hilbert-space approach to well established models for forward contracts\nwith fixed delivery times, for which existing formulas and numerical techniques\ncan be applied. This link allows us to examine also conditions for maintaining\npositivity of the solutions. As concrete examples, we analyze Hilbert-space\nvalued variants of an exponential model and of a constant elasticity of\nvariance model.", "published": "2025-02-13 16:47:25", "link": "http://arxiv.org/abs/2502.09486v2", "categories": ["math.PR", "q-fin.MF", "60H15, 60G07, 60J25"], "primary_category": "math.PR"}
