{"title": "Solving Maker-Breaker Games on 5-uniform hypergraphs is PSPACE-complete", "abstract": "Let $(X, \\mathcal{F})$ be a hypergraph. The Maker-Breaker game on $(X,\n\\mathcal{F})$ is a combinatorial game between two players, Maker and Breaker.\nBeginning with Maker, the players take turns claiming vertices from $X$ that\nhave not yet been claimed. Maker wins if she manages to claim all vertices of\nsome hyperedge $F \\in \\mathcal{F}$. Breaker wins if he claims at least one\nvertex in every hyperedge.\n  M. L. Rahman and Thomas Watson proved in 2021 that, even when only\nMaker-Breaker games on 6-uniform hypergraphs are considered, the decision\nproblem of determining which player has a winning strategy is PSPACE-complete.\nThey also showed that the problem is NL-hard when considering hypergraphs of\nrank 5.\n  In this paper, we improve the latter result by showing that deciding who wins\nMaker-Breaker games on 5-uniform hypergraphs is still a PSPACE-complete\nproblem. We achieve this by polynomial transformation from the problem of\nsolving the generalized geography game on bipartite digraphs with vertex\ndegrees 3 or less, which is known to be PSPACE-complete.", "published": "2025-02-27 16:57:05", "link": "http://arxiv.org/abs/2502.20271v1", "categories": ["cs.DM", "math.CO", "05C57", "G.2.1"], "primary_category": "cs.DM"}
{"title": "On coarse tree decompositions and coarse balanced separators", "abstract": "It is known that there is a linear dependence between the treewidth of a\ngraph and its balanced separator number: the smallest integer $k$ such that for\nevery weighing of the vertices, the graph admits a balanced separator of size\nat most $k$. We investigate whether this connection can be lifted to the\nsetting of coarse graph theory, where both the bags of the considered tree\ndecompositions and the considered separators should be coverable by a bounded\nnumber of bounded-radius balls.\n  As the first result, we prove that if an $n$-vertex graph $G$ admits balanced\nseparators coverable by $k$ balls of radius $r$, then $G$ also admits tree\ndecompositions ${\\cal T}_1$ and ${\\cal T}_2$ such that:\n  - in ${\\cal T}_1$, every bag can be covered by $O(k\\log n)$ balls of radius\n$r$; and\n  - in ${\\cal T}_2$, every bag can be covered by $O(k^2\\log k)$ balls of radius\n$r(\\log k+\\log\\log n+O(1))$.\n  As the second result, we show that if we additionally assume that $G$ has\ndoubling dimension at most $m$, then the functional equivalence between the\nexistence of small balanced separators and of tree decompositions of small\nwidth can be fully lifted to the coarse setting. Precisely, we prove that for a\npositive integer $r$ and a graph $G$ of doubling dimension at most $m$, the\nfollowing conditions are equivalent, with constants\n$k_1,k_2,k_3,k_4,\\Delta_3,\\Delta_4$ depending on each other and on $m$:\n  - $G$ admits balanced separators consisting of $k_1$ balls of radius $r$;\n  - $G$ has a tree decomposition with bags coverable by $k_2$ balls of radius\n$r$;\n  - $G$ has a tree-partition of maximum degree $\\leq \\Delta_3$ with bags\ncoverable by $k_3$ balls of radius $r$;\n  - $G$ is quasi-isometric to a graph of maximum degree $\\leq \\Delta_4$ and\ntree-partition width $\\leq k_4$.", "published": "2025-02-27 15:18:36", "link": "http://arxiv.org/abs/2502.20182v1", "categories": ["math.CO", "cs.DM"], "primary_category": "math.CO"}
{"title": "Computational Complexity of Covering Colored Mixed Multigraphs with Simple Degree Partitions", "abstract": "The notion of graph covers (also referred to as locally bijective\nhomomorphisms) plays an important role in topological graph theory and has\nfound its computer science applications in models of local computation. For a\nfixed target graph $H$, the {\\sc $H$-Cover} problem asks if an input graph $G$\nallows a graph covering projection onto $H$. Despite the fact that the quest\nfor characterizing the computational complexity of {\\sc $H$-Cover} had been\nstarted more than 30 years ago, only a handful of general results have been\nknown so far.\n  In this paper, we present a complete characterization of the computational\ncomplexity of covering coloured graphs for the case that every equivalence\nclass in the degree partition of the target graph has at most two vertices. We\nprove this result in a very general form. Following the lines of current\ndevelopment of topological graph theory, we study graphs in the most relaxed\nsense of the definition. In particular, we consider graphs that are mixed (they\nmay have both directed and undirected edges), may have multiple edges, loops,\nand semi-edges. We show that a strong P/NP-complete dichotomy holds true in the\nsense that for each such fixed target graph $H$, the {\\sc $H$-Cover} problem is\neither polynomial-time solvable for arbitrary inputs, or NP-complete even for\nsimple input graphs.", "published": "2025-02-27 14:46:52", "link": "http://arxiv.org/abs/2502.20151v1", "categories": ["cs.DM", "math.CO"], "primary_category": "cs.DM"}
{"title": "Aggregation of evaluations without unanimity", "abstract": "Dokow and Holzman determined which predicates over $\\{0, 1\\}$ satisfy an\nanalog of Arrow's theorem: all unanimous aggregators are dictatorial. Szegedy\nand Xu, extending earlier work of Dokow and Holzman, extended this to\npredicates over arbitrary finite alphabets.\n  Mossel extended Arrow's theorem in an orthogonal direction, determining all\naggregators without the assumption of unanimity. We bring together both threads\nof research by extending the results of Dokow-Holzman and Szegedy-Xu to the\nsetting of Mossel. As an application, we determine, for each symmetric\npredicate over $\\{0,1\\}$, all of its aggregators.", "published": "2025-02-27 13:18:27", "link": "http://arxiv.org/abs/2502.20428v2", "categories": ["math.CO", "cs.DM", "math.LO"], "primary_category": "math.CO"}
{"title": "Algebraic Machine Learning: Learning as computing an algebraic decomposition of a task", "abstract": "Statistics and Optimization are foundational to modern Machine Learning.\nHere, we propose an alternative foundation based on Abstract Algebra, with\nmathematics that facilitates the analysis of learning. In this approach, the\ngoal of the task and the data are encoded as axioms of an algebra, and a model\nis obtained where only these axioms and their logical consequences hold.\nAlthough this is not a generalizing model, we show that selecting specific\nsubsets of its breakdown into algebraic atoms obtained via subdirect\ndecomposition gives a model that generalizes. We validate this new learning\nprinciple on standard datasets such as MNIST, FashionMNIST, CIFAR-10, and\nmedical images, achieving performance comparable to optimized multilayer\nperceptrons. Beyond data-driven tasks, the new learning principle extends to\nformal problems, such as finding Hamiltonian cycles from their specifications\nand without relying on search. This algebraic foundation offers a fresh\nperspective on machine intelligence, featuring direct learning from training\ndata without the need for validation dataset, scaling through model additivity,\nand asymptotic convergence to the underlying rule in the data.", "published": "2025-02-27 10:13:42", "link": "http://arxiv.org/abs/2502.19944v1", "categories": ["cs.LG", "cs.AI", "cs.DM", "cs.SC", "math.CO", "03G10, 06A12, 06A06, 08A70, 68R01, 68T01", "G.2.3; I.1.2; I.2.6; I.2.8"], "primary_category": "cs.LG"}
{"title": "Digital Convexity and Combinatorics on Words", "abstract": "An upward (resp. downward) digitally convex word is a binary word that best\napproximates from below (resp. from above) an upward (resp. downward) convex\ncurve in the plane. We study these words from the combinatorial point of view,\nformalizing their geometric properties and highlighting connections with\nChristoffel words and finite Sturmian words. In particular, we study from the\ncombinatorial perspective the operations of inflation and deflation on\ndigitally convex words.", "published": "2025-02-27 09:54:13", "link": "http://arxiv.org/abs/2502.19926v2", "categories": ["math.CO", "cs.DM", "cs.FL", "68R15"], "primary_category": "math.CO"}
{"title": "On Piecewise Affine Reachability with Bellman Operators", "abstract": "A piecewise affine map is one of the simplest mathematical objects exhibiting\ncomplex dynamics. The reachability problem of piecewise affine maps is given as\nfollows: Given two vectors $\\mathbf{s}, \\mathbf{t} \\in \\mathbb{Q}^d$ and a\npiecewise affine map $f$, is there $n\\in \\mathbb{N}$ such that\n$f^{n}(\\mathbf{s}) = \\mathbf{t}$? Koiran, Cosnard, and Garzon show that the\nreachability problem of piecewise affine maps is undecidable even in dimension\n2.\n  Most of the recent progress has been focused on decision procedures for\none-dimensional piecewise affine maps, where the reachability problem has been\nshown to be decidable for some subclasses. However, the general undecidability\ndiscouraged research into positive results in arbitrary dimension.\n  In this work, we consider a rich subclass of piecewise affine maps defined by\nBellman operators of Markov decision processes (MDPs). We then investigate the\nrestriction of the piecewise affine reachability problem to that with Bellman\noperators and, in particular, its decidability in any dimension. As one of our\nprimary contributions, we establish the decidability of reachability for\ntwo-dimensional Bellman operators, in contrast to the negative result known for\ngeneral piecewise affine maps.", "published": "2025-02-27 09:45:06", "link": "http://arxiv.org/abs/2502.19923v1", "categories": ["cs.DM", "cs.LO", "math.DS"], "primary_category": "cs.DM"}
{"title": "Independent transversal blow-up of graphs", "abstract": "In an $r$-partite graph, an independent transversal of size $s$ (ITS)\nconsists of $s$ vertices from each part forming an independent set. Motivated\nby a question from Bollob\\'as, Erd\\H{o}s, and Szemer\\'edi (1975), Di Braccio\nand Illingworth (2024) inquired about the minimum degree needed to ensure an $n\n\\times \\cdots \\times n$ $r$-partite graph contains $K_r(s)$, a complete\n$r$-partite graph with $s$ vertices in each part. We reformulate this as\nfinding the smallest $n$ such that any $n \\times \\cdots \\times n$ $r$-partite\ngraph with maximum degree $\\Delta$ has an ITS. For any $\\varepsilon>0$, we\nprove the existence of a $\\gamma>0$ ensuring that if $G$ is a multipartite\ngraph partitioned as $(V_1, V_2, \\ldots, V_r)$, where the average degree of\neach part $V_i$ is at most $D$, the maximum degree of any vertex to any part\n$V_i$ is at most $\\gamma D$, and the size of each part $V_i$ is at least $(s +\n\\varepsilon)D$, then $G$ possesses an ITS. The constraint $(s + \\varepsilon)D$\non the part size is tight. This extends results of Loh and Sudakov (2007),\nGlock and Sudakov (2022), and Kang and Kelly (2022). We also show that any $n\n\\times \\cdots \\times n$ $r$-partite graph with minimum degree at least\n$\\left(r-1-\\frac{1}{2s^2}\\right)n$ contains $K_r(s)$ and provide a relative\nTur\\'an-type result. Additionally, this paper explores counting ITSs in\nmultipartite graphs.", "published": "2025-02-27 01:46:51", "link": "http://arxiv.org/abs/2502.19682v1", "categories": ["math.CO", "cs.DM"], "primary_category": "math.CO"}
{"title": "BiHRNN -- Bi-Directional Hierarchical Recurrent Neural Network for Inflation Forecasting", "abstract": "Inflation prediction guides decisions on interest rates, investments, and\nwages, playing a key role in economic stability. Yet accurate forecasting is\nchallenging due to dynamic factors and the layered structure of the Consumer\nPrice Index, which organizes goods and services into multiple categories. We\npropose the Bi-directional Hierarchical Recurrent Neural Network (BiHRNN) model\nto address these challenges by leveraging the hierarchical structure to enable\nbidirectional information flow between levels. Informative constraints on the\nRNN parameters enhance predictive accuracy at all levels without the\ninefficiencies of a unified model. We validated BiHRNN on inflation datasets\nfrom the United States, Canada, and Norway by training, tuning hyperparameters,\nand experimenting with various loss functions. Our results demonstrate that\nBiHRNN significantly outperforms traditional RNN models, with its bidirectional\narchitecture playing a pivotal role in achieving improved forecasting accuracy.", "published": "2025-02-27 16:12:03", "link": "http://arxiv.org/abs/2503.01893v1", "categories": ["cs.LG", "econ.GN", "q-fin.CP", "q-fin.EC"], "primary_category": "cs.LG"}
{"title": "Optimal risk-aware interest rates for decentralized lending protocols", "abstract": "Decentralized lending protocols within the decentralized finance ecosystem\nenable the lending and borrowing of crypto-assets without relying on\ntraditional intermediaries. Interest rates in these protocols are set\nalgorithmically and fluctuate according to the supply and demand for liquidity.\nIn this study, we propose an agent-based model tailored to a decentralized\nlending protocol and determine the optimal interest rate model. When the\nresponses of the agents are linear with respect to the interest rate, the\noptimal solution is derived from a system of Riccati-type ODEs. For nonlinear\nbehaviors, we propose a Monte-Carlo estimator, coupled with deep learning\ntechniques, to approximate the optimal solution. Finally, after calibrating the\nmodel using block-by-block data, we conduct a risk-adjusted profit and loss\nanalysis of the liquidity pool under industry-standard interest rate models and\nbenchmark them against the optimal interest rate model.", "published": "2025-02-27 08:05:44", "link": "http://arxiv.org/abs/2502.19862v1", "categories": ["q-fin.MF"], "primary_category": "q-fin.MF"}
{"title": "Detecting Crypto Pump-and-Dump Schemes: A Thresholding-Based Approach to Handling Market Noise", "abstract": "We propose a simple yet robust unsupervised model to detect pump-and-dump\nevents on tokens listed on the Poloniex Exchange platform. By combining\nthreshold-based criteria with exponentially weighted moving averages (EWMA) and\nvolatility measures, our approach effectively distinguishes genuine anomalies\nfrom minor trading fluctuations, even for tokens with low liquidity and\nprolonged inactivity. These characteristics present a unique challenge, as\nstandard anomaly-detection methods often over-flag negligible volume spikes.\nOur framework overcomes this issue by tailoring both price and volume\nthresholds to the specific trading patterns observed, resulting in a model that\nbalances high true-positive detection with minimal noise.", "published": "2025-02-27 09:50:14", "link": "http://arxiv.org/abs/2503.08692v1", "categories": ["q-fin.ST", "q-fin.TR"], "primary_category": "q-fin.ST"}
{"title": "Better market Maker Algorithm to Save Impermanent Loss with High Liquidity Retention", "abstract": "Decentralized exchanges (DEXs) face persistent challenges in liquidity\nretention and user engagement due to inefficiencies in conventional automated\nmarket maker (AMM) designs. This work proposes a dual-mechanism framework to\naddress these limitations: a ``Better Market Maker (BMM)'', which is a\nliquidity-optimized AMM based on a power-law invariant ($X^nY = K$, $n = 4$),\nand a dynamic rebate system (DRS) for redistributing transaction fees. The\nsegment-specific BMM reduces impermanent loss by 36\\% compared to traditional\nconstant-product ($XY = K$) models, while retaining 3.98x more liquidity during\nprice volatility. The DRS allocates fees ($\\gamma V$, $\\gamma \\in \\{0.003,\n0.005, 0.01\\}$) with a rebate ratio $\\rho \\in [0.3, 0.4]$ to incentivize trader\nparticipation and maintain continuous capital injection. Simulations under\nhigh-volatility conditions demonstrate impermanent loss reductions of 36.0\\%\nand 40\\% higher user engagement compared to static fee models. By segmenting\nmarkets into high-, mid-, and low-volatility regimes, the framework achieves\nliquidity depth comparable to centralized exchanges (CEXs) while maintaining\ndecentralized governance and retaining value within the cryptocurrency\necosystem.", "published": "2025-02-27 11:28:38", "link": "http://arxiv.org/abs/2502.20001v1", "categories": ["q-fin.TR"], "primary_category": "q-fin.TR"}
