{"title": "Multimodal Stock Price Prediction: A Case Study of the Russian Securities Market", "abstract": "Classical asset price forecasting methods primarily rely on numerical data,\nsuch as price time series, trading volumes, limit order book data, and\ntechnical analysis indicators. However, the news flow plays a significant role\nin price formation, making the development of multimodal approaches that\ncombine textual and numerical data for improved prediction accuracy highly\nrelevant. This paper addresses the problem of forecasting financial asset\nprices using the multimodal approach that combines candlestick time series and\ntextual news flow data. A unique dataset was collected for the study, which\nincludes time series for 176 Russian stocks traded on the Moscow Exchange and\n79,555 financial news articles in Russian. For processing textual data,\npre-trained models RuBERT and Vikhr-Qwen2.5-0.5b-Instruct (a large language\nmodel) were used, while time series and vectorized text data were processed\nusing an LSTM recurrent neural network. The experiments compared models based\non a single modality (time series only) and two modalities, as well as various\nmethods for aggregating text vector representations. Prediction quality was\nestimated using two key metrics: Accuracy (direction of price movement\nprediction: up or down) and Mean Absolute Percentage Error (MAPE), which\nmeasures the deviation of the predicted price from the true price. The\nexperiments showed that incorporating textual modality reduced the MAPE value\nby 55%. The resulting multimodal dataset holds value for the further adaptation\nof language models in the financial sector. Future research directions include\noptimizing textual modality parameters, such as the time window, sentiment, and\nchronological order of news messages.", "published": "2025-03-05 21:20:32", "link": "http://arxiv.org/abs/2503.08696v1", "categories": ["q-fin.ST", "cs.LG", "q-fin.CP"], "primary_category": "q-fin.ST"}
{"title": "Large language models in finance : what is financial sentiment?", "abstract": "Financial sentiment has become a crucial yet complex concept in finance,\nincreasingly used in market forecasting and investment strategies. Despite its\ngrowing importance, there remains a need to define and understand what\nfinancial sentiment truly represents and how it can be effectively measured. We\nexplore the nature of financial sentiment and investigate how large language\nmodels (LLMs) contribute to its estimation. We trace the evolution of sentiment\nmeasurement in finance, from market-based and lexicon-based methods to advanced\nnatural language processing techniques. The emergence of LLMs has significantly\nenhanced sentiment analysis, providing deeper contextual understanding and\ngreater accuracy in extracting sentiment from financial text. We examine how\nBERT-based models, such as RoBERTa and FinBERT, are optimized for structured\nsentiment classification, while GPT-based models, including GPT-4, OPT, and\nLLaMA, excel in financial text generation and real-time sentiment\ninterpretation. A comparative analysis of bidirectional and autoregressive\ntransformer architectures highlights their respective roles in investor\nsentiment analysis, algorithmic trading, and financial decision-making. By\nexploring what financial sentiment is and how it is estimated within LLMs, we\nprovide insights into the growing role of AI-driven sentiment analysis in\nfinance.", "published": "2025-03-05 15:51:25", "link": "http://arxiv.org/abs/2503.03612v4", "categories": ["q-fin.ST", "q-fin.CP", "q-fin.GN", "I.2.7; H.3.3; H.3.4; J.4; J.1"], "primary_category": "q-fin.ST"}
{"title": "Constructing elicitable risk measures", "abstract": "We provide a constructive way of defining new elicitable risk measures that\nare characterised by a multiplicative scoring function. We show that depending\non the choice of the scoring function's components, the resulting risk measure\npossesses properties such as monotonicity, translation invariance, convexity,\nand positive homogeneity. Our framework encompasses the majority of well-known\nelicitable risk measures including all elicitable convex and coherent risk\nmeasures. Our setting moreover allows to construct novel elicitable risk\nmeasures that are, for example, convex but not coherent. Furthermore, we\ndiscuss how higher-order elicitability, such as jointly eliciting the mean and\nvariance or different quantile levels, fall within our setting.", "published": "2025-03-05 13:08:31", "link": "http://arxiv.org/abs/2503.03471v1", "categories": ["q-fin.MF", "q-fin.RM"], "primary_category": "q-fin.MF"}
{"title": "Looking into informal currency markets as Limit Order Books: impact of market makers", "abstract": "This study pioneers the application of the market microstructure framework to\nan informal financial market. By scraping data from websites and social media\nabout the Cuban informal currency market, we model the dynamics of bid/ask\nintentions using a Limit Order Book (LOB). This approach enables us to study\nkey characteristics such as liquidity, stability and volume profiles. We\ncontinue exploiting the Avellaneda-Stoikov model to explore the impact of\nintroducing a Market Maker (MM) into this informal setting, assessing its\ninfluence on the market structure and the bid/ask dynamics. We show that the\nMarket Maker improves the quality of the market. Beyond their academic\nsignificance, we believe that our findings are relevant for policymakers\nseeking to intervene informal markets with limited resources.", "published": "2025-03-05 19:41:22", "link": "http://arxiv.org/abs/2503.03858v1", "categories": ["q-fin.TR", "91B26, 91B24"], "primary_category": "q-fin.TR"}
