{"title": "In-Sample and Out-of-Sample Sharpe Ratios for Linear Predictive Models", "abstract": "We study how much the in-sample performance of trading strategies based on\nlinear predictive models is reduced out-of-sample due to overfitting. More\nspecifically, we compute the in- and out-of-sample means and variances of the\ncorresponding PnLs and use these to derive a closed-form approximation for the\ncorresponding Sharpe ratios. We find that the out-of-sample ``replication\nratio'' diminishes for complex strategies with many assets and based on many\nweak rather than a few strong trading signals, and increases when more training\ndata is used. The substantial quantitative importance of these effects is\nillustrated with an empirical case study for commodity futures following the\nmethodology of Garleanu-Pedersen.", "published": "2025-01-07 17:00:14", "link": "http://arxiv.org/abs/2501.03938v1", "categories": ["q-fin.MF", "q-fin.PM"], "primary_category": "q-fin.MF"}
{"title": "Market Making with Fads, Informed, and Uninformed Traders", "abstract": "We characterise the solutions to a continuous-time optimal liquidity\nprovision problem in a market populated by informed and uninformed traders. In\nour model, the asset price exhibits fads -- these are short-term deviations\nfrom the fundamental value of the asset. Conditional on the value of the fad,\nwe model how informed traders and uninformed traders arrive in the market. The\nmarket maker knows of the two groups of traders but only observes the anonymous\norder arrivals. We study both, the complete information and the partial\ninformation versions of the control problem faced by the market maker. In such\nframeworks, we characterise the value of information, and we find the price of\nliquidity as a function of the proportion of informed traders in the market.\nLastly, for the partial information setup, we explore how to go beyond the\nKalman-Bucy filter to extract information about the fad from the market\narrivals.", "published": "2025-01-07 09:46:50", "link": "http://arxiv.org/abs/2501.03658v2", "categories": ["q-fin.TR", "q-fin.MF"], "primary_category": "q-fin.TR"}
