{"title": "Application of CTS (Computer to Screen) Machine in Printing Industries for Process Improvement & Material Optimization", "abstract": "The printing and labeling industries are struggling to meet the need for more\ncomplex and dynamic design requirements coming from the customers. It is now\ncrucial to implement technological advancements to manage workflow,\nproductivity, process optimization, and continual improvement. There has never\nbeen a time when the imagery and embellishments of apparel has been more\ncommercially viable as it is now. Images and text are fused directly to fabric\nby heat transfer printing and labeling. For screen development which is\nrequired for heat transfer label mass production, many industries are still\nusing the conventional method of screen development process. A CTS\n(computer-to-screen) innovates the printing and labeling industries by\nenhancing workflow, lowering consumable consumptions and chemical usage,\nspeeding up setup, guaranteeing flawless design, and raising the print quality\nof the producing screens. The study's objective is to assess how CTS machines\nare used and how they affect existing heat transfer screen development\nprocesses in one of Bangladesh's leading printing and labeling companies. The\nstudy's primary goal is to highlight and analyze how the use of CTS machines\nreduces material and operational costs by optimizing the process. Costs for\nCapEx and OpEx are computed and compared for using CTS technology before and\nafter adoption. Savings data such as material, consumable, and operating cost\nsavings versus depreciation and machine payback period analysis were taken into\nconsideration. It is clear from this study that CTS machines in the printing\nand labeling industries can guarantee profitability on top of Capital\nExpenditures.", "published": "2025-04-09 21:37:29", "link": "http://arxiv.org/abs/2504.07294v1", "categories": ["q-fin.MF"], "primary_category": "q-fin.MF"}
{"title": "Density Approximation of Affine Jump Diffusions via Closed-Form Moment Matching", "abstract": "We develop a recursive approach for deriving closed-form solutions to both\nconditional and unconditional moments of affine jump diffusions with\nstate-independent jump intensities. Using these moment solutions, we construct\nclosed-form density approximations (up to a normalization constant) via moment\nmatching for both conditional and unconditional distributions. Our framework\nenables important financial applications, including efficient option pricing\nand exact simulation for affine jump diffusions. Numerical experiments\ndemonstrate the method's superior computational efficiency compared to existing\nsimulation techniques, while preserving numerical precision.", "published": "2025-04-09 14:50:18", "link": "http://arxiv.org/abs/2504.06942v1", "categories": ["q-fin.MF"], "primary_category": "q-fin.MF"}
{"title": "Diffusion Factor Models: Generating High-Dimensional Returns with Factor Structure", "abstract": "Financial scenario simulation is essential for risk management and portfolio\noptimization, yet it remains challenging especially in high-dimensional and\nsmall data settings common in finance. We propose a diffusion factor model that\nintegrates latent factor structure into generative diffusion processes,\nbridging econometrics with modern generative AI to address the challenges of\nthe curse of dimensionality and data scarcity in financial simulation. By\nexploiting the low-dimensional factor structure inherent in asset returns, we\ndecompose the score function--a key component in diffusion models--using\ntime-varying orthogonal projections, and this decomposition is incorporated\ninto the design of neural network architectures. We derive rigorous statistical\nguarantees, establishing nonasymptotic error bounds for both score estimation\nat O(d^{5/2} n^{-2/(k+5)}) and generated distribution at O(d^{5/4}\nn^{-1/2(k+5)}), primarily driven by the intrinsic factor dimension k rather\nthan the number of assets d, surpassing the dimension-dependent limits in the\nclassical nonparametric statistics literature and making the framework viable\nfor markets with thousands of assets. Numerical studies confirm superior\nperformance in latent subspace recovery under small data regimes. Empirical\nanalysis demonstrates the economic significance of our framework in\nconstructing mean-variance optimal portfolios and factor portfolios. This work\npresents the first theoretical integration of factor structure with diffusion\nmodels, offering a principled approach for high-dimensional financial\nsimulation with limited data.", "published": "2025-04-09 04:01:35", "link": "http://arxiv.org/abs/2504.06566v1", "categories": ["q-fin.ST", "cs.LG", "q-fin.MF"], "primary_category": "q-fin.ST"}
{"title": "Polyspectral Mean based Time Series Clustering of Indian Stock Market", "abstract": "In this study, we employ k-means clustering algorithm of polyspectral means\nto analyze 49 stocks in the Indian stock market. We have used spectral and\nbispectral information obtained from the data, by using spectral and bispectral\nmeans with different weight functions that will give us varying insights into\nthe temporal patterns of the stocks. In particular, the higher order\npolyspectral means can provide significantly more information than what we can\ngather from power spectra, and can also unveil nonlinear trends in a time\nseries. Through rigorous analysis, we identify five distinctive clusters,\nuncovering nuanced market structures. Notably, one cluster emerges as that of a\nconglomerate powerhouse, featuring ADANI, BIRLA, TATA, and unexpectedly,\ngovernment-owned bank SBI. Another cluster spotlights the IT sector with WIPRO\nand TCS, while a third combines private banks, government entities, and\nRELIANCE. The final cluster comprises publicly traded companies with dispersed\nownership. Such clustering of stocks sheds light on intricate financial\nrelationships within the stock market, providing valuable insights for\ninvestors and analysts navigating the dynamic landscape of the Indian stock\nmarket.", "published": "2025-04-09 16:36:39", "link": "http://arxiv.org/abs/2504.07021v1", "categories": ["q-fin.ST", "stat.AP"], "primary_category": "q-fin.ST"}
{"title": "Maximizing Battery Storage Profits via High-Frequency Intraday Trading", "abstract": "Maximizing revenue for grid-scale battery energy storage systems in\ncontinuous intraday electricity markets requires strategies that are able to\nseize trading opportunities as soon as new information arrives. This paper\nintroduces and evaluates an automated high-frequency trading strategy for\nbattery energy storage systems trading on the intraday market for power while\nexplicitly considering the dynamics of the limit order book, market rules, and\ntechnical parameters. The standard rolling intrinsic strategy is adapted for\ncontinuous intraday electricity markets and solved using a dynamic programming\napproximation that is two to three orders of magnitude faster than an exact\nmixed-integer linear programming solution. A detailed backtest over a full year\nof German order book data demonstrates that the proposed dynamic programming\nformulation does not reduce trading profits and enables the policy to react to\nevery relevant order book update, enabling realistic rapid backtesting. Our\nresults show the significant revenue potential of high-frequency trading: our\npolicy earns 58% more than when re-optimizing only once every hour and 14% more\nthan when re-optimizing once per minute, highlighting that profits critically\ndepend on trading speed. Furthermore, we leverage the speed of our algorithm to\ntrain a parametric extension of the rolling intrinsic, increasing yearly\nrevenue by 8.4% out of sample.", "published": "2025-04-09 14:38:09", "link": "http://arxiv.org/abs/2504.06932v2", "categories": ["q-fin.TR", "cs.SY", "eess.SY", "math.OC"], "primary_category": "q-fin.TR"}
{"title": "Optimal Execution and Macroscopic Market Making", "abstract": "We propose a stochastic game modelling the strategic interaction between\nmarket makers and traders of optimal execution type. For traders, the permanent\nprice impact commonly attributed to them is replaced by quoting strategies\nimplemented by market makers. For market makers, order flows become endogenous,\ndriven by tactical traders rather than assumed exogenously. Using the\nforward-backward stochastic differential equation (FBSDE) characterization of\nNash equilibria, we establish a local well-posedness result for the general\ngame. In the specific Almgren-Chriss-Avellaneda-Stoikov model, a decoupling\napproach guarantees the global well-posedness of the FBSDE system via the\nwell-posedness of an associated backward stochastic Riccati equation. Finally,\nby introducing small diffusion terms into the inventory processes, global\nwell-posedness is achieved for the approximation game.", "published": "2025-04-09 09:18:37", "link": "http://arxiv.org/abs/2504.06717v1", "categories": ["q-fin.TR"], "primary_category": "q-fin.TR"}
