{"title": "LOB-Bench: Benchmarking Generative AI for Finance -- an Application to Limit Order Book Data", "abstract": "While financial data presents one of the most challenging and interesting\nsequence modelling tasks due to high noise, heavy tails, and strategic\ninteractions, progress in this area has been hindered by the lack of consensus\non quantitative evaluation paradigms. To address this, we present LOB-Bench, a\nbenchmark, implemented in python, designed to evaluate the quality and realism\nof generative message-by-order data for limit order books (LOB) in the LOBSTER\nformat. Our framework measures distributional differences in conditional and\nunconditional statistics between generated and real LOB data, supporting\nflexible multivariate statistical evaluation. The benchmark also includes\nfeatures commonly used LOB statistics such as spread, order book volumes, order\nimbalance, and message inter-arrival times, along with scores from a trained\ndiscriminator network. Lastly, LOB-Bench contains \"market impact metrics\", i.e.\nthe cross-correlations and price response functions for specific events in the\ndata. We benchmark generative autoregressive state-space models, a (C)GAN, as\nwell as a parametric LOB model and find that the autoregressive GenAI approach\nbeats traditional model classes.", "published": "2025-02-13 10:56:58", "link": "http://arxiv.org/abs/2502.09172v1", "categories": ["cs.LG", "cs.CE", "q-fin.CP", "q-fin.TR"], "primary_category": "cs.LG"}
{"title": "Quantifying Cryptocurrency Unpredictability: A Comprehensive Study of Complexity and Forecasting", "abstract": "This paper offers a thorough examination of the univariate predictability in\ncryptocurrency time-series. By exploiting a combination of complexity measure\nand model predictions we explore the cryptocurrencies time-series forecasting\ntask focusing on the exchange rate in USD of Litecoin, Binance Coin, Bitcoin,\nEthereum, and XRP. On one hand, to assess the complexity and the randomness of\nthese time-series, a comparative analysis has been performed using Brownian and\ncolored noises as a benchmark. The results obtained from the Complexity-Entropy\ncausality plane and power density spectrum analysis reveal that cryptocurrency\ntime-series exhibit characteristics closely resembling those of Brownian noise\nwhen analyzed in a univariate context. On the other hand, the application of a\nwide range of statistical, machine and deep learning models for time-series\nforecasting demonstrates the low predictability of cryptocurrencies. Notably,\nour analysis reveals that simpler models such as Naive models consistently\noutperform the more complex machine and deep learning ones in terms of\nforecasting accuracy across different forecast horizons and time windows. The\ncombined study of complexity and forecasting accuracies highlights the\ndifficulty of predicting the cryptocurrency market. These findings provide\nvaluable insights into the inherent characteristics of the cryptocurrency data\nand highlight the need to reassess the challenges associated with predicting\ncryptocurrency's price movements.", "published": "2025-02-13 08:53:13", "link": "http://arxiv.org/abs/2502.09079v1", "categories": ["q-fin.ST", "cs.LG", "q-fin.CP"], "primary_category": "q-fin.ST"}
{"title": "A class of locally state-dependent models for forward curves", "abstract": "We present a dynamic model for forward curves within the Heath-Jarrow-Morton\nframework under the Musiela parametrization. The forward curves take values in\na function space H, and their dynamics follows a stochastic partial\ndifferential equation with state-dependent coefficients. In particular, the\ncoefficients are defined through point-wise operating maps on H, resulting in a\nlocally state-dependent structure. We first explore conditions under which\nthese point-wise operators are well defined on H. Next, we determine conditions\nto ensure that the resulting coefficient functions satisfy local growth and\nLipschitz properties, so to guarantee the existence and uniqueness of mild\nsolutions. The proposed model captures the behavior of the entire forward curve\nthrough a single equation, yet retains remarkable simplicity. Notably, we\ndemonstrate that certain one-dimensional projections of the model are Markovian\nand satisfy a one-dimensional stochastic differential equation. This connects\nour Hilbert-space approach to well established models for forward contracts\nwith fixed delivery times, for which existing formulas and numerical techniques\ncan be applied. This link allows us to examine also conditions for maintaining\npositivity of the solutions. As concrete examples, we analyze Hilbert-space\nvalued variants of an exponential model and of a constant elasticity of\nvariance model.", "published": "2025-02-13 16:47:25", "link": "http://arxiv.org/abs/2502.09486v2", "categories": ["math.PR", "q-fin.MF", "60H15, 60G07, 60J25"], "primary_category": "math.PR"}
{"title": "LOB-Bench: Benchmarking Generative AI for Finance -- an Application to Limit Order Book Data", "abstract": "While financial data presents one of the most challenging and interesting\nsequence modelling tasks due to high noise, heavy tails, and strategic\ninteractions, progress in this area has been hindered by the lack of consensus\non quantitative evaluation paradigms. To address this, we present LOB-Bench, a\nbenchmark, implemented in python, designed to evaluate the quality and realism\nof generative message-by-order data for limit order books (LOB) in the LOBSTER\nformat. Our framework measures distributional differences in conditional and\nunconditional statistics between generated and real LOB data, supporting\nflexible multivariate statistical evaluation. The benchmark also includes\nfeatures commonly used LOB statistics such as spread, order book volumes, order\nimbalance, and message inter-arrival times, along with scores from a trained\ndiscriminator network. Lastly, LOB-Bench contains \"market impact metrics\", i.e.\nthe cross-correlations and price response functions for specific events in the\ndata. We benchmark generative autoregressive state-space models, a (C)GAN, as\nwell as a parametric LOB model and find that the autoregressive GenAI approach\nbeats traditional model classes.", "published": "2025-02-13 10:56:58", "link": "http://arxiv.org/abs/2502.09172v2", "categories": ["cs.LG", "cs.CE", "q-fin.CP", "q-fin.TR"], "primary_category": "cs.LG"}
