{"title": "Multimodal Search on a Line", "abstract": "Inspired by the diverse set of technologies used in underground object\ndetection and imaging, we introduce a novel multimodal linear search problem\nwhereby a single searcher starts at the origin and must find a target that can\nonly be detected when the searcher moves through its location using the correct\nof $p$ possible search modes.\n  The target's location, its distance $d$ from the origin, and the correct\nsearch mode are all initially unknown to the searcher. We prove tight upper and\nlower bounds on the competitive ratio for this problem. Specifically, we show\nthat when $p$ is odd, the optimal competitive ratio is given by\n$2p+3+\\sqrt{8(p+1)}$, whereas when $p$ is even, the optimal competitive ratio\nis given by $c$: the unique solution to $(c-1)^4-4p(c+1)^2(c-p-1)=0$ in the\ninterval $\\left[2p+1+\\sqrt{8p},\\infty\\right)$. This solution $c$ has the\nexplicit bounds $2p+3+\\sqrt{8(p-1)}\\leq c\\leq 2p+3+\\sqrt{8p}$. The optimal\nalgorithms we propose require the searcher to move infinitesimal distances and\nchange directions infinitely many times within finite intervals. To better suit\npractical applications, we also propose an approximation algorithm with a\ncompetitive ratio of $c+\\varepsilon$ (where $c$ is the optimal competitive\nratio and $\\varepsilon > 0$ is an arbitrarily small constant). This algorithm\ninvolves the searcher moving finite distances and changing directions a finite\nnumber of times within any finite interval.", "published": "2025-02-10 19:50:54", "link": "http://arxiv.org/abs/2502.07000v2", "categories": ["cs.DM"], "primary_category": "cs.DM"}
{"title": "Minimal non-comparability graphs and semi-transitivity", "abstract": "The concept of word-representable graphs has been widely explored in the\nliterature. The class of word-representable graphs is characterized by the\nexistence of a semi-transitive orientation. Specifically, a graph is\nword-representable if and only if it admits such an orientation. Comparability\ngraphs form a subclass of word-representable graphs. Both word-representable\nand comparability graphs belong to hereditary graph classes. Every hereditary\nclass can be characterized in terms of their forbidden induced subgraphs. The\nminimal forbidden induced subgraphs of comparability graphs and\nword-representable graphs are referred to as minimal non-comparability graphs\nand minimal non-word-representable graphs, respectively.\n  While the complete set of minimal non-comparability graphs is known,\nidentifying the set of all minimal non-word-representable graphs remains an\nopen problem. In this paper, we precisely determine the set of all minimal\nnon-comparability graphs that are minimal non-word-representable graphs as\nwell. To achieve this, we categorize all minimal non-comparability graphs into\nthose that are semi-transitive and those that are not.\n  Furthermore, as a byproduct of our classification, we establish a\ncharacterization and a complete list of minimal non-word-representable graphs\nthat contain an all-adjacent vertex. This is accomplished by introducing an\nall-adjacent vertex to each minimal non-comparability graph that is\nsemi-transitive. As a result of our study, we identify several infinite\nfamilies of minimal non-word-representable graphs, expanding the understanding\nof their structural properties.", "published": "2025-02-10 19:18:42", "link": "http://arxiv.org/abs/2502.06979v1", "categories": ["cs.DM"], "primary_category": "cs.DM"}
{"title": "The Hajnal--Rothschild problem", "abstract": "For a family $\\mathcal F$ define $\\nu(\\mathcal F,t)$ as the largest $s$ for\nwhich there exist $A_1,\\ldots, A_{s}\\in \\mathcal F$ such that for $i\\ne j$ we\nhave $|A_i\\cap A_j|< t$. What is the largest family $\\mathcal\nF\\subset{[n]\\choose k}$ with $\\nu(\\mathcal F,t)\\le s$? This question goes back\nto a paper Hajnal and Rothschild from 1973. We show that, for some absolute $C$\nand $n>2k+Ct^{4/5}s^{1/5}(k-t)\\log_2^4n$, $n>2k+Cs(k-t)\\log_2^4 n$ the largest\nfamily with $\\nu(\\mathcal F,t)\\le s$ has the following structure: there are\nsets $X_1,\\ldots, X_s$ of sizes $t+2x_1,\\ldots, t+2x_s$, such that for any\n$A\\in \\mathcal F$ there is $i\\in [s]$ such that $|A\\cap X_i|\\ge t+x_i$. That\nis, the extremal constructions are unions of the extremal constructions in the\nComplete $t$-Intersection Theorem. For the proof, we enhance the spread\napproximation technique of Zakharov and the second author. In particular, we\nintroduce the idea of iterative spread approximation.", "published": "2025-02-10 17:24:56", "link": "http://arxiv.org/abs/2502.06699v1", "categories": ["math.CO", "cs.DM"], "primary_category": "math.CO"}
{"title": "Deciding Local Unitary Equivalence of Graph States in Quasi-Polynomial Time", "abstract": "We describe an algorithm with quasi-polynomial runtime $n^{\\log_2(n)+O(1)}$\nfor deciding local unitary (LU) equivalence of graph states. The algorithm\nbuilds on a recent graphical characterisation of LU-equivalence via generalised\nlocal complementation. By first transforming the corresponding graphs into a\nstandard form using usual local complementations, LU-equivalence reduces to the\nexistence of a single generalised local complementation that maps one graph to\nthe other. We crucially demonstrate that this reduces to solving a system of\nquasi-polynomially many linear equations, avoiding an exponential blow-up. As a\nbyproduct, we generalise Bouchet's algorithm for deciding local Clifford (LC)\nequivalence of graph states by allowing the addition of arbitrary linear\nconstraints. We also improve existing bounds on the size of graph states that\nare LU- but not LC-equivalent. While the smallest known examples involve 27\nqubits, and it is established that no such examples exist for up to 8 qubits,\nwe refine this bound by proving that LU- and LC-equivalence coincide for graph\nstates involving up to 19 qubits.", "published": "2025-02-10 15:34:41", "link": "http://arxiv.org/abs/2502.06566v1", "categories": ["quant-ph", "cs.DM"], "primary_category": "quant-ph"}
{"title": "Approximation Algorithms for Optimal Hopsets", "abstract": "For a given graph $G$, a \"hopset\" $H$ with hopbound $\\beta$ and stretch\n$\\alpha$ is a set of edges such that between every pair of vertices $u$ and\n$v$, there is a path with at most $\\beta$ hops in $G \\cup H$ that approximates\nthe distance between $u$ and $v$ up to a multiplicative stretch of $\\alpha$.\nHopsets have found a wide range of applications for distance-based problems in\nvarious computational models since the 90s. More recently, there has been\nsignificant interest in understanding these fundamental objects from an\nexistential and structural perspective. But all of this work takes a worst-case\n(or existential) point of view: How many edges do we need to add to satisfy a\ngiven hopbound and stretch requirement for any input graph?\n  We initiate the study of the natural optimization variant of this problem:\ngiven a specific graph instance, what is the minimum number of edges that\nsatisfy the hopbound and stretch requirements? We give approximation algorithms\nfor a generalized hopset problem which, when combined with known existential\nbounds, lead to different approximation guarantees for various regimes\ndepending on hopbound, stretch, and directed vs. undirected inputs. We\ncomplement our upper bounds with a lower bound that implies Label Cover\nhardness for directed hopsets and shortcut sets with hopbound at least $3$.", "published": "2025-02-10 14:47:41", "link": "http://arxiv.org/abs/2502.06522v1", "categories": ["cs.DS", "cs.DM"], "primary_category": "cs.DS"}
{"title": "Complete Compositional Syntax for Finite Transducers on Finite and Bi-Infinite Words", "abstract": "Minimizing finite automata, proving trace equivalence of labelled transition\nsystems or representing sofic subshifts involve very similar arguments, which\nsuggests the possibility of a unified formalism. We propose finite states\nnon-deterministic transducer as a lingua franca for automata theory, transition\nsystems, and sofic subshifts. We introduce a compositional diagrammatical\nsyntax for transducers in form of string diagrams interpreted as relations.\nThis syntax comes with sound rewriting rules allowing diagrammatical reasoning.\nOur main result is the completeness of our equational theory, ensuring that\nlanguage-equivalence, trace-equivalence, or subshift equivalence can always be\nproved using our rewriting rules.", "published": "2025-02-10 13:27:03", "link": "http://arxiv.org/abs/2502.06450v1", "categories": ["cs.LO", "cs.DM", "cs.FL"], "primary_category": "cs.LO"}
{"title": "On the Expressiveness of Rational ReLU Neural Networks With Bounded Depth", "abstract": "To confirm that the expressive power of ReLU neural networks grows with their\ndepth, the function $F_n = \\max \\{0,x_1,\\ldots,x_n\\}$ has been considered in\nthe literature. A conjecture by Hertrich, Basu, Di Summa, and Skutella [NeurIPS\n2021] states that any ReLU network that exactly represents $F_n$ has at least\n$\\lceil\\log_2 (n+1)\\rceil$ hidden layers. The conjecture has recently been\nconfirmed for networks with integer weights by Haase, Hertrich, and Loho [ICLR\n2023].\n  We follow up on this line of research and show that, within ReLU networks\nwhose weights are decimal fractions, $F_n$ can only be represented by networks\nwith at least $\\lceil\\log_3 (n+1)\\rceil$ hidden layers. Moreover, if all\nweights are $N$-ary fractions, then $F_n$ can only be represented by networks\nwith at least $\\Omega( \\frac{\\ln n}{\\ln \\ln N})$ layers. These results are a\npartial confirmation of the above conjecture for rational ReLU networks, and\nprovide the first non-constant lower bound on the depth of practically relevant\nReLU networks.", "published": "2025-02-10 09:26:35", "link": "http://arxiv.org/abs/2502.06283v2", "categories": ["cs.LG", "cs.DM"], "primary_category": "cs.LG"}
{"title": "TWICE: What Advantages Can Low-Resource Domain-Specific Embedding Model Bring? -- A Case Study on Korea Financial Texts", "abstract": "Domain specificity of embedding models is critical for effective performance.\nHowever, existing benchmarks, such as FinMTEB, are primarily designed for\nhigh-resource languages, leaving low-resource settings, such as Korean,\nunder-explored. Directly translating established English benchmarks often fails\nto capture the linguistic and cultural nuances present in low-resource domains.\nIn this paper, titled TWICE: What Advantages Can Low-Resource Domain-Specific\nEmbedding Models Bring? A Case Study on Korea Financial Texts, we introduce\nKorFinMTEB, a novel benchmark for the Korean financial domain, specifically\ntailored to reflect its unique cultural characteristics in low-resource\nlanguages. Our experimental results reveal that while the models perform\nrobustly on a translated version of FinMTEB, their performance on KorFinMTEB\nuncovers subtle yet critical discrepancies, especially in tasks requiring\ndeeper semantic understanding, that underscore the limitations of direct\ntranslation. This discrepancy highlights the necessity of benchmarks that\nincorporate language-specific idiosyncrasies and cultural nuances. The insights\nfrom our study advocate for the development of domain-specific evaluation\nframeworks that can more accurately assess and drive the progress of embedding\nmodels in low-resource settings.", "published": "2025-02-10 23:49:39", "link": "http://arxiv.org/abs/2502.07131v3", "categories": ["cs.CL", "q-fin.CP"], "primary_category": "cs.CL"}
{"title": "A nested MLMC framework for efficient simulations on FPGAs", "abstract": "Multilevel Monte Carlo (MLMC) reduces the total computational cost of\nfinancial option pricing by combining SDE approximations with multiple\nresolutions. This paper explores a further avenue for reducing cost and\nimproving power efficiency through the use of low precision calculations on\nconfigurable hardware devices such as Field-Programmable Gate Arrays (FPGAs).\nWe propose a new framework that exploits approximate random variables and\nfixed-point operations with optimised precision to generate most SDE paths with\na lower cost and reduce the overall cost of the MLMC framework. We first\ndiscuss several methods for the cheap generation of approximate random Normal\nincrements. To set the bit-width of variables in the path generation we then\npropose a rounding error model and optimise the precision of all variables on\neach MLMC level. With these key improvements, our proposed framework offers\nhigher computational savings than the existing mixed-precision MLMC frameworks.", "published": "2025-02-10 23:36:41", "link": "http://arxiv.org/abs/2502.07123v1", "categories": ["q-fin.CP", "cs.NA", "math.NA", "65C05, 91G60, 65G50, 65C10"], "primary_category": "q-fin.CP"}
