{"title": "Exploring the unleaved tree of numerical semigroups up to a given genus", "abstract": "We present a new algorithm to explore or count the numerical semigroups of a\ngiven genus which uses the unleaved version of the tree of numerical\nsemigroups. In the unleaved tree there are no leaves rather than the ones at\ndepth equal to the genus in consideration. For exloring the unleaved tree we\npresent a new encoding system of a numerical semigroup given by the gcd of its\nleft elements and its shrinking, that is, the semigroup generated by its left\nelements divided by their gcd. We show a method to determine the right\ngenerators and strong generators of a semigroup by means of the gcd and the\nshrinking encoding, as well as a method to encode a semigroup from the encoding\nof its parent or of its predecessor sibling. With the new algorithm we obtained\n$n_{76}=29028294421710227$ and $n_{77}=47008818196495180$.", "published": "2025-03-18 19:11:00", "link": "http://arxiv.org/abs/2503.14664v2", "categories": ["math.CO", "cs.DM", "math.AC", "06F05, 20M14, 05A99, 68W30"], "primary_category": "math.CO"}
{"title": "Sheaf-Theoretic Causal Emergence for Resilience Analysis in Distributed Systems", "abstract": "Distributed systems often exhibit emergent behaviors that impact their\nresilience (Franz-Kaiser et al., 2020; Adilson E. Motter, 2002; Jianxi Gao,\n2016). This paper presents a theoretical framework combining attributed graph\nmodels, flow-on-graph simulation, and sheaf-theoretic causal emergence analysis\nto evaluate system resilience. We model a distributed system as a graph with\nattributes (capturing component state and connections) and use sheaf theory to\nformalize how local interactions compose into global states. A flow simulation\non this graph propagates functional loads and failures. To assess resilience,\nwe apply the concept of causal emergence, quantifying whether macro-level\ndynamics (coarse-grained groupings) exhibit stronger causal efficacy (via\neffective information) than micro-level dynamics. The novelty lies in uniting\nsheaf-based formalization with causal metrics to identify emergent resilient\nstructures. We discuss limitless potential applications (illustrated by\nmicroservices, neural networks, and power grids) and outline future steps\ntoward implementing this framework (Lake et al., 2015).", "published": "2025-03-18 10:19:33", "link": "http://arxiv.org/abs/2503.14104v1", "categories": ["eess.SY", "cs.DM", "cs.IT", "cs.SE", "cs.SY", "math.IT", "G.2; G.3; E.4; H.1.1; D.2"], "primary_category": "eess.SY"}
{"title": "The Hierarchy of Saturating Matching Numbers", "abstract": "In this paper, we study three matching problems all of which came up quite\nrecently in the field of machine teaching. The cost of a matching is defined in\nsuch a way that, for some formal model of teaching, it equals (or bounds) the\nnumber of labeled examples needed to solve a given teaching task. We show how\nthe cost parameters associated with these problems depend on each other and how\nthey are related to other well known combinatorial parameters (like, for\ninstance, the VC-dimension).", "published": "2025-03-18 09:35:13", "link": "http://arxiv.org/abs/2503.14061v1", "categories": ["math.CO", "cs.DM", "68R05", "G.2.1"], "primary_category": "math.CO"}
{"title": "Color-Constrained Arborescences in Edge-Colored Digraphs", "abstract": "Given a multigraph $G$ whose edges are colored from the set\n$[q]:=\\{1,2,\\ldots,q\\}$ (\\emph{$q$-colored graph}), and a vector\n$\\alpha=(\\alpha_1,\\ldots,\\alpha_{q}) \\in \\mathbb{N}^{q}$\n(\\emph{color-constraint}), a subgraph $H$ of $G$ is called\n\\emph{$\\alpha$-colored}, if $H$ has exactly $\\alpha_i$ edges of color $i$ for\neach $i \\in[q]$. In this paper, we focus on $\\alpha$-colored arborescences\n(spanning out-trees) in $q$-colored multidigraphs. We study the decision,\ncounting and search versions of this problem. It is known that the decision and\nsearch problems are polynomial-time solvable when $q=2$ and that the decision\nproblem is NP-complete when $q$ is arbitrary. However the complexity status of\nthe problem for fixed $q$ was open for $q > 2$. We show that, for a $q$-colored\ndigraph $G$ and a vertex $s$ in $G$, the number of $\\alpha$-colored\narborescences in $G$ rooted at $s$ for all color-constraints $\\alpha \\in\n\\mathbb{N}^q$ can be read from the determinant of a symbolic matrix in $q-1$\nindeterminates. This result extends Tutte's matrix-tree theorem for directed\ngraphs and gives a polynomial-time algorithm for the counting and decision\nproblems for fixed $q$. We also use it to design an algorithm that finds an\n$\\alpha$-colored arborescence when one exists. Finally, we study the weighted\nvariant of the problem and give a polynomial-time algorithm (when $q$ is fixed)\nwhich finds a minimum weight solution.", "published": "2025-03-18 07:40:54", "link": "http://arxiv.org/abs/2503.13984v1", "categories": ["cs.DS", "cs.CC", "cs.DM", "math.CO", "G.2.2"], "primary_category": "cs.DS"}
{"title": "Determining a credit transition matrix from cumulative default probabilities", "abstract": "To quantify the changes in the credit rating of a bond is an important\nmathematical problem for the credit rating industry. To think of the credit\nrating as the state a Markov chain is an interesting proposal leading to\nchallenges in mathematical modeling. Since cumulative default rates are more\nreadily measurable than credit migrations, a natural question is whether the\ncredit transition matrix (CTM) can be determined from the knowledge of the\ncumulative default probabilities.\n  Here we use a connection between the CTM and the cumulative default\nprobabilities to setup an ill-posed, linear inverse problem with box\nconstraints, which we solve by an entropy minimization procedure. This approach\nis interesting on several counts. On the one hand, we may have less data that\nunknowns, and on the other hand, even when we have as much data as unknowns,\nthe matrix connecting them may not be invertible, which makes the problem\nill-posed.\n  Besides developing the tools to solve the problem, we apply it to several\ntest cases to check the performance of the method. The results are quite\nsatisfactory.", "published": "2025-03-18 18:46:38", "link": "http://arxiv.org/abs/2503.14646v1", "categories": ["q-fin.CP", "60J22, 62M05 62P200, 62M99, 15A29, 15A06, 90C25, 90C51, 90C99"], "primary_category": "q-fin.CP"}
{"title": "Rolling Forward: Enhancing LightGCN with Causal Graph Convolution for Credit Bond Recommendation", "abstract": "Graph Neural Networks have significantly advanced research in recommender\nsystems over the past few years. These methods typically capture global\ninterests using aggregated past interactions and rely on static embeddings of\nusers and items over extended periods of time. While effective in some domains,\nthese methods fall short in many real-world scenarios, especially in finance,\nwhere user interests and item popularity evolve rapidly over time. To address\nthese challenges, we introduce a novel extension to Light Graph Convolutional\nNetwork (LightGCN) designed to learn temporal node embeddings that capture\ndynamic interests. Our approach employs causal convolution to maintain a\nforward-looking model architecture. By preserving the chronological order of\nuser-item interactions and introducing a dynamic update mechanism for\nembeddings through a sliding window, the proposed model generates well-timed\nand contextually relevant recommendations. Extensive experiments on a\nreal-world dataset from BNP Paribas demonstrate that our approach significantly\nenhances the performance of LightGCN while maintaining the simplicity and\nefficiency of its architecture. Our findings provide new insights into\ndesigning graph-based recommender systems in time-sensitive applications,\nparticularly for financial product recommendations.", "published": "2025-03-18 12:47:01", "link": "http://arxiv.org/abs/2503.14213v1", "categories": ["cs.IR", "cs.LG", "q-fin.CP"], "primary_category": "cs.IR"}
{"title": "Capturing Smile Dynamics with the Quintic Volatility Model: SPX, Skew-Stickiness Ratio and VIX", "abstract": "We introduce the two-factor Quintic Ornstein-Uhlenbeck model, where\nvolatility is modeled as a polynomial of degree five based on the sum of two\nOrnstein-Uhlenbeck processes driven by the same Brownian Motion, each\nmean-reverting at a different speed. We demonstrate that the Quintic model\neffectively captures the volatility surfaces of SPX and VIX while aligning with\nthe skew-stickiness ratio (SSR) across maturities ranging from a few days to\nover two years. Furthermore, the Quintic model shows consistency with key\nempirical stylized facts, notably reproducing the Zumbach effect.", "published": "2025-03-18 11:30:53", "link": "http://arxiv.org/abs/2503.14158v1", "categories": ["q-fin.MF"], "primary_category": "q-fin.MF"}
{"title": "Collective completeness and pricing hedging duality", "abstract": "This paper builds on \"Collective Arbitrage and the Value of Cooperation\" by\nBiagini et al. (2025, forthcoming in \"Finance and Stochastics\"), which\nintroduced in discrete time the notions of collective arbitrage and\nsuper-replication in a multi-agent market framework, where agents may operate\nin several submarkets and collaborate through risk exchange mechanisms.\nExpanding on these foundations, we establish a First Fundamental Theorem of\nAsset Pricing and a collective pricing-hedging duality under different\nassumptions and with new techniques compared to Biagini et al. (2025). We\nfurther introduce the notion of collective replication in order to study\ncollective market completeness and provide a Second Fundamental Theorem of\nAsset Pricing in this cooperative multi-agent setting.", "published": "2025-03-18 10:03:17", "link": "http://arxiv.org/abs/2503.14086v1", "categories": ["q-fin.MF"], "primary_category": "q-fin.MF"}
{"title": "On weak notions of no-arbitrage in a 1D general diffusion market with interest rates", "abstract": "We establish deterministic necessary and sufficient conditions for the\nno-arbitrage notions \"no increasing profit\" (NIP), \"no strong arbitrage\" (NSA)\nand \"no unbounded profit with bounded risk\" (NUPBR) in one-dimensional general\ndiffusion markets. These are markets with one risky asset, which is modeled as\na regular continuous strong Markov process that is also a semimartingale, and a\nriskless asset that grows exponentially at a constant rate $r\\in \\mathbb{R}$.\nAll deterministic criteria are provided in terms of the scale function and the\nspeed measure of the risky asset process. Our study reveals a variety of\nsurprising effects. For instance, irrespective of the interest rate, NIP is not\nexcluded by reflecting boundaries or an irregular scale function. In the case\nof non-zero interest rates, it is even possible that NUPBR holds in the\npresence of reflecting boundaries and/or skew thresholds. In the zero interest\nrate regime, we also identify NSA as the minimal no arbitrage notion that\nexcludes reflecting boundaries and that forces the scale function to be\ncontinuously differentiable with strictly positive absolutely continuous\nderivative, meaning that it is of the same form as for a stochastic\ndifferential equation.", "published": "2025-03-18 09:55:39", "link": "http://arxiv.org/abs/2503.14078v1", "categories": ["q-fin.MF", "math.PR"], "primary_category": "q-fin.MF"}
{"title": "A Note on the Asymptotic Properties of the GLS Estimator in Multivariate Regression with Heteroskedastic and Autocorrelated Errors", "abstract": "We study the asymptotic properties of the GLS estimator in multivariate\nregression with heteroskedastic and autocorrelated errors. We derive Wald\nstatistics for linear restrictions and assess their performance. The statistics\nremains robust to heteroskedasticity and autocorrelation.", "published": "2025-03-18 06:37:09", "link": "http://arxiv.org/abs/2503.13950v1", "categories": ["econ.EM", "q-fin.ST", "stat.ME"], "primary_category": "econ.EM"}
