{"title": "Merging Hazy Sets with m-Schemes: A Geometric Approach to Data Visualization", "abstract": "Many machine learning algorithms try to visualize high dimensional metric\ndata in 2D in such a way that the essential geometric and topological features\nof the data are highlighted. In this paper, we introduce a framework for\naggregating dissimilarity functions that arise from locally adjusting a metric\nthrough density-aware normalization, as employed in the IsUMap method. We\nformalize these approaches as m-schemes, a class of methods closely related to\nt-norms and t-conorms in probabilistic metrics, as well as to composition laws\nin information theory. These m-schemes provide a flexible and theoretically\ngrounded approach to refining distance-based embeddings.", "published": "2025-03-03 15:40:08", "link": "http://arxiv.org/abs/2503.01664v1", "categories": ["cs.LG", "cs.DM", "math.MG", "51F04, 51-04, 18-02, 51H99", "G.2.3; I.2.m"], "primary_category": "cs.LG"}
{"title": "Metric-Based Granular Computing in Networks", "abstract": "Networks can be highly complex systems with numerous interconnected\ncomponents and interactions. Granular computing offers a framework to manage\nthis complexity by decomposing networks into smaller, more manageable\ncomponents, or granules. In this article, we introduce metric-based granular\ncomputing technique to study networks. This technique can be applied to the\nanalysis of networks where granules can represent subsets of nodes or edges and\ntheir interactions can be studied at different levels of granularity. We model\nthe network as an information system and investigate its granular structures\nusing metric representation. We establish that the concepts of reducts in rough\nset theory and resolving sets in networks are equivalent. Through this\nequivalence, we present a novel approach for computing all the minimal\nresolving sets of these networks.", "published": "2025-03-03 07:34:10", "link": "http://arxiv.org/abs/2503.02901v1", "categories": ["cs.SI", "cs.DM", "05C12, 05A18, 05C62"], "primary_category": "cs.SI"}
{"title": "Hybrid Metaheuristic Vehicle Routing Problem for Security Dispatch Operations", "abstract": "This paper investigates the optimization of the Vehicle Routing Problem for\nSecurity Dispatch (VRPSD). VRPSD focuses on security and patrolling\napplications which involve challenging constraints including precise timing and\nstrict time windows. We propose three algorithms based on different\nmetaheuristics, which are Adaptive Large Neighborhood Search (ALNS), Tabu\nSearch (TS), and Threshold Accepting (TA). The first algorithm combines\nsingle-phase ALNS with TA, the second employs a multiphase ALNS with TA, and\nthe third integrates multiphase ALNS, TS, and TA. Experiments are conducted on\nan instance comprising 251 customer requests. The results demonstrate that the\nthird algorithm, the hybrid multiphase ALNS-TS-TA algorithm, delivers the best\nperformance. This approach simultaneously leverages the large-area search\ncapabilities of ALNS for exploration and effectively escapes local optima when\nthe multiphase ALNS is coupled with TS and TA. Furthermore, in our experiments,\nthe hybrid multiphase ALNS-TS-TA algorithm is the only one that shows potential\nfor improving results with increased computation time across all attempts.", "published": "2025-03-03 02:58:49", "link": "http://arxiv.org/abs/2503.01121v1", "categories": ["cs.AI", "cs.DM", "math.OC"], "primary_category": "cs.AI"}
{"title": "The Volterra Stein-Stein model with stochastic interest rates", "abstract": "We introduce the Volterra Stein-Stein model with stochastic interest rates,\nwhere both volatility and interest rates are driven by correlated Gaussian\nVolterra processes. This framework unifies various well-known Markovian and\nnon-Markovian models while preserving analytical tractability for pricing and\nhedging financial derivatives. We derive explicit formulas for pricing\nzero-coupon bond and interest rate cap or floor, along with a semi-explicit\nexpression for the characteristic function of the log-forward index using\nFredholm resolvents and determinants. This allows for fast and efficient\nderivative pricing and calibration via Fourier methods. We calibrate our model\nto market data and observe that our framework is flexible enough to capture key\nempirical features, such as the humped-shaped term structure of ATM implied\nvolatilities for cap options and the concave ATM implied volatility skew term\nstructure (in log-log scale) of the S&P 500 options. Finally, we establish\nconnections between our characteristic function formula and expressions that\ndepend on infinite-dimensional Riccati equations, thereby making the link with\nconventional linear-quadratic models.", "published": "2025-03-03 16:32:35", "link": "http://arxiv.org/abs/2503.01716v1", "categories": ["q-fin.MF", "q-fin.PR"], "primary_category": "q-fin.MF"}
{"title": "\\textsc{Perseus}: Tracing the Masterminds Behind Cryptocurrency Pump-and-Dump Schemes", "abstract": "Masterminds are entities organizing, coordinating, and orchestrating\ncryptocurrency pump-and-dump schemes, a form of trade-based manipulation\nundermining market integrity and causing financial losses for unwitting\ninvestors. Previous research detects pump-and-dump activities in the market,\npredicts the target cryptocurrency, and examines investors and \\ac{osn}\nentities. However, these solutions do not address the root cause of the\nproblem. There is a critical gap in identifying and tracing the masterminds\ninvolved in these schemes. In this research, we develop a detection system\n\\textsc{Perseus}, which collects real-time data from the \\acs{osn} and\ncryptocurrency markets. \\textsc{Perseus} then constructs temporal attributed\ngraphs that preserve the direction of information diffusion and the structure\nof the community while leveraging \\ac{gnn} to identify the masterminds behind\npump-and-dump activities. Our design of \\textsc{Perseus} leads to higher F1\nscores and precision than the \\ac{sota} fraud detection method, achieving fast\ntraining and inferring speeds. Deployed in the real world from February 16 to\nOctober 9 2024, \\textsc{Perseus} successfully detects $438$ masterminds who are\nefficient in the pump-and-dump information diffusion networks. \\textsc{Perseus}\nprovides regulators with an explanation of the risks of masterminds and\noversight capabilities to mitigate the pump-and-dump schemes of cryptocurrency.", "published": "2025-03-03 15:59:40", "link": "http://arxiv.org/abs/2503.01686v1", "categories": ["cs.CY", "cs.LG", "q-fin.TR"], "primary_category": "cs.CY"}
{"title": "A New Traders' Game? -- Response Functions in a Historical Perspective", "abstract": "Traders on financial markets generate non-Markovian effects in various ways,\nparticularly through their competition with one another which can be\ninterpreted as a game between different (types of) traders. To quantify the\nmarket mechanisms, we analyze self-response functions for pairs of different\nstocks and the corresponding trade sign correlators. While the non-Markovian\ndynamics in the self-responses is liquidity-driven, it is expectation-driven in\nthe cross-responses which is related to the emergence of correlations. We study\nthe non-stationarity of theses responses over time. In our previous analysis,\nwe only investigated the crisis year 2008. We now considerably extend this by\nalso analyzing the years 2007, 2014 and 2021. To improve statistics, we also\nwork out averaged response functions for the different years. We find\nsignificant variations over time revealing changes in the traders' game.", "published": "2025-03-03 15:04:46", "link": "http://arxiv.org/abs/2503.01629v1", "categories": ["q-fin.TR"], "primary_category": "q-fin.TR"}
