{"title": "Rep-MTL: Unleashing the Power of Representation-level Task Saliency for Multi-Task Learning", "abstract": "Despite the promise of Multi-Task Learning in leveraging complementary\nknowledge across tasks, existing multi-task optimization (MTO) techniques\nremain fixated on resolving conflicts via optimizer-centric loss scaling and\ngradient manipulation strategies, yet fail to deliver consistent gains. In this\npaper, we argue that the shared representation space, where task interactions\nnaturally occur, offers rich information and potential for operations\ncomplementary to existing optimizers, especially for facilitating the\ninter-task complementarity, which is rarely explored in MTO. This intuition\nleads to Rep-MTL, which exploits the representation-level task saliency to\nquantify interactions between task-specific optimization and shared\nrepresentation learning. By steering these saliencies through entropy-based\npenalization and sample-wise cross-task alignment, Rep-MTL aims to mitigate\nnegative transfer by maintaining the effective training of individual tasks\ninstead pure conflict-solving, while explicitly promoting complementary\ninformation sharing. Experiments are conducted on four challenging MTL\nbenchmarks covering both task-shift and domain-shift scenarios. The results\nshow that Rep-MTL, even paired with the basic equal weighting policy, achieves\ncompetitive performance gains with favorable efficiency. Beyond standard\nperformance metrics, Power Law exponent analysis demonstrates Rep-MTL's\nefficacy in balancing task-specific learning and cross-task sharing. The\nproject page is available at HERE.", "published": "2025-07-28 17:59:28", "link": "http://arxiv.org/abs/2507.21049v1", "categories": ["cs.LG", "cs.CV"], "primary_category": "cs.LG"}
{"title": "Reconstructing 4D Spatial Intelligence: A Survey", "abstract": "Reconstructing 4D spatial intelligence from visual observations has long been\na central yet challenging task in computer vision, with broad real-world\napplications. These range from entertainment domains like movies, where the\nfocus is often on reconstructing fundamental visual elements, to embodied AI,\nwhich emphasizes interaction modeling and physical realism. Fueled by rapid\nadvances in 3D representations and deep learning architectures, the field has\nevolved quickly, outpacing the scope of previous surveys. Additionally,\nexisting surveys rarely offer a comprehensive analysis of the hierarchical\nstructure of 4D scene reconstruction. To address this gap, we present a new\nperspective that organizes existing methods into five progressive levels of 4D\nspatial intelligence: (1) Level 1 -- reconstruction of low-level 3D attributes\n(e.g., depth, pose, and point maps); (2) Level 2 -- reconstruction of 3D scene\ncomponents (e.g., objects, humans, structures); (3) Level 3 -- reconstruction\nof 4D dynamic scenes; (4) Level 4 -- modeling of interactions among scene\ncomponents; and (5) Level 5 -- incorporation of physical laws and constraints.\nWe conclude the survey by discussing the key challenges at each level and\nhighlighting promising directions for advancing toward even richer levels of 4D\nspatial intelligence. To track ongoing developments, we maintain an up-to-date\nproject page: https://github.com/yukangcao/Awesome-4D-Spatial-Intelligence.", "published": "2025-07-28 17:59:02", "link": "http://arxiv.org/abs/2507.21045v1", "categories": ["cs.CV"], "primary_category": "cs.CV"}
{"title": "GPT-IMAGE-EDIT-1.5M: A Million-Scale, GPT-Generated Image Dataset", "abstract": "Recent advancements in large multimodal models like GPT-4o have set a new\nstandard for high-fidelity, instruction-guided image editing. However, the\nproprietary nature of these models and their training data creates a\nsignificant barrier for open-source research. To bridge this gap, we introduce\nGPT-IMAGE-EDIT-1.5M, a publicly available, large-scale image-editing corpus\ncontaining more than 1.5 million high-quality triplets (instruction, source\nimage, edited image). We systematically construct this dataset by leveraging\nthe versatile capabilities of GPT-4o to unify and refine three popular\nimage-editing datasets: OmniEdit, HQ-Edit, and UltraEdit. Specifically, our\nmethodology involves 1) regenerating output images to enhance visual quality\nand instruction alignment, and 2) selectively rewriting prompts to improve\nsemantic clarity. To validate the efficacy of our dataset, we fine-tune\nadvanced open-source models on GPT-IMAGE-EDIT-1.5M. The empirical results are\nexciting, e.g., the fine-tuned FluxKontext achieves highly competitive\nperformance across a comprehensive suite of benchmarks, including 7.24 on\nGEdit-EN, 3.80 on ImgEdit-Full, and 8.78 on Complex-Edit, showing stronger\ninstruction following and higher perceptual quality while maintaining identity.\nThese scores markedly exceed all previously published open-source methods and\nsubstantially narrow the gap to leading proprietary models. We hope the full\nrelease of GPT-IMAGE-EDIT-1.5M can help to catalyze further open research in\ninstruction-guided image editing.", "published": "2025-07-28 17:54:04", "link": "http://arxiv.org/abs/2507.21033v1", "categories": ["cs.CV"], "primary_category": "cs.CV"}
{"title": "Deep Learning for Skeleton Based Human Motion Rehabilitation Assessment: A Benchmark", "abstract": "Automated assessment of human motion plays a vital role in rehabilitation,\nenabling objective evaluation of patient performance and progress. Unlike\ngeneral human activity recognition, rehabilitation motion assessment focuses on\nanalyzing the quality of movement within the same action class, requiring the\ndetection of subtle deviations from ideal motion. Recent advances in deep\nlearning and video-based skeleton extraction have opened new possibilities for\naccessible, scalable motion assessment using affordable devices such as\nsmartphones or webcams. However, the field lacks standardized benchmarks,\nconsistent evaluation protocols, and reproducible methodologies, limiting\nprogress and comparability across studies. In this work, we address these gaps\nby (i) aggregating existing rehabilitation datasets into a unified archive\ncalled Rehab-Pile, (ii) proposing a general benchmarking framework for\nevaluating deep learning methods in this domain, and (iii) conducting extensive\nbenchmarking of multiple architectures across classification and regression\ntasks. All datasets and implementations are released to the community to\nsupport transparency and reproducibility. This paper aims to establish a solid\nfoundation for future research in automated rehabilitation assessment and\nfoster the development of reliable, accessible, and personalized rehabilitation\nsolutions. The datasets, source-code and results of this article are all\npublicly available.", "published": "2025-07-28 17:39:03", "link": "http://arxiv.org/abs/2507.21018v1", "categories": ["cs.CV", "cs.LG"], "primary_category": "cs.CV"}
{"title": "Learning Transferable Facial Emotion Representations from Large-Scale Semantically Rich Captions", "abstract": "Current facial emotion recognition systems are predominately trained to\npredict a fixed set of predefined categories or abstract dimensional values.\nThis constrained form of supervision hinders generalization and applicability,\nas it reduces the rich and nuanced spectrum of emotions into oversimplified\nlabels or scales. In contrast, natural language provides a more flexible,\nexpressive, and interpretable way to represent emotions, offering a much\nbroader source of supervision. Yet, leveraging semantically rich natural\nlanguage captions as supervisory signals for facial emotion representation\nlearning remains relatively underexplored, primarily due to two key challenges:\n1) the lack of large-scale caption datasets with rich emotional semantics, and\n2) the absence of effective frameworks tailored to harness such rich\nsupervision. To this end, we introduce EmoCap100K, a large-scale facial emotion\ncaption dataset comprising over 100,000 samples, featuring rich and structured\nsemantic descriptions that capture both global affective states and\nfine-grained local facial behaviors. Building upon this dataset, we further\npropose EmoCapCLIP, which incorporates a joint global-local contrastive\nlearning framework enhanced by a cross-modal guided positive mining module.\nThis design facilitates the comprehensive exploitation of multi-level caption\ninformation while accommodating semantic similarities between closely related\nexpressions. Extensive evaluations on over 20 benchmarks covering five tasks\ndemonstrate the superior performance of our method, highlighting the promise of\nlearning facial emotion representations from large-scale semantically rich\ncaptions. The code and data will be available at\nhttps://github.com/sunlicai/EmoCapCLIP.", "published": "2025-07-28 17:28:08", "link": "http://arxiv.org/abs/2507.21015v1", "categories": ["cs.CV"], "primary_category": "cs.CV"}
{"title": "Improving Adversarial Robustness Through Adaptive Learning-Driven Multi-Teacher Knowledge Distillation", "abstract": "Convolutional neural networks (CNNs) excel in computer vision but are\nsusceptible to adversarial attacks, crafted perturbations designed to mislead\npredictions. Despite advances in adversarial training, a gap persists between\nmodel accuracy and robustness. To mitigate this issue, in this paper, we\npresent a multi-teacher adversarial robustness distillation using an adaptive\nlearning strategy. Specifically, our proposed method first trained multiple\nclones of a baseline CNN model using an adversarial training strategy on a pool\nof perturbed data acquired through different adversarial attacks. Once trained,\nthese adversarially trained models are used as teacher models to supervise the\nlearning of a student model on clean data using multi-teacher knowledge\ndistillation. To ensure an effective robustness distillation, we design an\nadaptive learning strategy that controls the knowledge contribution of each\nmodel by assigning weights as per their prediction precision. Distilling\nknowledge from adversarially pre-trained teacher models not only enhances the\nlearning capabilities of the student model but also empowers it with the\ncapacity to withstand different adversarial attacks, despite having no exposure\nto adversarial data. To verify our claims, we extensively evaluated our\nproposed method on MNIST-Digits and Fashion-MNIST datasets across diverse\nexperimental settings. The obtained results exhibit the efficacy of our\nmulti-teacher adversarial distillation and adaptive learning strategy,\nenhancing CNNs' adversarial robustness against various adversarial attacks.", "published": "2025-07-28 17:08:40", "link": "http://arxiv.org/abs/2507.20996v1", "categories": ["cs.CV"], "primary_category": "cs.CV"}
{"title": "Security Tensors as a Cross-Modal Bridge: Extending Text-Aligned Safety to Vision in LVLM", "abstract": "Large visual-language models (LVLMs) integrate aligned large language models\n(LLMs) with visual modules to process multimodal inputs. However, the safety\nmechanisms developed for text-based LLMs do not naturally extend to visual\nmodalities, leaving LVLMs vulnerable to harmful image inputs. To address this\ncross-modal safety gap, we introduce security tensors - trainable input vectors\napplied during inference through either the textual or visual modality. These\ntensors transfer textual safety alignment to visual processing without\nmodifying the model's parameters. They are optimized using a curated dataset\ncontaining (i) malicious image-text pairs requiring rejection, (ii) contrastive\nbenign pairs with text structurally similar to malicious queries, with the\npurpose of being contrastive examples to guide visual reliance, and (iii)\ngeneral benign samples preserving model functionality. Experimental results\ndemonstrate that both textual and visual security tensors significantly enhance\nLVLMs' ability to reject diverse harmful visual inputs while maintaining\nnear-identical performance on benign tasks. Further internal analysis towards\nhidden-layer representations reveals that security tensors successfully\nactivate the language module's textual \"safety layers\" in visual inputs,\nthereby effectively extending text-based safety to the visual modality.", "published": "2025-07-28 16:59:53", "link": "http://arxiv.org/abs/2507.20994v1", "categories": ["cs.CV", "cs.AI"], "primary_category": "cs.CV"}
{"title": "JWB-DH-V1: Benchmark for Joint Whole-Body Talking Avatar and Speech Generation Version 1", "abstract": "Recent advances in diffusion-based video generation have enabled\nphoto-realistic short clips, but current methods still struggle to achieve\nmulti-modal consistency when jointly generating whole-body motion and natural\nspeech. Current approaches lack comprehensive eval- uation frameworks that\nassess both visual and audio quality, and there are insufficient benchmarks for\nregion- specific performance analysis. To address these gaps, we introduce the\nJoint Whole-Body Talking Avatar and Speech Generation Version I(JWB-DH-V1),\ncomprising a large-scale multi-modal dataset with 10,000 unique identities\nacross 2 million video samples, and an evalua- tion protocol for assessing\njoint audio-video generation of whole-body animatable avatars. Our evaluation\nof SOTA models reveals consistent performance disparities between\nface/hand-centric and whole-body performance, which incidates essential areas\nfor future research. The dataset and evaluation tools are publicly available at\nhttps://github.com/deepreasonings/WholeBodyBenchmark.", "published": "2025-07-28 16:47:44", "link": "http://arxiv.org/abs/2507.20987v1", "categories": ["cs.CV", "cs.AI"], "primary_category": "cs.CV"}
{"title": "LargeMvC-Net: Anchor-based Deep Unfolding Network for Large-scale Multi-view Clustering", "abstract": "Deep anchor-based multi-view clustering methods enhance the scalability of\nneural networks by utilizing representative anchors to reduce the computational\ncomplexity of large-scale clustering. Despite their scalability advantages,\nexisting approaches often incorporate anchor structures in a heuristic or\ntask-agnostic manner, either through post-hoc graph construction or as\nauxiliary components for message passing. Such designs overlook the core\nstructural demands of anchor-based clustering, neglecting key optimization\nprinciples. To bridge this gap, we revisit the underlying optimization problem\nof large-scale anchor-based multi-view clustering and unfold its iterative\nsolution into a novel deep network architecture, termed LargeMvC-Net. The\nproposed model decomposes the anchor-based clustering process into three\nmodules: RepresentModule, NoiseModule, and AnchorModule, corresponding to\nrepresentation learning, noise suppression, and anchor indicator estimation.\nEach module is derived by unfolding a step of the original optimization\nprocedure into a dedicated network component, providing structural clarity and\noptimization traceability. In addition, an unsupervised reconstruction loss\naligns each view with the anchor-induced latent space, encouraging consistent\nclustering structures across views. Extensive experiments on several\nlarge-scale multi-view benchmarks show that LargeMvC-Net consistently\noutperforms state-of-the-art methods in terms of both effectiveness and\nscalability.", "published": "2025-07-28 16:43:11", "link": "http://arxiv.org/abs/2507.20980v1", "categories": ["cs.CV", "stat.CO", "stat.ML"], "primary_category": "cs.CV"}
{"title": "Adapting Vehicle Detectors for Aerial Imagery to Unseen Domains with Weak Supervision", "abstract": "Detecting vehicles in aerial imagery is a critical task with applications in\ntraffic monitoring, urban planning, and defense intelligence. Deep learning\nmethods have provided state-of-the-art (SOTA) results for this application.\nHowever, a significant challenge arises when models trained on data from one\ngeographic region fail to generalize effectively to other areas. Variability in\nfactors such as environmental conditions, urban layouts, road networks, vehicle\ntypes, and image acquisition parameters (e.g., resolution, lighting, and angle)\nleads to domain shifts that degrade model performance. This paper proposes a\nnovel method that uses generative AI to synthesize high-quality aerial images\nand their labels, improving detector training through data augmentation. Our\nkey contribution is the development of a multi-stage, multi-modal knowledge\ntransfer framework utilizing fine-tuned latent diffusion models (LDMs) to\nmitigate the distribution gap between the source and target environments.\nExtensive experiments across diverse aerial imagery domains show consistent\nperformance improvements in AP50 over supervised learning on source domain\ndata, weakly supervised adaptation methods, unsupervised domain adaptation\nmethods, and open-set object detectors by 4-23%, 6-10%, 7-40%, and more than\n50%, respectively. Furthermore, we introduce two newly annotated aerial\ndatasets from New Zealand and Utah to support further research in this field.\nProject page is available at: https://humansensinglab.github.io/AGenDA", "published": "2025-07-28 16:38:06", "link": "http://arxiv.org/abs/2507.20976v1", "categories": ["cs.CV"], "primary_category": "cs.CV"}
{"title": "Model-Agnostic Gender Bias Control for Text-to-Image Generation via Sparse Autoencoder", "abstract": "Text-to-image (T2I) diffusion models often exhibit gender bias, particularly\nby generating stereotypical associations between professions and gendered\nsubjects. This paper presents SAE Debias, a lightweight and model-agnostic\nframework for mitigating such bias in T2I generation. Unlike prior approaches\nthat rely on CLIP-based filtering or prompt engineering, which often require\nmodel-specific adjustments and offer limited control, SAE Debias operates\ndirectly within the feature space without retraining or architectural\nmodifications. By leveraging a k-sparse autoencoder pre-trained on a gender\nbias dataset, the method identifies gender-relevant directions within the\nsparse latent space, capturing professional stereotypes. Specifically, a biased\ndirection per profession is constructed from sparse latents and suppressed\nduring inference to steer generations toward more gender-balanced outputs.\nTrained only once, the sparse autoencoder provides a reusable debiasing\ndirection, offering effective control and interpretable insight into biased\nsubspaces. Extensive evaluations across multiple T2I models, including Stable\nDiffusion 1.4, 1.5, 2.1, and SDXL, demonstrate that SAE Debias substantially\nreduces gender bias while preserving generation quality. To the best of our\nknowledge, this is the first work to apply sparse autoencoders for identifying\nand intervening in gender bias within T2I models. These findings contribute\ntoward building socially responsible generative AI, providing an interpretable\nand model-agnostic tool to support fairness in text-to-image generation.", "published": "2025-07-28 16:36:13", "link": "http://arxiv.org/abs/2507.20973v1", "categories": ["cs.LG", "cs.CV"], "primary_category": "cs.LG"}
{"title": "GTAD: Global Temporal Aggregation Denoising Learning for 3D Semantic Occupancy Prediction", "abstract": "Accurately perceiving dynamic environments is a fundamental task for\nautonomous driving and robotic systems. Existing methods inadequately utilize\ntemporal information, relying mainly on local temporal interactions between\nadjacent frames and failing to leverage global sequence information\neffectively. To address this limitation, we investigate how to effectively\naggregate global temporal features from temporal sequences, aiming to achieve\noccupancy representations that efficiently utilize global temporal information\nfrom historical observations. For this purpose, we propose a global temporal\naggregation denoising network named GTAD, introducing a global temporal\ninformation aggregation framework as a new paradigm for holistic 3D scene\nunderstanding. Our method employs an in-model latent denoising network to\naggregate local temporal features from the current moment and global temporal\nfeatures from historical sequences. This approach enables the effective\nperception of both fine-grained temporal information from adjacent frames and\nglobal temporal patterns from historical observations. As a result, it provides\na more coherent and comprehensive understanding of the environment. Extensive\nexperiments on the nuScenes and Occ3D-nuScenes benchmark and ablation studies\ndemonstrate the superiority of our method.", "published": "2025-07-28 16:18:29", "link": "http://arxiv.org/abs/2507.20963v1", "categories": ["cs.CV"], "primary_category": "cs.CV"}
{"title": "Mask-Free Audio-driven Talking Face Generation for Enhanced Visual Quality and Identity Preservation", "abstract": "Audio-Driven Talking Face Generation aims at generating realistic videos of\ntalking faces, focusing on accurate audio-lip synchronization without\ndeteriorating any identity-related visual details. Recent state-of-the-art\nmethods are based on inpainting, meaning that the lower half of the input face\nis masked, and the model fills the masked region by generating lips aligned\nwith the given audio. Hence, to preserve identity-related visual details from\nthe lower half, these approaches additionally require an unmasked identity\nreference image randomly selected from the same video. However, this common\nmasking strategy suffers from (1) information loss in the input faces,\nsignificantly affecting the networks' ability to preserve visual quality and\nidentity details, (2) variation between identity reference and input image\ndegrading reconstruction performance, and (3) the identity reference negatively\nimpacting the model, causing unintended copying of elements unaligned with the\naudio. To address these issues, we propose a mask-free talking face generation\napproach while maintaining the 2D-based face editing task. Instead of masking\nthe lower half, we transform the input images to have closed mouths, using a\ntwo-step landmark-based approach trained in an unpaired manner. Subsequently,\nwe provide these edited but unmasked faces to a lip adaptation model alongside\nthe audio to generate appropriate lip movements. Thus, our approach needs\nneither masked input images nor identity reference images. We conduct\nexperiments on the benchmark LRS2 and HDTF datasets and perform various\nablation studies to validate our contributions.", "published": "2025-07-28 16:03:36", "link": "http://arxiv.org/abs/2507.20953v1", "categories": ["cs.CV"], "primary_category": "cs.CV"}
{"title": "ARC-Hunyuan-Video-7B: Structured Video Comprehension of Real-World Shorts", "abstract": "Real-world user-generated short videos, especially those distributed on\nplatforms such as WeChat Channel and TikTok, dominate the mobile internet.\nHowever, current large multimodal models lack essential temporally-structured,\ndetailed, and in-depth video comprehension capabilities, which are the\ncornerstone of effective video search and recommendation, as well as emerging\nvideo applications. Understanding real-world shorts is actually challenging due\nto their complex visual elements, high information density in both visuals and\naudio, and fast pacing that focuses on emotional expression and viewpoint\ndelivery. This requires advanced reasoning to effectively integrate multimodal\ninformation, including visual, audio, and text. In this work, we introduce\nARC-Hunyuan-Video, a multimodal model that processes visual, audio, and textual\nsignals from raw video inputs end-to-end for structured comprehension. The\nmodel is capable of multi-granularity timestamped video captioning and\nsummarization, open-ended video question answering, temporal video grounding,\nand video reasoning. Leveraging high-quality data from an automated annotation\npipeline, our compact 7B-parameter model is trained through a comprehensive\nregimen: pre-training, instruction fine-tuning, cold start, reinforcement\nlearning (RL) post-training, and final instruction fine-tuning. Quantitative\nevaluations on our introduced benchmark ShortVid-Bench and qualitative\ncomparisons demonstrate its strong performance in real-world video\ncomprehension, and it supports zero-shot or fine-tuning with a few samples for\ndiverse downstream applications. The real-world production deployment of our\nmodel has yielded tangible and measurable improvements in user engagement and\nsatisfaction, a success supported by its remarkable efficiency, with stress\ntests indicating an inference time of just 10 seconds for a one-minute video on\nH20 GPU.", "published": "2025-07-28 15:52:36", "link": "http://arxiv.org/abs/2507.20939v1", "categories": ["cs.CV"], "primary_category": "cs.CV"}
{"title": "Exploring text-to-image generation for historical document image retrieval", "abstract": "Attribute-based document image retrieval (ABDIR) was recently proposed as an\nalternative to query-by-example (QBE) searches, the dominant document image\nretrieval (DIR) paradigm. One drawback of QBE searches is that they require\nsample query documents on hand that may not be available. ABDIR aims to offer\nusers a flexible way to retrieve document images based on memorable visual\nfeatures of document contents, describing document images with combinations of\nvisual attributes determined via convolutional neural network (CNN)-based\nbinary classifiers. We present an exploratory study of the use of generative AI\nto bridge the gap between QBE and ABDIR, focusing on historical documents as a\nuse case for their diversity and uniqueness in visual features. We hypothesize\nthat text-to-image (T2I) generation can be leveraged to create query document\nimages using text prompts based on ABDIR-like attributes. We propose T2I-QBE,\nwhich uses Leonardo.Ai as the T2I generator with prompts that include a rough\ndescription of the desired document type and a list of the desired ABDIR-style\nattributes. This creates query images that are then used within the traditional\nQBE paradigm, which compares CNN-extracted query features to those of the\ndocument images in the dataset to retrieve the most relevant documents.\nExperiments on the HisIR19 dataset of historical documents confirm our\nhypothesis and suggest that T2I-QBE is a viable option for historical document\nimage retrieval. To the authors' knowledge, this is the first attempt at\nutilizing T2I generation for DIR.", "published": "2025-07-28 15:43:46", "link": "http://arxiv.org/abs/2507.20934v1", "categories": ["cs.CV"], "primary_category": "cs.CV"}
{"title": "RIS-LAD: A Benchmark and Model for Referring Low-Altitude Drone Image Segmentation", "abstract": "Referring Image Segmentation (RIS), which aims to segment specific objects\nbased on natural language descriptions, plays an essential role in\nvision-language understanding. Despite its progress in remote sensing\napplications, RIS in Low-Altitude Drone (LAD) scenarios remains underexplored.\nExisting datasets and methods are typically designed for high-altitude and\nstatic-view imagery. They struggle to handle the unique characteristics of LAD\nviews, such as diverse viewpoints and high object density. To fill this gap, we\npresent RIS-LAD, the first fine-grained RIS benchmark tailored for LAD\nscenarios. This dataset comprises 13,871 carefully annotated image-text-mask\ntriplets collected from realistic drone footage, with a focus on small,\ncluttered, and multi-viewpoint scenes. It highlights new challenges absent in\nprevious benchmarks, such as category drift caused by tiny objects and object\ndrift under crowded same-class objects. To tackle these issues, we propose the\nSemantic-Aware Adaptive Reasoning Network (SAARN). Rather than uniformly\ninjecting all linguistic features, SAARN decomposes and routes semantic\ninformation to different stages of the network. Specifically, the\nCategory-Dominated Linguistic Enhancement (CDLE) aligns visual features with\nobject categories during early encoding, while the Adaptive Reasoning Fusion\nModule (ARFM) dynamically selects semantic cues across scales to improve\nreasoning in complex scenes. The experimental evaluation reveals that RIS-LAD\npresents substantial challenges to state-of-the-art RIS algorithms, and also\ndemonstrates the effectiveness of our proposed model in addressing these\nchallenges. The dataset and code will be publicly released soon at:\nhttps://github.com/AHideoKuzeA/RIS-LAD/.", "published": "2025-07-28 15:21:03", "link": "http://arxiv.org/abs/2507.20920v1", "categories": ["cs.CV"], "primary_category": "cs.CV"}
{"title": "HAMLET-FFD: Hierarchical Adaptive Multi-modal Learning Embeddings Transformation for Face Forgery Detection", "abstract": "The rapid evolution of face manipulation techniques poses a critical\nchallenge for face forgery detection: cross-domain generalization. Conventional\nmethods, which rely on simple classification objectives, often fail to learn\ndomain-invariant representations. We propose HAMLET-FFD, a cognitively inspired\nHierarchical Adaptive Multi-modal Learning framework that tackles this\nchallenge via bidirectional cross-modal reasoning. Building on contrastive\nvision-language models such as CLIP, HAMLET-FFD introduces a knowledge\nrefinement loop that iteratively assesses authenticity by integrating visual\nevidence with conceptual cues, emulating expert forensic analysis. A key\ninnovation is a bidirectional fusion mechanism in which textual authenticity\nembeddings guide the aggregation of hierarchical visual features, while\nmodulated visual features refine text embeddings to generate image-adaptive\nprompts. This closed-loop process progressively aligns visual observations with\nsemantic priors to enhance authenticity assessment. By design, HAMLET-FFD\nfreezes all pretrained parameters, serving as an external plugin that preserves\nCLIP's original capabilities. Extensive experiments demonstrate its superior\ngeneralization to unseen manipulations across multiple benchmarks, and visual\nanalyses reveal a division of labor among embeddings, with distinct\nrepresentations specializing in fine-grained artifact recognition.", "published": "2025-07-28 15:09:52", "link": "http://arxiv.org/abs/2507.20913v1", "categories": ["cs.CV", "cs.AI"], "primary_category": "cs.CV"}
{"title": "SCORPION: Addressing Scanner-Induced Variability in Histopathology", "abstract": "Ensuring reliable model performance across diverse domains is a critical\nchallenge in computational pathology. A particular source of variability in\nWhole-Slide Images is introduced by differences in digital scanners, thus\ncalling for better scanner generalization. This is critical for the real-world\nadoption of computational pathology, where the scanning devices may differ per\ninstitution or hospital, and the model should not be dependent on\nscanner-induced details, which can ultimately affect the patient's diagnosis\nand treatment planning. However, past efforts have primarily focused on\nstandard domain generalization settings, evaluating on unseen scanners during\ntraining, without directly evaluating consistency across scanners for the same\ntissue. To overcome this limitation, we introduce SCORPION, a new dataset\nexplicitly designed to evaluate model reliability under scanner variability.\nSCORPION includes 480 tissue samples, each scanned with 5 scanners, yielding\n2,400 spatially aligned patches. This scanner-paired design allows for the\nisolation of scanner-induced variability, enabling a rigorous evaluation of\nmodel consistency while controlling for differences in tissue composition.\nFurthermore, we propose SimCons, a flexible framework that combines\naugmentation-based domain generalization techniques with a consistency loss to\nexplicitly address scanner generalization. We empirically show that SimCons\nimproves model consistency on varying scanners without compromising\ntask-specific performance. By releasing the SCORPION dataset and proposing\nSimCons, we provide the research community with a crucial resource for\nevaluating and improving model consistency across diverse scanners, setting a\nnew standard for reliability testing.", "published": "2025-07-28 15:00:49", "link": "http://arxiv.org/abs/2507.20907v1", "categories": ["cs.CV", "cs.AI"], "primary_category": "cs.CV"}
{"title": "$A^2R^2$: Advancing Img2LaTeX Conversion via Visual Reasoning with Attention-Guided Refinement", "abstract": "Img2LaTeX is a practically significant task that involves converting\nmathematical expressions or tabular data from images into LaTeX code. In recent\nyears, vision-language models (VLMs) have demonstrated strong performance\nacross a variety of visual understanding tasks, owing to their generalization\ncapabilities. While some studies have explored the use of VLMs for the\nImg2LaTeX task, their performance often falls short of expectations.\nEmpirically, VLMs sometimes struggle with fine-grained visual elements, leading\nto inaccurate LaTeX predictions. To address this challenge, we propose\n$A^2R^2$: Advancing Img2LaTeX Conversion via Visual Reasoning with\nAttention-Guided Refinement, a framework that effectively integrates attention\nlocalization and iterative refinement within a visual reasoning framework,\nenabling VLMs to perform self-correction and progressively improve prediction\nquality. For effective evaluation, we introduce a new dataset,\nImg2LaTex-Hard-1K, consisting of 1,100 carefully curated and challenging\nexamples designed to rigorously evaluate the capabilities of VLMs within this\ntask domain. Extensive experimental results demonstrate that: (1) $A^2R^2$\nsignificantly improves model performance across six evaluation metrics spanning\nboth textual and visual levels, consistently outperforming other baseline\nmethods; (2) Increasing the number of inference rounds yields notable\nperformance gains, underscoring the potential of $A^2R^2$ in test-time scaling\nscenarios; (3) Ablation studies and human evaluations validate the practical\neffectiveness of our approach, as well as the strong synergy among its core\ncomponents during inference.", "published": "2025-07-28 14:41:57", "link": "http://arxiv.org/abs/2507.20890v1", "categories": ["cs.CV", "cs.CL"], "primary_category": "cs.CV"}
{"title": "The Importance of Facial Features in Vision-based Sign Language Recognition: Eyes, Mouth or Full Face?", "abstract": "Non-manual facial features play a crucial role in sign language\ncommunication, yet their importance in automatic sign language recognition\n(ASLR) remains underexplored. While prior studies have shown that incorporating\nfacial features can improve recognition, related work often relies on\nhand-crafted feature extraction and fails to go beyond the comparison of manual\nfeatures versus the combination of manual and facial features. In this work, we\nsystematically investigate the contribution of distinct facial regionseyes,\nmouth, and full faceusing two different deep learning models (a CNN-based model\nand a transformer-based model) trained on an SLR dataset of isolated signs with\nrandomly selected classes. Through quantitative performance and qualitative\nsaliency map evaluation, we reveal that the mouth is the most important\nnon-manual facial feature, significantly improving accuracy. Our findings\nhighlight the necessity of incorporating facial features in ASLR.", "published": "2025-07-28 14:36:46", "link": "http://arxiv.org/abs/2507.20884v1", "categories": ["cs.CV", "cs.CL", "eess.IV"], "primary_category": "cs.CV"}
{"title": "Endoscopic Depth Estimation Based on Deep Learning: A Survey", "abstract": "Endoscopic depth estimation is a critical technology for improving the safety\nand precision of minimally invasive surgery. It has attracted considerable\nattention from researchers in medical imaging, computer vision, and robotics.\nOver the past decade, a large number of methods have been developed. Despite\nthe existence of several related surveys, a comprehensive overview focusing on\nrecent deep learning-based techniques is still limited. This paper endeavors to\nbridge this gap by systematically reviewing the state-of-the-art literature.\nSpecifically, we provide a thorough survey of the field from three key\nperspectives: data, methods, and applications, covering a range of methods\nincluding both monocular and stereo approaches. We describe common performance\nevaluation metrics and summarize publicly available datasets. Furthermore, this\nreview analyzes the specific challenges of endoscopic scenes and categorizes\nrepresentative techniques based on their supervision strategies and network\narchitectures. The application of endoscopic depth estimation in the important\narea of robot-assisted surgery is also reviewed. Finally, we outline potential\ndirections for future research, such as domain adaptation, real-time\nimplementation, and enhanced model generalization, thereby providing a valuable\nstarting point for researchers to engage with and advance the field.", "published": "2025-07-28 14:34:45", "link": "http://arxiv.org/abs/2507.20881v1", "categories": ["cs.CV", "cs.GR"], "primary_category": "cs.CV"}
{"title": "DriveAgent-R1: Advancing VLM-based Autonomous Driving with Hybrid Thinking and Active Perception", "abstract": "Vision-Language Models (VLMs) are advancing autonomous driving, yet their\npotential is constrained by myopic decision-making and passive perception,\nlimiting reliability in complex environments. We introduce DriveAgent-R1 to\ntackle these challenges in long-horizon, high-level behavioral decision-making.\nDriveAgent-R1 features two core innovations: a Hybrid-Thinking framework that\nadaptively switches between efficient text-based and in-depth tool-based\nreasoning, and an Active Perception mechanism with a vision toolkit to\nproactively resolve uncertainties, thereby balancing decision-making efficiency\nand reliability. The agent is trained using a novel, three-stage progressive\nreinforcement learning strategy designed to master these hybrid capabilities.\nExtensive experiments demonstrate that DriveAgent-R1 achieves state-of-the-art\nperformance, outperforming even leading proprietary large multimodal models,\nsuch as Claude Sonnet 4. Ablation studies validate our approach and confirm\nthat the agent's decisions are robustly grounded in actively perceived visual\nevidence, paving a path toward safer and more intelligent autonomous systems.", "published": "2025-07-28 14:33:15", "link": "http://arxiv.org/abs/2507.20879v1", "categories": ["cs.CV"], "primary_category": "cs.CV"}
{"title": "Not Only Grey Matter: OmniBrain for Robust Multimodal Classification of Alzheimer's Disease", "abstract": "Alzheimer's disease affects over 55 million people worldwide and is projected\nto more than double by 2050, necessitating rapid, accurate, and scalable\ndiagnostics. However, existing approaches are limited because they cannot\nachieve clinically acceptable accuracy, generalization across datasets,\nrobustness to missing modalities, and explainability all at the same time. This\ninability to satisfy all these requirements simultaneously undermines their\nreliability in clinical settings. We propose OmniBrain, a multimodal framework\nthat integrates brain MRI, radiomics, gene expression, and clinical data using\na unified model with cross-attention and modality dropout. OmniBrain achieves\n$92.2 \\pm 2.4\\%$accuracy on the ANMerge dataset and generalizes to the MRI-only\nADNI dataset with $70.4 \\pm 2.7\\%$ accuracy, outperforming unimodal and prior\nmultimodal approaches. Explainability analyses highlight neuropathologically\nrelevant brain regions and genes, enhancing clinical trust. OmniBrain offers a\nrobust, interpretable, and practical solution for real-world Alzheimer's\ndiagnosis.", "published": "2025-07-28 14:24:13", "link": "http://arxiv.org/abs/2507.20872v1", "categories": ["cs.CV", "cs.AI", "cs.LG"], "primary_category": "cs.CV"}
{"title": "Ensemble Foreground Management for Unsupervised Object Discovery", "abstract": "Unsupervised object discovery (UOD) aims to detect and segment objects in 2D\nimages without handcrafted annotations. Recent progress in self-supervised\nrepresentation learning has led to some success in UOD algorithms. However, the\nabsence of ground truth provides existing UOD methods with two challenges: 1)\ndetermining if a discovered region is foreground or background, and 2) knowing\nhow many objects remain undiscovered. To address these two problems, previous\nsolutions rely on foreground priors to distinguish if the discovered region is\nforeground, and conduct one or fixed iterations of discovery. However, the\nexisting foreground priors are heuristic and not always robust, and a fixed\nnumber of discoveries leads to under or over-segmentation, since the number of\nobjects in images varies. This paper introduces UnionCut, a robust and\nwell-grounded foreground prior based on min-cut and ensemble methods that\ndetects the union of foreground areas of an image, allowing UOD algorithms to\nidentify foreground objects and stop discovery once the majority of the\nforeground union in the image is segmented. In addition, we propose UnionSeg, a\ndistilled transformer of UnionCut that outputs the foreground union more\nefficiently and accurately. Our experiments show that by combining with\nUnionCut or UnionSeg, previous state-of-the-art UOD methods witness an increase\nin the performance of single object discovery, saliency detection and\nself-supervised instance segmentation on various benchmarks. The code is\navailable at https://github.com/YFaris/UnionCut.", "published": "2025-07-28 14:14:06", "link": "http://arxiv.org/abs/2507.20860v1", "categories": ["cs.CV"], "primary_category": "cs.CV"}
{"title": "Compositional Video Synthesis by Temporal Object-Centric Learning", "abstract": "We present a novel framework for compositional video synthesis that leverages\ntemporally consistent object-centric representations, extending our previous\nwork, SlotAdapt, from images to video. While existing object-centric approaches\neither lack generative capabilities entirely or treat video sequences\nholistically, thus neglecting explicit object-level structure, our approach\nexplicitly captures temporal dynamics by learning pose invariant object-centric\nslots and conditioning them on pretrained diffusion models. This design enables\nhigh-quality, pixel-level video synthesis with superior temporal coherence, and\noffers intuitive compositional editing capabilities such as object insertion,\ndeletion, or replacement, maintaining consistent object identities across\nframes. Extensive experiments demonstrate that our method sets new benchmarks\nin video generation quality and temporal consistency, outperforming previous\nobject-centric generative methods. Although our segmentation performance\nclosely matches state-of-the-art methods, our approach uniquely integrates this\ncapability with robust generative performance, significantly advancing\ninteractive and controllable video generation and opening new possibilities for\nadvanced content creation, semantic editing, and dynamic scene understanding.", "published": "2025-07-28 14:11:04", "link": "http://arxiv.org/abs/2507.20855v1", "categories": ["cs.CV"], "primary_category": "cs.CV"}
{"title": "$S^3$LAM: Surfel Splatting SLAM for Geometrically Accurate Tracking and Mapping", "abstract": "We propose $S^3$LAM, a novel RGB-D SLAM system that leverages 2D surfel\nsplatting to achieve highly accurate geometric representations for simultaneous\ntracking and mapping. Unlike existing 3DGS-based SLAM approaches that rely on\n3D Gaussian ellipsoids, we utilize 2D Gaussian surfels as primitives for more\nefficient scene representation. By focusing on the surfaces of objects in the\nscene, this design enables $S^3$LAM to reconstruct high-quality geometry,\nbenefiting both mapping and tracking. To address inherent SLAM challenges\nincluding real-time optimization under limited viewpoints, we introduce a novel\nadaptive surface rendering strategy that improves mapping accuracy while\nmaintaining computational efficiency. We further derive camera pose Jacobians\ndirectly from 2D surfel splatting formulation, highlighting the importance of\nour geometrically accurate representation that improves tracking convergence.\nExtensive experiments on both synthetic and real-world datasets validate that\n$S^3$LAM achieves state-of-the-art performance. Code will be made publicly\navailable.", "published": "2025-07-28 14:09:08", "link": "http://arxiv.org/abs/2507.20854v1", "categories": ["cs.CV"], "primary_category": "cs.CV"}
{"title": "METEOR: Multi-Encoder Collaborative Token Pruning for Efficient Vision Language Models", "abstract": "Vision encoders serve as the cornerstone of multimodal understanding.\nSingle-encoder architectures like CLIP exhibit inherent constraints in\ngeneralizing across diverse multimodal tasks, while recent multi-encoder fusion\nmethods introduce prohibitive computational overhead to achieve superior\nperformance using complementary visual representations from multiple vision\nencoders. To address this, we propose a progressive pruning framework, namely\nMulti-Encoder collaboraTivE tOken pRuning (METEOR), that eliminates redundant\nvisual tokens across the encoding, fusion, and decoding stages for\nmulti-encoder MLLMs. For multi-vision encoding, we discard redundant tokens\nwithin each encoder via a rank guided collaborative token assignment strategy.\nSubsequently, for multi-vision fusion, we combine the visual features from\ndifferent encoders while reducing cross-encoder redundancy with cooperative\npruning. Finally, we propose an adaptive token pruning method in the LLM\ndecoding stage to further discard irrelevant tokens based on the text prompts\nwith dynamically adjusting pruning ratios for specific task demands. To our\nbest knowledge, this is the first successful attempt that achieves an efficient\nmulti-encoder based vision language model with multi-stage pruning strategies.\nExtensive experiments on 11 benchmarks demonstrate the effectiveness of our\nproposed approach. Compared with EAGLE, a typical multi-encoder MLLMs, METEOR\nreduces 76% visual tokens with only 0.3% performance drop in average. The code\nis available at https://github.com/YuchenLiu98/METEOR.", "published": "2025-07-28 13:50:53", "link": "http://arxiv.org/abs/2507.20842v1", "categories": ["cs.CV"], "primary_category": "cs.CV"}
{"title": "Rethinking Few Shot CLIP Benchmarks: A Critical Analysis in the Inductive Setting", "abstract": "CLIP is a foundational model with transferable classification performance in\nthe few-shot setting. Several methods have shown improved performance of CLIP\nusing few-shot examples. However, so far, all these techniques have been\nbenchmarked using standard few-shot datasets. We argue that this mode of\nevaluation does not provide a true indication of the inductive generalization\nability using few-shot examples. As most datasets have been seen by the CLIP\nmodel, the resultant setting can be termed as partially transductive. To solve\nthis, we propose a pipeline that uses an unlearning technique to obtain true\ninductive baselines. In this new inductive setting, the methods show a\nsignificant drop in performance (-55% on average among 13 baselines with\nmultiple datasets). We validate the unlearning technique using oracle\nbaselines. An improved few-shot classification technique is proposed that\nconsistently obtains state-of-the-art performance over 13 other recent baseline\nmethods on a comprehensive analysis with 5880 experiments - varying the\ndatasets, differing number of few-shot examples, unlearning setting, and with\ndifferent seeds. Thus, we identify the issue with the evaluation of CLIP-based\nfew-shot classification, provide a solution using unlearning, propose new\nbenchmarks, and provide an improved method.", "published": "2025-07-28 13:41:24", "link": "http://arxiv.org/abs/2507.20834v1", "categories": ["cs.CV"], "primary_category": "cs.CV"}
{"title": "SCANet: Split Coordinate Attention Network for Building Footprint Extraction", "abstract": "Building footprint extraction holds immense significance in remote sensing\nimage analysis and has great value in urban planning, land use, environmental\nprotection and disaster assessment. Despite the progress made by conventional\nand deep learning approaches in this field, they continue to encounter\nsignificant challenges. This paper introduces a novel plug-and-play attention\nmodule, Split Coordinate Attention (SCA), which ingeniously captures spatially\nremote interactions by employing two spatial range of pooling kernels,\nstrategically encoding each channel along x and y planes, and separately\nperforms a series of split operations for each feature group, thus enabling\nmore efficient semantic feature extraction. By inserting into a 2D CNN to form\nan effective SCANet, our SCANet outperforms recent SOTA methods on the public\nWuhan University (WHU) Building Dataset and Massachusetts Building Dataset in\nterms of various metrics. Particularly SCANet achieves the best IoU, 91.61% and\n75.49% for the two datasets. Our code is available at\nhttps://github.com/AiEson/SCANet", "published": "2025-07-28 13:21:08", "link": "http://arxiv.org/abs/2507.20809v1", "categories": ["cs.CV"], "primary_category": "cs.CV"}
{"title": "FantasyID: A dataset for detecting digital manipulations of ID-documents", "abstract": "Advancements in image generation led to the availability of easy-to-use tools\nfor malicious actors to create forged images. These tools pose a serious threat\nto the widespread Know Your Customer (KYC) applications, requiring robust\nsystems for detection of the forged Identity Documents (IDs). To facilitate the\ndevelopment of the detection algorithms, in this paper, we propose a novel\npublicly available (including commercial use) dataset, FantasyID, which mimics\nreal-world IDs but without tampering with legal documents and, compared to\nprevious public datasets, it does not contain generated faces or specimen\nwatermarks. FantasyID contains ID cards with diverse design styles, languages,\nand faces of real people. To simulate a realistic KYC scenario, the cards from\nFantasyID were printed and captured with three different devices, constituting\nthe bonafide class. We have emulated digital forgery/injection attacks that\ncould be performed by a malicious actor to tamper the IDs using the existing\ngenerative tools. The current state-of-the-art forgery detection algorithms,\nsuch as TruFor, MMFusion, UniFD, and FatFormer, are challenged by FantasyID\ndataset. It especially evident, in the evaluation conditions close to\npractical, with the operational threshold set on validation set so that false\npositive rate is at 10%, leading to false negative rates close to 50% across\nthe board on the test set. The evaluation experiments demonstrate that\nFantasyID dataset is complex enough to be used as an evaluation benchmark for\ndetection algorithms.", "published": "2025-07-28 13:20:18", "link": "http://arxiv.org/abs/2507.20808v1", "categories": ["cs.CV"], "primary_category": "cs.CV"}
{"title": "LanternNet: A Novel Hub-and-Spoke System to Seek and Suppress Spotted Lanternfly Populations", "abstract": "The invasive spotted lanternfly (SLF) poses a significant threat to\nagriculture and ecosystems, causing widespread damage. Current control methods,\nsuch as egg scraping, pesticides, and quarantines, prove labor-intensive,\nenvironmentally hazardous, and inadequate for long-term SLF suppression. This\nresearch introduces LanternNet, a novel autonomous robotic Hub-and-Spoke system\ndesigned for scalable detection and suppression of SLF populations. A central,\ntree-mimicking hub utilizes a YOLOv8 computer vision model for precise SLF\nidentification. Three specialized robotic spokes perform targeted tasks: pest\nneutralization, environmental monitoring, and navigation/mapping. Field\ndeployment across multiple infested sites over 5 weeks demonstrated\nLanternNet's efficacy. Quantitative analysis revealed significant reductions (p\n< 0.01, paired t-tests) in SLF populations and corresponding improvements in\ntree health indicators across the majority of test sites. Compared to\nconventional methods, LanternNet offers substantial cost advantages and\nimproved scalability. Furthermore, the system's adaptability for enhanced\nautonomy and targeting of other invasive species presents significant potential\nfor broader ecological impact. LanternNet demonstrates the transformative\npotential of integrating robotics and AI for advanced invasive species\nmanagement and improved environmental outcomes.", "published": "2025-07-28 13:08:33", "link": "http://arxiv.org/abs/2507.20800v1", "categories": ["cs.RO", "cs.AI", "cs.CV"], "primary_category": "cs.RO"}
{"title": "An Efficient Machine Learning Framework for Forest Height Estimation from Multi-Polarimetric Multi-Baseline SAR data", "abstract": "Accurate forest height estimation is crucial for climate change monitoring\nand carbon cycle assessment. Synthetic Aperture Radar (SAR), particularly in\nmulti-channel configurations, has provided support for a long time in 3D forest\nstructure reconstruction through model-based techniques. More recently,\ndata-driven approaches using Machine Learning (ML) and Deep Learning (DL) have\nenabled new opportunities for forest parameter retrieval. This paper introduces\nFGump, a forest height estimation framework by gradient boosting using\nmulti-channel SAR processing with LiDAR profiles as Ground Truth(GT). Unlike\ntypical ML and DL approaches that require large datasets and complex\narchitectures, FGump ensures a strong balance between accuracy and\ncomputational efficiency, using a limited set of hand-designed features and\navoiding heavy preprocessing (e.g., calibration and/or quantization). Evaluated\nunder both classification and regression paradigms, the proposed framework\ndemonstrates that the regression formulation enables fine-grained, continuous\nestimations and avoids quantization artifacts by resulting in more precise\nmeasurements without rounding. Experimental results confirm that FGump\noutperforms State-of-the-Art (SOTA) AI-based and classical methods, achieving\nhigher accuracy and significantly lower training and inference times, as\ndemonstrated in our results.", "published": "2025-07-28 13:07:23", "link": "http://arxiv.org/abs/2507.20798v1", "categories": ["cs.CV"], "primary_category": "cs.CV"}
{"title": "Investigation of Accuracy and Bias in Face Recognition Trained with Synthetic Data", "abstract": "Synthetic data has emerged as a promising alternative for training face\nrecognition (FR) models, offering advantages in scalability, privacy\ncompliance, and potential for bias mitigation. However, critical questions\nremain on whether both high accuracy and fairness can be achieved with\nsynthetic data. In this work, we evaluate the impact of synthetic data on bias\nand performance of FR systems. We generate balanced face dataset, FairFaceGen,\nusing two state of the art text-to-image generators, Flux.1-dev and Stable\nDiffusion v3.5 (SD35), and combine them with several identity augmentation\nmethods, including Arc2Face and four IP-Adapters. By maintaining equal identity\ncount across synthetic and real datasets, we ensure fair comparisons when\nevaluating FR performance on standard (LFW, AgeDB-30, etc.) and challenging\nIJB-B/C benchmarks and FR bias on Racial Faces in-the-Wild (RFW) dataset. Our\nresults demonstrate that although synthetic data still lags behind the real\ndatasets in the generalization on IJB-B/C, demographically balanced synthetic\ndatasets, especially those generated with SD35, show potential for bias\nmitigation. We also observe that the number and quality of intra-class\naugmentations significantly affect FR accuracy and fairness. These findings\nprovide practical guidelines for constructing fairer FR systems using synthetic\ndata.", "published": "2025-07-28 12:52:23", "link": "http://arxiv.org/abs/2507.20782v1", "categories": ["cs.CV", "cs.AI"], "primary_category": "cs.CV"}
{"title": "RingMo-Agent: A Unified Remote Sensing Foundation Model for Multi-Platform and Multi-Modal Reasoning", "abstract": "Remote sensing (RS) images from multiple modalities and platforms exhibit\ndiverse details due to differences in sensor characteristics and imaging\nperspectives. Existing vision-language research in RS largely relies on\nrelatively homogeneous data sources. Moreover, they still remain limited to\nconventional visual perception tasks such as classification or captioning. As a\nresult, these methods fail to serve as a unified and standalone framework\ncapable of effectively handling RS imagery from diverse sources in real-world\napplications. To address these issues, we propose RingMo-Agent, a model\ndesigned to handle multi-modal and multi-platform data that performs perception\nand reasoning tasks based on user textual instructions. Compared with existing\nmodels, RingMo-Agent 1) is supported by a large-scale vision-language dataset\nnamed RS-VL3M, comprising over 3 million image-text pairs, spanning optical,\nSAR, and infrared (IR) modalities collected from both satellite and UAV\nplatforms, covering perception and challenging reasoning tasks; 2) learns\nmodality adaptive representations by incorporating separated embedding layers\nto construct isolated features for heterogeneous modalities and reduce\ncross-modal interference; 3) unifies task modeling by introducing task-specific\ntokens and employing a token-based high-dimensional hidden state decoding\nmechanism designed for long-horizon spatial tasks. Extensive experiments on\nvarious RS vision-language tasks demonstrate that RingMo-Agent not only proves\neffective in both visual understanding and sophisticated analytical tasks, but\nalso exhibits strong generalizability across different platforms and sensing\nmodalities.", "published": "2025-07-28 12:39:33", "link": "http://arxiv.org/abs/2507.20776v1", "categories": ["cs.CV"], "primary_category": "cs.CV"}
{"title": "Learning Only with Images: Visual Reinforcement Learning with Reasoning, Rendering, and Visual Feedback", "abstract": "Multimodal Large Language Models (MLLMs) have exhibited impressive\nperformance across various visual tasks. Subsequent investigations into\nenhancing their visual reasoning abilities have significantly expanded their\nperformance envelope. However, a critical bottleneck in the advancement of\nMLLMs toward deep visual reasoning is their heavy reliance on curated\nimage-text supervision. To solve this problem, we introduce a novel framework\ntermed ``Reasoning-Rendering-Visual-Feedback'' (RRVF), which enables MLLMs to\nlearn complex visual reasoning from only raw images. This framework builds on\nthe ``Asymmetry of Verification'' principle to train MLLMs, i.e., verifying the\nrendered output against a source image is easier than generating it. We\ndemonstrate that this relative ease provides an ideal reward signal for\noptimization via Reinforcement Learning (RL) training, reducing the reliance on\nthe image-text supervision. Guided by the above principle, RRVF implements a\nclosed-loop iterative process encompassing reasoning, rendering, and visual\nfeedback components, enabling the model to perform self-correction through\nmulti-turn interactions and tool invocation, while this pipeline can be\noptimized by the GRPO algorithm in an end-to-end manner. Extensive experiments\non image-to-code generation for data charts and web interfaces show that RRVF\nsubstantially outperforms existing open-source MLLMs and surpasses supervised\nfine-tuning baselines. Our findings demonstrate that systems driven by purely\nvisual feedback present a viable path toward more robust and generalizable\nreasoning models without requiring explicit supervision. Code will be available\nat https://github.com/L-O-I/RRVF.", "published": "2025-07-28 12:21:19", "link": "http://arxiv.org/abs/2507.20766v1", "categories": ["cs.CV"], "primary_category": "cs.CV"}
{"title": "Onboard Hyperspectral Super-Resolution with Deep Pushbroom Neural Network", "abstract": "Hyperspectral imagers on satellites obtain the fine spectral signatures\nessential for distinguishing one material from another at the expense of\nlimited spatial resolution. Enhancing the latter is thus a desirable\npreprocessing step in order to further improve the detection capabilities\noffered by hyperspectral images on downstream tasks. At the same time, there is\na growing interest towards deploying inference methods directly onboard of\nsatellites, which calls for lightweight image super-resolution methods that can\nbe run on the payload in real time. In this paper, we present a novel neural\nnetwork design, called Deep Pushbroom Super-Resolution (DPSR) that matches the\npushbroom acquisition of hyperspectral sensors by processing an image line by\nline in the along-track direction with a causal memory mechanism to exploit\npreviously acquired lines. This design greatly limits memory requirements and\ncomputational complexity, achieving onboard real-time performance, i.e., the\nability to super-resolve a line in the time it takes to acquire the next one,\non low-power hardware. Experiments show that the quality of the super-resolved\nimages is competitive or even outperforms state-of-the-art methods that are\nsignificantly more complex.", "published": "2025-07-28 12:18:52", "link": "http://arxiv.org/abs/2507.20765v1", "categories": ["eess.IV", "cs.CV"], "primary_category": "eess.IV"}
{"title": "ATR-UMMIM: A Benchmark Dataset for UAV-Based Multimodal Image Registration under Complex Imaging Conditions", "abstract": "Multimodal fusion has become a key enabler for UAV-based object detection, as\neach modality provides complementary cues for robust feature extraction.\nHowever, due to significant differences in resolution, field of view, and\nsensing characteristics across modalities, accurate registration is a\nprerequisite before fusion. Despite its importance, there is currently no\npublicly available benchmark specifically designed for multimodal registration\nin UAV-based aerial scenarios, which severely limits the development and\nevaluation of advanced registration methods under real-world conditions. To\nbridge this gap, we present ATR-UMMIM, the first benchmark dataset specifically\ntailored for multimodal image registration in UAV-based applications. This\ndataset includes 7,969 triplets of raw visible, infrared, and precisely\nregistered visible images captured covers diverse scenarios including flight\naltitudes from 80m to 300m, camera angles from 0{\\deg} to 75{\\deg}, and\nall-day, all-year temporal variations under rich weather and illumination\nconditions. To ensure high registration quality, we design a semi-automated\nannotation pipeline to introduce reliable pixel-level ground truth to each\ntriplet. In addition, each triplet is annotated with six imaging condition\nattributes, enabling benchmarking of registration robustness under real-world\ndeployment settings. To further support downstream tasks, we provide\nobject-level annotations on all registered images, covering 11 object\ncategories with 77,753 visible and 78,409 infrared bounding boxes. We believe\nATR-UMMIM will serve as a foundational benchmark for advancing multimodal\nregistration, fusion, and perception in real-world UAV scenarios. The datatset\ncan be download from https://github.com/supercpy/ATR-UMMIM", "published": "2025-07-28 12:18:41", "link": "http://arxiv.org/abs/2507.20764v1", "categories": ["cs.CV"], "primary_category": "cs.CV"}
{"title": "KASportsFormer: Kinematic Anatomy Enhanced Transformer for 3D Human Pose Estimation on Short Sports Scene Video", "abstract": "Recent transformer based approaches have demonstrated impressive performance\nin solving real-world 3D human pose estimation problems. Albeit these\napproaches achieve fruitful results on benchmark datasets, they tend to fall\nshort of sports scenarios where human movements are more complicated than daily\nlife actions, as being hindered by motion blur, occlusions, and domain shifts.\nMoreover, due to the fact that critical motions in a sports game often finish\nin moments of time (e.g., shooting), the ability to focus on momentary actions\nis becoming a crucial factor in sports analysis, where current methods appear\nto struggle with instantaneous scenarios. To overcome these limitations, we\nintroduce KASportsFormer, a novel transformer based 3D pose estimation\nframework for sports that incorporates a kinematic anatomy-informed feature\nrepresentation and integration module. In which the inherent kinematic motion\ninformation is extracted with the Bone Extractor (BoneExt) and Limb Fuser\n(LimbFus) modules and encoded in a multimodal manner. This improved the\ncapability of comprehending sports poses in short videos. We evaluate our\nmethod through two representative sports scene datasets: SportsPose and\nWorldPose. Experimental results show that our proposed method achieves\nstate-of-the-art results with MPJPE errors of 58.0mm and 34.3mm, respectively.\nOur code and models are available at: https://github.com/jw0r1n/KASportsFormer", "published": "2025-07-28 12:17:40", "link": "http://arxiv.org/abs/2507.20763v1", "categories": ["cs.CV"], "primary_category": "cs.CV"}
{"title": "Learning to See Inside Opaque Liquid Containers using Speckle Vibrometry", "abstract": "Computer vision seeks to infer a wide range of information about objects and\nevents. However, vision systems based on conventional imaging are limited to\nextracting information only from the visible surfaces of scene objects. For\ninstance, a vision system can detect and identify a Coke can in the scene, but\nit cannot determine whether the can is full or empty. In this paper, we aim to\nexpand the scope of computer vision to include the novel task of inferring the\nhidden liquid levels of opaque containers by sensing the tiny vibrations on\ntheir surfaces. Our method provides a first-of-a-kind way to inspect the fill\nlevel of multiple sealed containers remotely, at once, without needing physical\nmanipulation and manual weighing. First, we propose a novel speckle-based\nvibration sensing system for simultaneously capturing scene vibrations on a 2D\ngrid of points. We use our system to efficiently and remotely capture a dataset\nof vibration responses for a variety of everyday liquid containers. Then, we\ndevelop a transformer-based approach for analyzing the captured vibrations and\nclassifying the container type and its hidden liquid level at the time of\nmeasurement. Our architecture is invariant to the vibration source, yielding\ncorrect liquid level estimates for controlled and ambient scene sound sources.\nMoreover, our model generalizes to unseen container instances within known\nclasses (e.g., training on five Coke cans of a six-pack, testing on a sixth)\nand fluid levels. We demonstrate our method by recovering liquid levels from\nvarious everyday containers.", "published": "2025-07-28 12:11:12", "link": "http://arxiv.org/abs/2507.20757v1", "categories": ["cs.CV", "cs.AI"], "primary_category": "cs.CV"}
{"title": "Investigating Structural Pruning and Recovery Techniques for Compressing Multimodal Large Language Models: An Empirical Study", "abstract": "While Multimodal Large Language Models (MLLMs) demonstrate impressive\ncapabilities, their substantial computational and memory requirements pose\nsignificant barriers to practical deployment. Current parameter reduction\ntechniques primarily involve training MLLMs from Small Language Models (SLMs),\nbut these methods offer limited flexibility and remain computationally\nintensive. To address this gap, we propose to directly compress existing MLLMs\nthrough structural pruning combined with efficient recovery training.\nSpecifically, we investigate two structural pruning paradigms--layerwise and\nwidthwise pruning--applied to the language model backbone of MLLMs, alongside\nsupervised finetuning and knowledge distillation. Additionally, we assess the\nfeasibility of conducting recovery training with only a small fraction of the\navailable data. Our results show that widthwise pruning generally maintains\nbetter performance in low-resource scenarios with limited computational\nresources or insufficient finetuning data. As for the recovery training,\nfinetuning only the multimodal projector is sufficient at small compression\nlevels (< 20%). Furthermore, a combination of supervised finetuning and\nhidden-state distillation yields optimal recovery across various pruning\nlevels. Notably, effective recovery can be achieved with as little as 5% of the\noriginal training data, while retaining over 95% of the original performance.\nThrough empirical study on two representative MLLMs, i.e., LLaVA-v1.5-7B and\nBunny-v1.0-3B, this study offers actionable insights for practitioners aiming\nto compress MLLMs effectively without extensive computation resources or\nsufficient data.", "published": "2025-07-28 11:57:52", "link": "http://arxiv.org/abs/2507.20749v1", "categories": ["cs.CL", "cs.CV"], "primary_category": "cs.CL"}
{"title": "AR-LIF: Adaptive reset leaky-integrate and fire neuron for spiking neural networks", "abstract": "Spiking neural networks possess the advantage of low energy consumption due\nto their event-driven nature. Compared with binary spike outputs, their\ninherent floating-point dynamics are more worthy of attention. The threshold\nlevel and re- set mode of neurons play a crucial role in determining the number\nand timing of spikes. The existing hard reset method causes information loss,\nwhile the improved soft reset method adopts a uniform treatment for neurons. In\nresponse to this, this paper designs an adaptive reset neuron, establishing the\ncorrelation between input, output and reset, and integrating a simple yet\neffective threshold adjustment strategy. It achieves excellent performance on\nvarious datasets while maintaining the advantage of low energy consumption.", "published": "2025-07-28 11:54:48", "link": "http://arxiv.org/abs/2507.20746v1", "categories": ["cs.NE", "cs.AI", "cs.CV"], "primary_category": "cs.NE"}
{"title": "Regularizing Subspace Redundancy of Low-Rank Adaptation", "abstract": "Low-Rank Adaptation (LoRA) and its variants have delivered strong capability\nin Parameter-Efficient Transfer Learning (PETL) by minimizing trainable\nparameters and benefiting from reparameterization. However, their projection\nmatrices remain unrestricted during training, causing high representation\nredundancy and diminishing the effectiveness of feature adaptation in the\nresulting subspaces. While existing methods mitigate this by manually adjusting\nthe rank or implicitly applying channel-wise masks, they lack flexibility and\ngeneralize poorly across various datasets and architectures. Hence, we propose\nReSoRA, a method that explicitly models redundancy between mapping subspaces\nand adaptively Regularizes Subspace redundancy of Low-Rank Adaptation.\nSpecifically, it theoretically decomposes the low-rank submatrices into\nmultiple equivalent subspaces and systematically applies de-redundancy\nconstraints to the feature distributions across different projections.\nExtensive experiments validate that our proposed method consistently\nfacilitates existing state-of-the-art PETL methods across various backbones and\ndatasets in vision-language retrieval and standard visual classification\nbenchmarks. Besides, as a training supervision, ReSoRA can be seamlessly\nintegrated into existing approaches in a plug-and-play manner, with no\nadditional inference costs. Code is publicly available at:\nhttps://github.com/Lucenova/ReSoRA.", "published": "2025-07-28 11:52:56", "link": "http://arxiv.org/abs/2507.20745v1", "categories": ["cs.CV", "cs.AI", "cs.MM"], "primary_category": "cs.CV"}
{"title": "Implicit Counterfactual Learning for Audio-Visual Segmentation", "abstract": "Audio-visual segmentation (AVS) aims to segment objects in videos based on\naudio cues. Existing AVS methods are primarily designed to enhance interaction\nefficiency but pay limited attention to modality representation discrepancies\nand imbalances. To overcome this, we propose the implicit counterfactual\nframework (ICF) to achieve unbiased cross-modal understanding. Due to the lack\nof semantics, heterogeneous representations may lead to erroneous matches,\nespecially in complex scenes with ambiguous visual content or interference from\nmultiple audio sources. We introduce the multi-granularity implicit text (MIT)\ninvolving video-, segment- and frame-level as the bridge to establish the\nmodality-shared space, reducing modality gaps and providing prior guidance.\nVisual content carries more information and typically dominates, thereby\nmarginalizing audio features in the decision-making. To mitigate knowledge\npreference, we propose the semantic counterfactual (SC) to learn orthogonal\nrepresentations in the latent space, generating diverse counterfactual samples,\nthus avoiding biases introduced by complex functional designs and explicit\nmodifications of text structures or attributes. We further formulate the\ncollaborative distribution-aware contrastive learning (CDCL), incorporating\nfactual-counterfactual and inter-modality contrasts to align representations,\npromoting cohesion and decoupling. Extensive experiments on three public\ndatasets validate that the proposed method achieves state-of-the-art\nperformance.", "published": "2025-07-28 11:46:35", "link": "http://arxiv.org/abs/2507.20740v1", "categories": ["cs.CV"], "primary_category": "cs.CV"}
{"title": "Multi-Masked Querying Network for Robust Emotion Recognition from Incomplete Multi-Modal Physiological Signals", "abstract": "Emotion recognition from physiological data is crucial for mental health\nassessment, yet it faces two significant challenges: incomplete multi-modal\nsignals and interference from body movements and artifacts. This paper presents\na novel Multi-Masked Querying Network (MMQ-Net) to address these issues by\nintegrating multiple querying mechanisms into a unified framework.\nSpecifically, it uses modality queries to reconstruct missing data from\nincomplete signals, category queries to focus on emotional state features, and\ninterference queries to separate relevant information from noise. Extensive\nexperiment results demonstrate the superior emotion recognition performance of\nMMQ-Net compared to existing approaches, particularly under high levels of data\nincompleteness.", "published": "2025-07-28 11:41:15", "link": "http://arxiv.org/abs/2507.20737v1", "categories": ["cs.CV", "cs.AI", "cs.HC"], "primary_category": "cs.CV"}
{"title": "Style-Aware Blending and Prototype-Based Cross-Contrast Consistency for Semi-Supervised Medical Image Segmentation", "abstract": "Weak-strong consistency learning strategies are widely employed in\nsemi-supervised medical image segmentation to train models by leveraging\nlimited labeled data and enforcing weak-to-strong consistency. However,\nexisting methods primarily focus on designing and combining various\nperturbation schemes, overlooking the inherent potential and limitations within\nthe framework itself. In this paper, we first identify two critical\ndeficiencies: (1) separated training data streams, which lead to confirmation\nbias dominated by the labeled stream; and (2) incomplete utilization of\nsupervisory information, which limits exploration of strong-to-weak\nconsistency. To tackle these challenges, we propose a style-aware blending and\nprototype-based cross-contrast consistency learning framework. Specifically,\ninspired by the empirical observation that the distribution mismatch between\nlabeled and unlabeled data can be characterized by statistical moments, we\ndesign a style-guided distribution blending module to break the independent\ntraining data streams. Meanwhile, considering the potential noise in strong\npseudo-labels, we introduce a prototype-based cross-contrast strategy to\nencourage the model to learn informative supervisory signals from both\nweak-to-strong and strong-to-weak predictions, while mitigating the adverse\neffects of noise. Experimental results demonstrate the effectiveness and\nsuperiority of our framework across multiple medical segmentation benchmarks\nunder various semi-supervised settings.", "published": "2025-07-28 11:26:24", "link": "http://arxiv.org/abs/2507.20729v1", "categories": ["cs.CV"], "primary_category": "cs.CV"}
{"title": "AIComposer: Any Style and Content Image Composition via Feature Integration", "abstract": "Image composition has advanced significantly with large-scale pre-trained T2I\ndiffusion models. Despite progress in same-domain composition, cross-domain\ncomposition remains under-explored. The main challenges are the stochastic\nnature of diffusion models and the style gap between input images, leading to\nfailures and artifacts. Additionally, heavy reliance on text prompts limits\npractical applications. This paper presents the first cross-domain image\ncomposition method that does not require text prompts, allowing natural\nstylization and seamless compositions. Our method is efficient and robust,\npreserving the diffusion prior, as it involves minor steps for backward\ninversion and forward denoising without training the diffuser. Our method also\nuses a simple multilayer perceptron network to integrate CLIP features from\nforeground and background, manipulating diffusion with a local cross-attention\nstrategy. It effectively preserves foreground content while enabling stable\nstylization without a pre-stylization network. Finally, we create a benchmark\ndataset with diverse contents and styles for fair evaluation, addressing the\nlack of testing datasets for cross-domain image composition. Our method\noutperforms state-of-the-art techniques in both qualitative and quantitative\nevaluations, significantly improving the LPIPS score by 30.5% and the CSD\nmetric by 18.1%. We believe our method will advance future research and\napplications. Code and benchmark at https://github.com/sherlhw/AIComposer.", "published": "2025-07-28 11:19:14", "link": "http://arxiv.org/abs/2507.20721v1", "categories": ["cs.CV"], "primary_category": "cs.CV"}
{"title": "Automatic camera orientation estimation for a partially calibrated camera above a plane with a line at known planar distance", "abstract": "We present a derivation for estimating the roll and pitch orientation of a\npartially calibrated camera mounted above a planar surface, using minimal scene\ninformation. Specifically, we assume known intrinsic parameters and a fixed\nheight between the camera and the observed plane. By detecting a single\nstraight reference line at a known planar distance -- such as the edge between\na floor and a wall -- we estimate the roll and pitch angles via inverse\nprojection geometry. The method leverages geometric constraints and the camera\nmodel, including lens distortion correction. This approach is suitable for\nscenarios where full calibration is impractical and offers a lightweight\nalternative for multi-camera systems operating in constrained environments.", "published": "2025-07-28 10:17:13", "link": "http://arxiv.org/abs/2507.20689v1", "categories": ["cs.CV"], "primary_category": "cs.CV"}
{"title": "Lightweight Transformer-Driven Segmentation of Hotspots and Snail Trails in Solar PV Thermal Imagery", "abstract": "Accurate detection of defects such as hotspots and snail trails in\nphotovoltaic modules is essential for maintaining energy efficiency and system\nreliablility. This work presents a supervised deep learning framework for\nsegmenting thermal infrared images of PV panels, using a dataset of 277 aerial\nthermographic images captured by zenmuse XT infrared camera mounted on a DJI\nMatrice 100 drone. The preprocessing pipeline includes image resizing, CLAHE\nbased contrast enhancement, denoising, and normalisation. A lightweight\nsemantic segmentation model based on SegFormer is developed, featuring a\ncustomised Transformwer encoder and streamlined decoder, and fine-tuned on\nannotated images with manually labeled defect regions. To evaluate performance,\nwe benchmark our model against U-Net, DeepLabV3, PSPNet, and Mask2Former using\nconsistent preprocessing and augmentation. Evaluation metrices includes\nper-class Dice score, F1-score, Cohen's kappa, mean IoU, and pixel accuracy.\nThe SegFormer-based model outperforms baselines in accuracy and efficiency,\nparticularly for segmenting small and irregular defects. Its lightweight design\nreal-time deployment on edge devices and seamless integration with drone-based\nsystems for automated inspection of large-scale solar farms.", "published": "2025-07-28 10:05:13", "link": "http://arxiv.org/abs/2507.20680v1", "categories": ["cs.CV"], "primary_category": "cs.CV"}
{"title": "A Multimodal Architecture for Endpoint Position Prediction in Team-based Multiplayer Games", "abstract": "Understanding and predicting player movement in multiplayer games is crucial\nfor achieving use cases such as player-mimicking bot navigation, preemptive bot\ncontrol, strategy recommendation, and real-time player behavior analytics.\nHowever, the complex environments allow for a high degree of navigational\nfreedom, and the interactions and team-play between players require models that\nmake effective use of the available heterogeneous input data. This paper\npresents a multimodal architecture for predicting future player locations on a\ndynamic time horizon, using a U-Net-based approach for calculating endpoint\nlocation probability heatmaps, conditioned using a multimodal feature encoder.\nThe application of a multi-head attention mechanism for different groups of\nfeatures allows for communication between agents. In doing so, the architecture\nmakes efficient use of the multimodal game state including image inputs,\nnumerical and categorical features, as well as dynamic game data. Consequently,\nthe presented technique lays the foundation for various downstream tasks that\nrely on future player positions such as the creation of player-predictive bot\nbehavior or player anomaly detection.", "published": "2025-07-28 09:51:49", "link": "http://arxiv.org/abs/2507.20670v1", "categories": ["cs.CV", "cs.AI", "cs.LG"], "primary_category": "cs.CV"}
{"title": "Self-Supervised Continuous Colormap Recovery from a 2D Scalar Field Visualization without a Legend", "abstract": "Recovering a continuous colormap from a single 2D scalar field visualization\ncan be quite challenging, especially in the absence of a corresponding color\nlegend. In this paper, we propose a novel colormap recovery approach that\nextracts the colormap from a color-encoded 2D scalar field visualization by\nsimultaneously predicting the colormap and underlying data using a\ndecoupling-and-reconstruction strategy. Our approach first separates the input\nvisualization into colormap and data using a decoupling module, then\nreconstructs the visualization with a differentiable color-mapping module. To\nguide this process, we design a reconstruction loss between the input and\nreconstructed visualizations, which serves both as a constraint to ensure\nstrong correlation between colormap and data during training, and as a\nself-supervised optimizer for fine-tuning the predicted colormap of unseen\nvisualizations during inferencing. To ensure smoothness and correct color\nordering in the extracted colormap, we introduce a compact colormap\nrepresentation using cubic B-spline curves and an associated color order loss.\nWe evaluate our method quantitatively and qualitatively on a synthetic dataset\nand a collection of real-world visualizations from the VIS30K dataset.\nAdditionally, we demonstrate its utility in two prototype applications --\ncolormap adjustment and colormap transfer -- and explore its generalization to\nvisualizations with color legends and ones encoded using discrete color\npalettes.", "published": "2025-07-28 08:46:19", "link": "http://arxiv.org/abs/2507.20632v1", "categories": ["cs.CV", "cs.HC"], "primary_category": "cs.CV"}
{"title": "TransPrune: Token Transition Pruning for Efficient Large Vision-Language Model", "abstract": "Large Vision-Language Models (LVLMs) have advanced multimodal learning but\nface high computational costs due to the large number of visual tokens,\nmotivating token pruning to improve inference efficiency. The key challenge\nlies in identifying which tokens are truly important. Most existing approaches\nrely on attention-based criteria to estimate token importance. However, they\ninherently suffer from certain limitations, such as positional bias. In this\nwork, we explore a new perspective on token importance based on token\ntransitions in LVLMs. We observe that the transition of token representations\nprovides a meaningful signal of semantic information. Based on this insight, we\npropose TransPrune, a training-free and efficient token pruning method.\nSpecifically, TransPrune progressively prunes tokens by assessing their\nimportance through a combination of Token Transition Variation (TTV)-which\nmeasures changes in both the magnitude and direction of token\nrepresentations-and Instruction-Guided Attention (IGA), which measures how\nstrongly the instruction attends to image tokens via attention. Extensive\nexperiments demonstrate that TransPrune achieves comparable multimodal\nperformance to original LVLMs, such as LLaVA-v1.5 and LLaVA-Next, across eight\nbenchmarks, while reducing inference TFLOPs by more than half. Moreover, TTV\nalone can serve as an effective criterion without relying on attention,\nachieving performance comparable to attention-based methods. The code will be\nmade publicly available upon acceptance of the paper at\nhttps://github.com/liaolea/TransPrune.", "published": "2025-07-28 08:44:58", "link": "http://arxiv.org/abs/2507.20630v1", "categories": ["cs.CV", "cs.AI"], "primary_category": "cs.CV"}
{"title": "DAMS:Dual-Branch Adaptive Multiscale Spatiotemporal Framework for Video Anomaly Detection", "abstract": "The goal of video anomaly detection is tantamount to performing\nspatio-temporal localization of abnormal events in the video. The multiscale\ntemporal dependencies, visual-semantic heterogeneity, and the scarcity of\nlabeled data exhibited by video anomalies collectively present a challenging\nresearch problem in computer vision. This study offers a dual-path architecture\ncalled the Dual-Branch Adaptive Multiscale Spatiotemporal Framework (DAMS),\nwhich is based on multilevel feature decoupling and fusion, enabling efficient\nanomaly detection modeling by integrating hierarchical feature learning and\ncomplementary information. The main processing path of this framework\nintegrates the Adaptive Multiscale Time Pyramid Network (AMTPN) with the\nConvolutional Block Attention Mechanism (CBAM). AMTPN enables multigrained\nrepresentation and dynamically weighted reconstruction of temporal features\nthrough a three-level cascade structure (time pyramid pooling, adaptive feature\nfusion, and temporal context enhancement). CBAM maximizes the entropy\ndistribution of feature channels and spatial dimensions through dual attention\nmapping. Simultaneously, the parallel path driven by CLIP introduces a\ncontrastive language-visual pre-training paradigm. Cross-modal semantic\nalignment and a multiscale instance selection mechanism provide high-order\nsemantic guidance for spatio-temporal features. This creates a complete\ninference chain from the underlying spatio-temporal features to high-level\nsemantic concepts. The orthogonal complementarity of the two paths and the\ninformation fusion mechanism jointly construct a comprehensive representation\nand identification capability for anomalous events. Extensive experimental\nresults on the UCF-Crime and XD-Violence benchmarks establish the effectiveness\nof the DAMS framework.", "published": "2025-07-28 08:42:00", "link": "http://arxiv.org/abs/2507.20629v1", "categories": ["cs.CV"], "primary_category": "cs.CV"}
{"title": "Lightweight Remote Sensing Scene Classification on Edge Devices via Knowledge Distillation and Early-exit", "abstract": "As the development of lightweight deep learning algorithms, various deep\nneural network (DNN) models have been proposed for the remote sensing scene\nclassification (RSSC) application. However, it is still challenging for these\nRSSC models to achieve optimal performance among model accuracy, inference\nlatency, and energy consumption on resource-constrained edge devices. In this\npaper, we propose a lightweight RSSC framework, which includes a distilled\nglobal filter network (GFNet) model and an early-exit mechanism designed for\nedge devices to achieve state-of-the-art performance. Specifically, we first\napply frequency domain distillation on the GFNet model to reduce model size.\nThen we design a dynamic early-exit model tailored for DNN models on edge\ndevices to further improve model inference efficiency. We evaluate our E3C\nmodel on three edge devices across four datasets. Extensive experimental\nresults show that it achieves an average of 1.3x speedup on model inference and\nover 40% improvement on energy efficiency, while maintaining high\nclassification accuracy.", "published": "2025-07-28 08:36:36", "link": "http://arxiv.org/abs/2507.20623v1", "categories": ["cs.CV", "cs.AI"], "primary_category": "cs.CV"}
{"title": "Complementarity-driven Representation Learning for Multi-modal Knowledge Graph Completion", "abstract": "Multi-modal Knowledge Graph Completion (MMKGC) aims to uncover hidden world\nknowledge in multimodal knowledge graphs by leveraging both multimodal and\nstructural entity information. However, the inherent imbalance in multimodal\nknowledge graphs, where modality distributions vary across entities, poses\nchallenges in utilizing additional modality data for robust entity\nrepresentation. Existing MMKGC methods typically rely on attention or\ngate-based fusion mechanisms but overlook complementarity contained in\nmulti-modal data. In this paper, we propose a novel framework named Mixture of\nComplementary Modality Experts (MoCME), which consists of a\nComplementarity-guided Modality Knowledge Fusion (CMKF) module and an\nEntropy-guided Negative Sampling (EGNS) mechanism. The CMKF module exploits\nboth intra-modal and inter-modal complementarity to fuse multi-view and\nmulti-modal embeddings, enhancing representations of entities. Additionally, we\nintroduce an Entropy-guided Negative Sampling mechanism to dynamically\nprioritize informative and uncertain negative samples to enhance training\neffectiveness and model robustness. Extensive experiments on five benchmark\ndatasets demonstrate that our MoCME achieves state-of-the-art performance,\nsurpassing existing approaches.", "published": "2025-07-28 08:35:11", "link": "http://arxiv.org/abs/2507.20620v1", "categories": ["cs.AI", "cs.CV"], "primary_category": "cs.AI"}
{"title": "Enhanced Deep Learning DeepFake Detection Integrating Handcrafted Features", "abstract": "The rapid advancement of deepfake and face swap technologies has raised\nsignificant concerns in digital security, particularly in identity verification\nand onboarding processes. Conventional detection methods often struggle to\ngeneralize against sophisticated facial manipulations. This study proposes an\nenhanced deep-learning detection framework that combines handcrafted\nfrequency-domain features with conventional RGB inputs. This hybrid approach\nexploits frequency and spatial domain artifacts introduced during image\nmanipulation, providing richer and more discriminative information to the\nclassifier. Several frequency handcrafted features were evaluated, including\nthe Steganalysis Rich Model, Discrete Cosine Transform, Error Level Analysis,\nSingular Value Decomposition, and Discrete Fourier Transform", "published": "2025-07-28 08:19:22", "link": "http://arxiv.org/abs/2507.20608v1", "categories": ["cs.CV"], "primary_category": "cs.CV"}
{"title": "Harnessing Diffusion-Yielded Score Priors for Image Restoration", "abstract": "Deep image restoration models aim to learn a mapping from degraded image\nspace to natural image space. However, they face several critical challenges:\nremoving degradation, generating realistic details, and ensuring pixel-level\nconsistency. Over time, three major classes of methods have emerged, including\nMSE-based, GAN-based, and diffusion-based methods. However, they fail to\nachieve a good balance between restoration quality, fidelity, and speed. We\npropose a novel method, HYPIR, to address these challenges. Our solution\npipeline is straightforward: it involves initializing the image restoration\nmodel with a pre-trained diffusion model and then fine-tuning it with\nadversarial training. This approach does not rely on diffusion loss, iterative\nsampling, or additional adapters. We theoretically demonstrate that\ninitializing adversarial training from a pre-trained diffusion model positions\nthe initial restoration model very close to the natural image distribution.\nConsequently, this initialization improves numerical stability, avoids mode\ncollapse, and substantially accelerates the convergence of adversarial\ntraining. Moreover, HYPIR inherits the capabilities of diffusion models with\nrich user control, enabling text-guided restoration and adjustable texture\nrichness. Requiring only a single forward pass, it achieves faster convergence\nand inference speed than diffusion-based methods. Extensive experiments show\nthat HYPIR outperforms previous state-of-the-art methods, achieving efficient\nand high-quality image restoration.", "published": "2025-07-28 07:55:34", "link": "http://arxiv.org/abs/2507.20590v1", "categories": ["cs.CV"], "primary_category": "cs.CV"}
{"title": "Methods for the Segmentation of Reticular Structures Using 3D LiDAR Data: A Comparative Evaluation", "abstract": "Reticular structures form the backbone of major infrastructure like bridges,\npylons, and airports, but their inspection and maintenance are costly and\nhazardous, often requiring human intervention. While prior research has focused\non fault detection via images or robotic platform design, the autonomous\nnavigation of robots within these structures is less explored. This study\naddresses that gap by proposing methods to detect navigable surfaces in truss\nstructures, enhancing the autonomy of climbing robots. The paper introduces\nseveral approaches for binary segmentation of navigable surfaces versus\nbackground from 3D point clouds of metallic trusses. These methods fall into\ntwo categories: analytical algorithms and deep learning models. The analytical\napproach features a custom algorithm that segments structures by analyzing the\neigendecomposition of planar patches in the point cloud. In parallel, advanced\ndeep learning models PointNet, PointNet++, MinkUNet34C, and PointTransformerV3\nare trained and evaluated for the same task. Comparative analysis shows that\nthe analytical algorithm offers easier parameter tuning and performance\ncomparable to deep learning models, which, while more computationally\nintensive, excel in segmentation accuracy. Notably, PointTransformerV3 achieves\na Mean Intersection Over Union (mIoU) of about 97%. The study demonstrates the\npromise of both analytical and deep learning methods for improving autonomous\nnavigation in complex truss environments. The results highlight the trade-offs\nbetween computational efficiency and segmentation performance, providing\nvaluable guidance for future research and practical applications in autonomous\ninfrastructure inspection and maintenance.", "published": "2025-07-28 07:55:26", "link": "http://arxiv.org/abs/2507.20589v1", "categories": ["cs.RO", "cs.CV"], "primary_category": "cs.RO"}
{"title": "M-Net: MRI Brain Tumor Sequential Segmentation Network via Mesh-Cast", "abstract": "MRI tumor segmentation remains a critical challenge in medical imaging, where\nvolumetric analysis faces unique computational demands due to the complexity of\n3D data. The spatially sequential arrangement of adjacent MRI slices provides\nvaluable information that enhances segmentation continuity and accuracy, yet\nthis characteristic remains underutilized in many existing models. The spatial\ncorrelations between adjacent MRI slices can be regarded as \"temporal-like\"\ndata, similar to frame sequences in video segmentation tasks. To bridge this\ngap, we propose M-Net, a flexible framework specifically designed for\nsequential image segmentation. M-Net introduces the novel Mesh-Cast mechanism,\nwhich seamlessly integrates arbitrary sequential models into the processing of\nboth channel and temporal information, thereby systematically capturing the\ninherent \"temporal-like\" spatial correlations between MRI slices. Additionally,\nwe define an MRI sequential input pattern and design a Two-Phase Sequential\n(TPS) training strategy, which first focuses on learning common patterns across\nsequences before refining slice-specific feature extraction. This approach\nleverages temporal modeling techniques to preserve volumetric contextual\ninformation while avoiding the high computational cost of full 3D convolutions,\nthereby enhancing the generalizability and robustness of M-Net in sequential\nsegmentation tasks. Experiments on the BraTS2019 and BraTS2023 datasets\ndemonstrate that M-Net outperforms existing methods across all key metrics,\nestablishing itself as a robust solution for temporally-aware MRI tumor\nsegmentation.", "published": "2025-07-28 07:33:29", "link": "http://arxiv.org/abs/2507.20582v1", "categories": ["cs.CV"], "primary_category": "cs.CV"}
{"title": "AV-Deepfake1M++: A Large-Scale Audio-Visual Deepfake Benchmark with Real-World Perturbations", "abstract": "The rapid surge of text-to-speech and face-voice reenactment models makes\nvideo fabrication easier and highly realistic. To encounter this problem, we\nrequire datasets that rich in type of generation methods and perturbation\nstrategy which is usually common for online videos. To this end, we propose\nAV-Deepfake1M++, an extension of the AV-Deepfake1M having 2 million video clips\nwith diversified manipulation strategy and audio-visual perturbation. This\npaper includes the description of data generation strategies along with\nbenchmarking of AV-Deepfake1M++ using state-of-the-art methods. We believe that\nthis dataset will play a pivotal role in facilitating research in Deepfake\ndomain. Based on this dataset, we host the 2025 1M-Deepfakes Detection\nChallenge. The challenge details, dataset and evaluation scripts are available\nonline under a research-only license at https://deepfakes1m.github.io/2025.", "published": "2025-07-28 07:27:42", "link": "http://arxiv.org/abs/2507.20579v1", "categories": ["cs.CV"], "primary_category": "cs.CV"}
{"title": "LSFDNet: A Single-Stage Fusion and Detection Network for Ships Using SWIR and LWIR", "abstract": "Traditional ship detection methods primarily rely on single-modal approaches,\nsuch as visible or infrared images, which limit their application in complex\nscenarios involving varying lighting conditions and heavy fog. To address this\nissue, we explore the advantages of short-wave infrared (SWIR) and long-wave\ninfrared (LWIR) in ship detection and propose a novel single-stage image fusion\ndetection algorithm called LSFDNet. This algorithm leverages feature\ninteraction between the image fusion and object detection subtask networks,\nachieving remarkable detection performance and generating visually impressive\nfused images. To further improve the saliency of objects in the fused images\nand improve the performance of the downstream detection task, we introduce the\nMulti-Level Cross-Fusion (MLCF) module. This module combines object-sensitive\nfused features from the detection task and aggregates features across multiple\nmodalities, scales, and tasks to obtain more semantically rich fused features.\nMoreover, we utilize the position prior from the detection task in the Object\nEnhancement (OE) loss function, further increasing the retention of object\nsemantics in the fused images. The detection task also utilizes preliminary\nfused features from the fusion task to complement SWIR and LWIR features,\nthereby enhancing detection performance. Additionally, we have established a\nNearshore Ship Long-Short Wave Registration (NSLSR) dataset to train effective\nSWIR and LWIR image fusion and detection networks, bridging a gap in this\nfield. We validated the superiority of our proposed single-stage fusion\ndetection algorithm on two datasets. The source code and dataset are available\nat https://github.com/Yanyin-Guo/LSFDNet", "published": "2025-07-28 07:13:55", "link": "http://arxiv.org/abs/2507.20574v1", "categories": ["cs.CV"], "primary_category": "cs.CV"}
{"title": "Learning Phonetic Context-Dependent Viseme for Enhancing Speech-Driven 3D Facial Animation", "abstract": "Speech-driven 3D facial animation aims to generate realistic facial movements\nsynchronized with audio. Traditional methods primarily minimize reconstruction\nloss by aligning each frame with ground-truth. However, this frame-wise\napproach often fails to capture the continuity of facial motion, leading to\njittery and unnatural outputs due to coarticulation. To address this, we\npropose a novel phonetic context-aware loss, which explicitly models the\ninfluence of phonetic context on viseme transitions. By incorporating a viseme\ncoarticulation weight, we assign adaptive importance to facial movements based\non their dynamic changes over time, ensuring smoother and perceptually\nconsistent animations. Extensive experiments demonstrate that replacing the\nconventional reconstruction loss with ours improves both quantitative metrics\nand visual quality. It highlights the importance of explicitly modeling\nphonetic context-dependent visemes in synthesizing natural speech-driven 3D\nfacial animation. Project page: https://cau-irislab.github.io/interspeech25/", "published": "2025-07-28 07:04:50", "link": "http://arxiv.org/abs/2507.20568v1", "categories": ["cs.CV", "cs.AI"], "primary_category": "cs.CV"}
{"title": "MemoryTalker: Personalized Speech-Driven 3D Facial Animation via Audio-Guided Stylization", "abstract": "Speech-driven 3D facial animation aims to synthesize realistic facial motion\nsequences from given audio, matching the speaker's speaking style. However,\nprevious works often require priors such as class labels of a speaker or\nadditional 3D facial meshes at inference, which makes them fail to reflect the\nspeaking style and limits their practical use. To address these issues, we\npropose MemoryTalker which enables realistic and accurate 3D facial motion\nsynthesis by reflecting speaking style only with audio input to maximize\nusability in applications. Our framework consists of two training stages:\n1-stage is storing and retrieving general motion (i.e., Memorizing), and\n2-stage is to perform the personalized facial motion synthesis (i.e.,\nAnimating) with the motion memory stylized by the audio-driven speaking style\nfeature. In this second stage, our model learns about which facial motion types\nshould be emphasized for a particular piece of audio. As a result, our\nMemoryTalker can generate a reliable personalized facial animation without\nadditional prior information. With quantitative and qualitative evaluations, as\nwell as user study, we show the effectiveness of our model and its performance\nenhancement for personalized facial animation over state-of-the-art methods.", "published": "2025-07-28 06:47:59", "link": "http://arxiv.org/abs/2507.20562v1", "categories": ["cs.CV", "cs.AI"], "primary_category": "cs.CV"}
{"title": "FED-PsyAU: Privacy-Preserving Micro-Expression Recognition via Psychological AU Coordination and Dynamic Facial Motion Modeling", "abstract": "Micro-expressions (MEs) are brief, low-intensity, often localized facial\nexpressions. They could reveal genuine emotions individuals may attempt to\nconceal, valuable in contexts like criminal interrogation and psychological\ncounseling. However, ME recognition (MER) faces challenges, such as small\nsample sizes and subtle features, which hinder efficient modeling.\nAdditionally, real-world applications encounter ME data privacy issues, leaving\nthe task of enhancing recognition across settings under privacy constraints\nlargely unexplored. To address these issues, we propose a FED-PsyAU research\nframework. We begin with a psychological study on the coordination of upper and\nlower facial action units (AUs) to provide structured prior knowledge of facial\nmuscle dynamics. We then develop a DPK-GAT network that combines these\npsychological priors with statistical AU patterns, enabling hierarchical\nlearning of facial motion features from regional to global levels, effectively\nenhancing MER performance. Additionally, our federated learning framework\nadvances MER capabilities across multiple clients without data sharing,\npreserving privacy and alleviating the limited-sample issue for each client.\nExtensive experiments on commonly-used ME databases demonstrate the\neffectiveness of our approach.", "published": "2025-07-28 06:42:15", "link": "http://arxiv.org/abs/2507.20557v1", "categories": ["cs.CV"], "primary_category": "cs.CV"}
{"title": "Annotation-Free Human Sketch Quality Assessment", "abstract": "As lovely as bunnies are, your sketched version would probably not do them\njustice (Fig.~\\ref{fig:intro}). This paper recognises this very problem and\nstudies sketch quality assessment for the first time -- letting you find these\nbadly drawn ones. Our key discovery lies in exploiting the magnitude ($L_2$\nnorm) of a sketch feature as a quantitative quality metric. We propose\nGeometry-Aware Classification Layer (GACL), a generic method that makes\nfeature-magnitude-as-quality-metric possible and importantly does it without\nthe need for specific quality annotations from humans. GACL sees feature\nmagnitude and recognisability learning as a dual task, which can be\nsimultaneously optimised under a neat cross-entropy classification loss with\ntheoretic guarantee. This gives GACL a nice geometric interpretation (the\nbetter the quality, the easier the recognition), and makes it agnostic to both\nnetwork architecture changes and the underlying sketch representation. Through\na large scale human study of 160,000 \\doublecheck{trials}, we confirm the\nagreement between our GACL-induced metric and human quality perception. We\nfurther demonstrate how such a quality assessment capability can for the first\ntime enable three practical sketch applications. Interestingly, we show GACL\nnot only works on abstract visual representations such as sketch but also\nextends well to natural images on the problem of image quality assessment\n(IQA). Last but not least, we spell out the general properties of GACL as\ngeneral-purpose data re-weighting strategy and demonstrate its applications in\nvertical problems such as noisy label cleansing. Code will be made publicly\navailable at github.com/yanglan0225/SketchX-Quantifying-Sketch-Quality.", "published": "2025-07-28 06:18:51", "link": "http://arxiv.org/abs/2507.20548v1", "categories": ["cs.CV"], "primary_category": "cs.CV"}
{"title": "T2I-Copilot: A Training-Free Multi-Agent Text-to-Image System for Enhanced Prompt Interpretation and Interactive Generation", "abstract": "Text-to-Image (T2I) generative models have revolutionized content creation\nbut remain highly sensitive to prompt phrasing, often requiring users to\nrepeatedly refine prompts multiple times without clear feedback. While\ntechniques such as automatic prompt engineering, controlled text embeddings,\ndenoising, and multi-turn generation mitigate these issues, they offer limited\ncontrollability, or often necessitate additional training, restricting the\ngeneralization abilities. Thus, we introduce T2I-Copilot, a training-free\nmulti-agent system that leverages collaboration between (Multimodal) Large\nLanguage Models to automate prompt phrasing, model selection, and iterative\nrefinement. This approach significantly simplifies prompt engineering while\nenhancing generation quality and text-image alignment compared to direct\ngeneration. Specifically, T2I-Copilot consists of three agents: (1) Input\nInterpreter, which parses the input prompt, resolves ambiguities, and generates\na standardized report; (2) Generation Engine, which selects the appropriate\nmodel from different types of T2I models and organizes visual and textual\nprompts to initiate generation; and (3) Quality Evaluator, which assesses\naesthetic quality and text-image alignment, providing scores and feedback for\npotential regeneration. T2I-Copilot can operate fully autonomously while also\nsupporting human-in-the-loop intervention for fine-grained control. On\nGenAI-Bench, using open-source generation models, T2I-Copilot achieves a VQA\nscore comparable to commercial models RecraftV3 and Imagen 3, surpasses\nFLUX1.1-pro by 6.17% at only 16.59% of its cost, and outperforms FLUX.1-dev and\nSD 3.5 Large by 9.11% and 6.36%. Code will be released at:\nhttps://github.com/SHI-Labs/T2I-Copilot.", "published": "2025-07-28 05:41:22", "link": "http://arxiv.org/abs/2507.20536v1", "categories": ["cs.CV", "cs.AI", "cs.HC"], "primary_category": "cs.CV"}
{"title": "Low-Cost Machine Vision System for Sorting Green Lentils (Lens Culinaris) Based on Pneumatic Ejection and Deep Learning", "abstract": "This paper presents the design, development, and evaluation of a dynamic\ngrain classification system for green lentils (Lens Culinaris), which leverages\ncomputer vision and pneumatic ejection. The system integrates a YOLOv8-based\ndetection model that identifies and locates grains on a conveyor belt, together\nwith a second YOLOv8-based classification model that categorises grains into\nsix classes: Good, Yellow, Broken, Peeled, Dotted, and Reject. This two-stage\nYOLOv8 pipeline enables accurate, real-time, multi-class categorisation of\nlentils, implemented on a low-cost, modular hardware platform. The pneumatic\nejection mechanism separates defective grains, while an Arduino-based control\nsystem coordinates real-time interaction between the vision system and\nmechanical components. The system operates effectively at a conveyor speed of\n59 mm/s, achieving a grain separation accuracy of 87.2%. Despite a limited\nprocessing rate of 8 grams per minute, the prototype demonstrates the potential\nof machine vision for grain sorting and provides a modular foundation for\nfuture enhancements.", "published": "2025-07-28 05:27:28", "link": "http://arxiv.org/abs/2507.20531v1", "categories": ["cs.CV"], "primary_category": "cs.CV"}
{"title": "Enhancing Spatial Reasoning through Visual and Textual Thinking", "abstract": "The spatial reasoning task aims to reason about the spatial relationships in\n2D and 3D space, which is a fundamental capability for Visual Question\nAnswering (VQA) and robotics. Although vision language models (VLMs) have\ndeveloped rapidly in recent years, they are still struggling with the spatial\nreasoning task. In this paper, we introduce a method that can enhance Spatial\nreasoning through Visual and Textual thinking Simultaneously (SpatialVTS). In\nthe spatial visual thinking phase, our model is trained to generate\nlocation-related specific tokens of essential targets automatically. Not only\nare the objects mentioned in the problem addressed, but also the potential\nobjects related to the reasoning are considered. During the spatial textual\nthinking phase, Our model conducts long-term thinking based on visual cues and\ndialogues, gradually inferring the answers to spatial reasoning problems. To\neffectively support the model's training, we perform manual corrections to the\nexisting spatial reasoning dataset, eliminating numerous incorrect labels\nresulting from automatic annotation, restructuring the data input format to\nenhance generalization ability, and developing thinking processes with logical\nreasoning details. Without introducing additional information (such as masks or\ndepth), our model's overall average level in several spatial understanding\ntasks has significantly improved compared with other models.", "published": "2025-07-28 05:24:54", "link": "http://arxiv.org/abs/2507.20529v1", "categories": ["cs.CV", "cs.AI"], "primary_category": "cs.CV"}
{"title": "AgroBench: Vision-Language Model Benchmark in Agriculture", "abstract": "Precise automated understanding of agricultural tasks such as disease\nidentification is essential for sustainable crop production. Recent advances in\nvision-language models (VLMs) are expected to further expand the range of\nagricultural tasks by facilitating human-model interaction through easy,\ntext-based communication. Here, we introduce AgroBench (Agronomist AI\nBenchmark), a benchmark for evaluating VLM models across seven agricultural\ntopics, covering key areas in agricultural engineering and relevant to\nreal-world farming. Unlike recent agricultural VLM benchmarks, AgroBench is\nannotated by expert agronomists. Our AgroBench covers a state-of-the-art range\nof categories, including 203 crop categories and 682 disease categories, to\nthoroughly evaluate VLM capabilities. In our evaluation on AgroBench, we reveal\nthat VLMs have room for improvement in fine-grained identification tasks.\nNotably, in weed identification, most open-source VLMs perform close to random.\nWith our wide range of topics and expert-annotated categories, we analyze the\ntypes of errors made by VLMs and suggest potential pathways for future VLM\ndevelopment. Our dataset and code are available at\nhttps://dahlian00.github.io/AgroBenchPage/ .", "published": "2025-07-28 04:58:29", "link": "http://arxiv.org/abs/2507.20519v1", "categories": ["cs.CV"], "primary_category": "cs.CV"}
{"title": "T2VParser: Adaptive Decomposition Tokens for Partial Alignment in Text to Video Retrieval", "abstract": "Text-to-video retrieval essentially aims to train models to align visual\ncontent with textual descriptions accurately. Due to the impressive general\nmultimodal knowledge demonstrated by image-text pretrained models such as CLIP,\nexisting work has primarily focused on extending CLIP knowledge for video-text\ntasks. However, videos typically contain richer information than images. In\ncurrent video-text datasets, textual descriptions can only reflect a portion of\nthe video content, leading to partial misalignment in video-text matching.\nTherefore, directly aligning text representations with video representations\ncan result in incorrect supervision, ignoring the inequivalence of information.\nIn this work, we propose T2VParser to extract multiview semantic\nrepresentations from text and video, achieving adaptive semantic alignment\nrather than aligning the entire representation. To extract corresponding\nrepresentations from different modalities, we introduce Adaptive Decomposition\nTokens, which consist of a set of learnable tokens shared across modalities.\nThe goal of T2VParser is to emphasize precise alignment between text and video\nwhile retaining the knowledge of pretrained models. Experimental results\ndemonstrate that T2VParser achieves accurate partial alignment through\neffective cross-modal content decomposition. The code is available at\nhttps://github.com/Lilidamowang/T2VParser.", "published": "2025-07-28 04:55:27", "link": "http://arxiv.org/abs/2507.20518v1", "categories": ["cs.CV", "cs.MM"], "primary_category": "cs.CV"}
{"title": "GaRe: Relightable 3D Gaussian Splatting for Outdoor Scenes from Unconstrained Photo Collections", "abstract": "We propose a 3D Gaussian splatting-based framework for outdoor relighting\nthat leverages intrinsic image decomposition to precisely integrate sunlight,\nsky radiance, and indirect lighting from unconstrained photo collections.\nUnlike prior methods that compress the per-image global illumination into a\nsingle latent vector, our approach enables simultaneously diverse shading\nmanipulation and the generation of dynamic shadow effects. This is achieved\nthrough three key innovations: (1) a residual-based sun visibility extraction\nmethod to accurately separate direct sunlight effects, (2) a region-based\nsupervision framework with a structural consistency loss for physically\ninterpretable and coherent illumination decomposition, and (3) a\nray-tracing-based technique for realistic shadow simulation. Extensive\nexperiments demonstrate that our framework synthesizes novel views with\ncompetitive fidelity against state-of-the-art relighting solutions and produces\nmore natural and multifaceted illumination and shadow effects.", "published": "2025-07-28 04:29:57", "link": "http://arxiv.org/abs/2507.20512v1", "categories": ["cs.CV"], "primary_category": "cs.CV"}
{"title": "Beyond Class Tokens: LLM-guided Dominant Property Mining for Few-shot Classification", "abstract": "Few-shot Learning (FSL), which endeavors to develop the generalization\nability for recognizing novel classes using only a few images, faces\nsignificant challenges due to data scarcity. Recent CLIP-like methods based on\ncontrastive language-image pertaining mitigate the issue by leveraging textual\nrepresentation of the class name for unseen image discovery. Despite the\nachieved success, simply aligning visual representations to class name\nembeddings would compromise the visual diversity for novel class\ndiscrimination. To this end, we proposed a novel Few-Shot Learning (FSL) method\n(BCT-CLIP) that explores \\textbf{dominating properties} via contrastive\nlearning beyond simply using class tokens. Through leveraging LLM-based prior\nknowledge, our method pushes forward FSL with comprehensive structural image\nrepresentations, including both global category representation and the\npatch-aware property embeddings. In particular, we presented a novel\nmulti-property generator (MPG) with patch-aware cross-attentions to generate\nmultiple visual property tokens, a Large-Language Model (LLM)-assistant\nretrieval procedure with clustering-based pruning to obtain dominating property\ndescriptions, and a new contrastive learning strategy for property-token\nlearning. The superior performances on the 11 widely used datasets demonstrate\nthat our investigation of dominating properties advances discriminative\nclass-specific representation learning and few-shot classification.", "published": "2025-07-28 04:23:06", "link": "http://arxiv.org/abs/2507.20511v1", "categories": ["cs.CV"], "primary_category": "cs.CV"}
{"title": "Investigating the Effect of Spatial Context on Multi-Task Sea Ice Segmentation", "abstract": "Capturing spatial context at multiple scales is crucial for deep\nlearning-based sea ice segmentation. However, the optimal specification of\nspatial context based on observation resolution and task characteristics\nremains underexplored. This study investigates the impact of spatial context on\nthe segmentation of sea ice concentration, stage of development, and floe size\nusing a multi-task segmentation model. We implement Atrous Spatial Pyramid\nPooling with varying atrous rates to systematically control the receptive field\nsize of convolutional operations, and to capture multi-scale contextual\ninformation. We explore the interactions between spatial context and feature\nresolution for different sea ice properties and examine how spatial context\ninfluences segmentation performance across different input feature combinations\nfrom Sentinel-1 SAR and Advanced Microwave Radiometer-2 (AMSR2) for multi-task\nmapping. Using Gradient-weighted Class Activation Mapping, we visualize how\natrous rates influence model decisions. Our findings indicate that smaller\nreceptive fields excel for high-resolution Sentinel-1 data, while medium\nreceptive fields yield better performances for stage of development\nsegmentation and larger receptive fields often lead to diminished performances.\nThe fusion of SAR and AMSR2 enhances segmentation across all tasks. We\nhighlight the value of lower-resolution 18.7 and 36.5 GHz AMSR2 channels in sea\nice mapping. These findings highlight the importance of selecting appropriate\nspatial context based on observation resolution and target properties in sea\nice mapping. By systematically analyzing receptive field effects in a\nmulti-task setting, our study provides insights for optimizing deep learning\nmodels in geospatial applications.", "published": "2025-07-28 04:03:36", "link": "http://arxiv.org/abs/2507.20507v1", "categories": ["cs.CV", "eess.IV"], "primary_category": "cs.CV"}
{"title": "An Improved YOLOv8 Approach for Small Target Detection of Rice Spikelet Flowering in Field Environments", "abstract": "Accurately detecting rice flowering time is crucial for timely pollination in\nhybrid rice seed production. This not only enhances pollination efficiency but\nalso ensures higher yields. However, due to the complexity of field\nenvironments and the characteristics of rice spikelets, such as their small\nsize and short flowering period, automated and precise recognition remains\nchallenging.\n  To address this, this study proposes a rice spikelet flowering recognition\nmethod based on an improved YOLOv8 object detection model. First, a\nBidirectional Feature Pyramid Network (BiFPN) replaces the original PANet\nstructure to enhance feature fusion and improve multi-scale feature\nutilization. Second, to boost small object detection, a p2 small-object\ndetection head is added, using finer feature mapping to reduce feature loss\ncommonly seen in detecting small targets. Given the lack of publicly available\ndatasets for rice spikelet flowering in field conditions, a high-resolution RGB\ncamera and data augmentation techniques are used to construct a dedicated\ndataset, providing reliable support for model training and testing.\n  Experimental results show that the improved YOLOv8s-p2 model achieves an\nmAP@0.5 of 65.9%, precision of 67.6%, recall of 61.5%, and F1-score of 64.41%,\nrepresenting improvements of 3.10%, 8.40%, 10.80%, and 9.79%, respectively,\nover the baseline YOLOv8. The model also runs at 69 f/s on the test set,\nmeeting practical application requirements. Overall, the improved YOLOv8s-p2\noffers high accuracy and speed, providing an effective solution for automated\nmonitoring in hybrid rice seed production.", "published": "2025-07-28 04:01:29", "link": "http://arxiv.org/abs/2507.20506v1", "categories": ["cs.CV"], "primary_category": "cs.CV"}
{"title": "Automated 3D-GS Registration and Fusion via Skeleton Alignment and Gaussian-Adaptive Features", "abstract": "In recent years, 3D Gaussian Splatting (3D-GS)-based scene representation\ndemonstrates significant potential in real-time rendering and training\nefficiency. However, most existing methods primarily focus on single-map\nreconstruction, while the registration and fusion of multiple 3D-GS sub-maps\nremain underexplored. Existing methods typically rely on manual intervention to\nselect a reference sub-map as a template and use point cloud matching for\nregistration. Moreover, hard-threshold filtering of 3D-GS primitives often\ndegrades rendering quality after fusion. In this paper, we present a novel\napproach for automated 3D-GS sub-map alignment and fusion, eliminating the need\nfor manual intervention while enhancing registration accuracy and fusion\nquality. First, we extract geometric skeletons across multiple scenes and\nleverage ellipsoid-aware convolution to capture 3D-GS attributes, facilitating\nrobust scene registration. Second, we introduce a multi-factor Gaussian fusion\nstrategy to mitigate the scene element loss caused by rigid thresholding.\nExperiments on the ScanNet-GSReg and our Coord datasets demonstrate the\neffectiveness of the proposed method in registration and fusion. For\nregistration, it achieves a 41.9\\% reduction in RRE on complex scenes, ensuring\nmore precise pose estimation. For fusion, it improves PSNR by 10.11 dB,\nhighlighting superior structural preservation. These results confirm its\nability to enhance scene alignment and reconstruction fidelity, ensuring more\nconsistent and accurate 3D scene representation for robotic perception and\nautonomous navigation.", "published": "2025-07-28 02:36:21", "link": "http://arxiv.org/abs/2507.20480v1", "categories": ["cs.CV"], "primary_category": "cs.CV"}
{"title": "Priority-Aware Pathological Hierarchy Training for Multiple Instance Learning", "abstract": "Multiple Instance Learning (MIL) is increasingly being used as a support tool\nwithin clinical settings for pathological diagnosis decisions, achieving high\nperformance and removing the annotation burden. However, existing approaches\nfor clinical MIL tasks have not adequately addressed the priority issues that\nexist in relation to pathological symptoms and diagnostic classes, causing MIL\nmodels to ignore priority among classes. To overcome this clinical limitation\nof MIL, we propose a new method that addresses priority issues using two\nhierarchies: vertical inter-hierarchy and horizontal intra-hierarchy. The\nproposed method aligns MIL predictions across each hierarchical level and\nemploys an implicit feature re-usability during training to facilitate\nclinically more serious classes within the same level. Experiments with\nreal-world patient data show that the proposed method effectively reduces\nmisdiagnosis and prioritizes more important symptoms in multiclass scenarios.\nFurther analysis verifies the efficacy of the proposed components and\nqualitatively confirms the MIL predictions against challenging cases with\nmultiple symptoms.", "published": "2025-07-28 02:09:29", "link": "http://arxiv.org/abs/2507.20469v1", "categories": ["cs.CV"], "primary_category": "cs.CV"}
{"title": "Frequency-Aware Autoregressive Modeling for Efficient High-Resolution Image Synthesis", "abstract": "Visual autoregressive modeling, based on the next-scale prediction paradigm,\nexhibits notable advantages in image quality and model scalability over\ntraditional autoregressive and diffusion models. It generates images by\nprogressively refining resolution across multiple stages. However, the\ncomputational overhead in high-resolution stages remains a critical challenge\ndue to the substantial number of tokens involved. In this paper, we introduce\nSparseVAR, a plug-and-play acceleration framework for next-scale prediction\nthat dynamically excludes low-frequency tokens during inference without\nrequiring additional training. Our approach is motivated by the observation\nthat tokens in low-frequency regions have a negligible impact on image quality\nin high-resolution stages and exhibit strong similarity with neighboring\ntokens. Additionally, we observe that different blocks in the next-scale\nprediction model focus on distinct regions, with some concentrating on\nhigh-frequency areas. SparseVAR leverages these insights by employing\nlightweight MSE-based metrics to identify low-frequency tokens while preserving\nthe fidelity of excluded regions through a small set of uniformly sampled\nanchor tokens. By significantly reducing the computational cost while\nmaintaining high image generation quality, SparseVAR achieves notable\nacceleration in both HART and Infinity. Specifically, SparseVAR achieves up to\na 2 times speedup with minimal quality degradation in Infinity-2B.", "published": "2025-07-28 01:13:24", "link": "http://arxiv.org/abs/2507.20454v1", "categories": ["cs.CV", "cs.LG"], "primary_category": "cs.CV"}
{"title": "JOLT3D: Joint Learning of Talking Heads and 3DMM Parameters with Application to Lip-Sync", "abstract": "In this work, we revisit the effectiveness of 3DMM for talking head synthesis\nby jointly learning a 3D face reconstruction model and a talking head synthesis\nmodel. This enables us to obtain a FACS-based blendshape representation of\nfacial expressions that is optimized for talking head synthesis. This contrasts\nwith previous methods that either fit 3DMM parameters to 2D landmarks or rely\non pretrained face reconstruction models. Not only does our approach increase\nthe quality of the generated face, but it also allows us to take advantage of\nthe blendshape representation to modify just the mouth region for the purpose\nof audio-based lip-sync. To this end, we propose a novel lip-sync pipeline\nthat, unlike previous methods, decouples the original chin contour from the\nlip-synced chin contour, and reduces flickering near the mouth.", "published": "2025-07-28 01:00:59", "link": "http://arxiv.org/abs/2507.20452v1", "categories": ["cs.CV"], "primary_category": "cs.CV"}
{"title": "WEEP: A Differentiable Nonconvex Sparse Regularizer via Weakly-Convex Envelope", "abstract": "Sparse regularization is fundamental in signal processing for efficient\nsignal recovery and feature extraction. However, it faces a fundamental\ndilemma: the most powerful sparsity-inducing penalties are often\nnon-differentiable, conflicting with gradient-based optimizers that dominate\nthe field. We introduce WEEP (Weakly-convex Envelope of Piecewise Penalty), a\nnovel, fully differentiable sparse regularizer derived from the weakly-convex\nenvelope framework. WEEP provides strong, unbiased sparsity while maintaining\nfull differentiability and L-smoothness, making it natively compatible with any\ngradient-based optimizer. This resolves the conflict between statistical\nperformance and computational tractability. We demonstrate superior performance\ncompared to the L1-norm and other established non-convex sparse regularizers on\nchallenging signal and image denoising tasks.", "published": "2025-07-28 00:40:48", "link": "http://arxiv.org/abs/2507.20447v1", "categories": ["cs.LG", "cs.CV"], "primary_category": "cs.LG"}
{"title": "General Strong Bound on the Uncrossed Number which is Tight for the Edge Crossing Number", "abstract": "We investigate a very recent concept for visualizing various aspects of a\ngraph in the plane using a collection of drawings introduced by Hlin\\v{e}n\\'y\nand Masa\\v{r}\\'ik [GD 2023]. Formally, given a graph $G$, we aim to find an\nuncrossed collection containing drawings of $G$ in the plane such that each\nedge of $G$ is not crossed in at least one drawing in the collection. The\nuncrossed number of $G$ ($unc(G)$) is the smallest integer $k$ such that an\nuncrossed collection for $G$ of size $k$ exists. The uncrossed number is\nlower-bounded by the well-known thickness, which is an edge-decomposition of\n$G$ into planar graphs. This connection gives a trivial lower-bound\n$\\lceil\\frac{|E(G)|}{3|V(G)|-6}\\rceil \\le unc(G)$. In a recent paper, Balko,\nHlin\\v{e}n\\'y, Masa\\v{r}\\'ik, Orthaber, Vogtenhuber, and Wagner [GD 2024]\npresented the first non-trivial and general lower-bound on the uncrossed\nnumber. We summarize it in terms of dense graphs (where\n$|E(G)|=\\epsilon(|V(G)|)^2$ for some $\\epsilon>0$):\n$\\lceil\\frac{|E(G)|}{c_\\epsilon|V(G)|}\\rceil \\le unc(G)$, where $c_\\epsilon\\ge\n2.82$ is a constant depending on $\\epsilon$.\n  We improve the lower-bound to state that\n$\\lceil\\frac{|E(G)|}{3|V(G)|-6-\\sqrt{2|E(G)|}+\\sqrt{6(|V(G)|-2)}}\\rceil \\le\nunc(G)$. Translated to dense graphs regime, the bound yields a multiplicative\nconstant $c'_\\epsilon=3-\\sqrt{(2-\\epsilon)}$ in the expression\n$\\lceil\\frac{|E(G)|}{c'_\\epsilon|V(G)|+o(|V(G)|)}\\rceil \\le unc(G)$. Hence, it\nis tight (up to low-order terms) for $\\epsilon \\approx \\frac{1}{2}$ as\nwarranted by complete graphs.\n  In fact, we formulate our result in the language of the maximum uncrossed\nsubgraph number, that is, the maximum number of edges of $G$ that are not\ncrossed in a drawing of $G$ in the plane. In that case, we also provide a\nconstruction certifying that our bound is asymptotically tight (up to low-order\nterms) on dense graphs for all $\\epsilon>0$.", "published": "2025-07-28 15:50:38", "link": "http://arxiv.org/abs/2507.20937v1", "categories": ["math.CO", "cs.CG", "cs.DM", "68R10", "G.2.2; F.2.2"], "primary_category": "math.CO"}
{"title": "Ternary Binomial and Trinomial Bent Functions in the Completed Maiorana-McFarland Class", "abstract": "Two classes of ternary bent functions of degree four with two and three terms\nin the univariate representation that belong to the completed\nMaiorana-McFarland class are found. Binomials are mappings\n$\\F_{3^{4k}}\\mapsto\\fthree$ given by $f(x)=\\Tr_{4k}\\big(a_1 x^{2(3^k+1)}+a_2\nx^{(3^k+1)^2}\\big)$, where $a_1$ is a nonsquare in $\\F_{3^{4k}}$ and $a_2$ is\ndefined explicitly by $a_1$. Particular subclasses of the binomial bent\nfunctions we found can be represented by exceptional polynomials over\n$\\fthreek$. Bent trinomials are mappings $\\F_{3^{2k}}\\mapsto\\fthree$ given by\n$f(x)=\\Tr_n\\big(a_1 x^{2\\cdot3^k+4} + a_2 x^{3^k+5} + a_3 x^2\\big)$ with\ncoefficients explicitly defined by the parity of $k$. The proof is based on a\nnew criterion that allows checking bentness by analyzing first- and\nsecond-order derivatives of $f$ in the direction of a chosen $n/2$-dimensional\nsubspace.", "published": "2025-07-28 11:08:20", "link": "http://arxiv.org/abs/2507.20715v1", "categories": ["cs.DM"], "primary_category": "cs.DM"}
{"title": "A Generalized Cramér-Rao Bound Using Information Geometry", "abstract": "In information geometry, statistical models are considered as differentiable\nmanifolds, where each probability distribution represents a unique point on the\nmanifold. A Riemannian metric can be systematically obtained from a divergence\nfunction using Eguchi's theory (1992); the well-known Fisher-Rao metric is\nobtained from the Kullback-Leibler (KL) divergence. The geometric derivation of\nthe classical Cram\\'er-Rao Lower Bound (CRLB) by Amari and Nagaoka (2000) is\nbased on this metric. In this paper, we study a Riemannian metric obtained by\napplying Eguchi's theory to the Basu-Harris-Hjort-Jones (BHHJ) divergence\n(1998) and derive a generalized Cram\\'er-Rao bound using Amari-Nagaoka's\napproach. There are potential applications for this bound in robust estimation.", "published": "2025-07-28 17:43:06", "link": "http://arxiv.org/abs/2507.21022v1", "categories": ["math.ST", "cs.IT", "math.IT", "stat.OT", "stat.TH", "62F10, 62F35"], "primary_category": "math.ST"}
{"title": "Handoff Design in User-Centric Cell-Free Massive MIMO Networks Using DRL", "abstract": "In the user-centric cell-free massive MIMO (UC-mMIMO) network scheme, user\nmobility necessitates updating the set of serving access points to maintain the\nuser-centric clustering. Such updates are typically performed through handoff\n(HO) operations; however, frequent HOs lead to overheads associated with the\nallocation and release of resources. This paper presents a deep reinforcement\nlearning (DRL)-based solution to predict and manage these connections for\nmobile users. Our solution employs the Soft Actor-Critic algorithm, with\ncontinuous action space representation, to train a deep neural network to serve\nas the HO policy. We present a novel proposition for a reward function that\nintegrates a HO penalty in order to balance the attainable rate and the\nassociated overhead related to HOs. We develop two variants of our system; the\nfirst one uses mobility direction-assisted (DA) observations that are based on\nthe user movement pattern, while the second one uses history-assisted (HA)\nobservations that are based on the history of the large-scale fading (LSF).\nSimulation results show that our DRL-based continuous action space approach is\nmore scalable than discrete space counterpart, and that our derived HO policy\nautomatically learns to gather HOs in specific time slots to minimize the\noverhead of initiating HOs. Our solution can also operate in real time with a\nresponse time less than 0.4 ms.", "published": "2025-07-28 16:21:45", "link": "http://arxiv.org/abs/2507.20966v1", "categories": ["cs.IT", "cs.AI", "cs.LG", "cs.NI", "eess.SP", "math.IT"], "primary_category": "cs.IT"}
{"title": "Sampling and entropy numbers in the uniform norm", "abstract": "We prove a sharp bound between sampling numbers and entropy numbers in the\nuniform norm for general convex sets of bounded functions.", "published": "2025-07-28 12:33:23", "link": "http://arxiv.org/abs/2507.20770v1", "categories": ["math.FA", "cs.IT", "cs.NA", "math.IT", "math.NA", "41A65, 41A46, 41A50"], "primary_category": "math.FA"}
{"title": "The Random Variables of the DNA Coverage Depth Problem", "abstract": "DNA data storage systems encode digital data into DNA strands, enabling dense\nand durable storage. Efficient data retrieval depends on coverage depth, a key\nperformance metric. We study the random access coverage depth problem and focus\non minimizing the expected number of reads needed to recover information\nstrands encoded via a linear code. We compute the asymptotic performance of a\nrecently proposed code construction, establishing and refining a conjecture in\nthe field by giving two independent proofs. We also analyze a geometric code\nconstruction based on balanced quasi-arcs and optimize its parameters. Finally,\nwe investigate the full distribution of the random variables that arise in the\ncoverage depth problem, of which the traditionally studied expectation is just\nthe first moment. This allows us to distinguish between code constructions\nthat, at first glance, may appear to behave identically.", "published": "2025-07-28 09:04:55", "link": "http://arxiv.org/abs/2507.20645v1", "categories": ["cs.IT", "math.IT"], "primary_category": "cs.IT"}
{"title": "Adaptive Fuzzy Time Series Forecasting via Partially Asymmetric Convolution and Sub-Sliding Window Fusion", "abstract": "At present, state-of-the-art forecasting models are short of the ability to\ncapture spatio-temporal dependency and synthesize global information at the\nstage of learning. To address this issue, in this paper, through the adaptive\nfuzzified construction of temporal data, we propose a novel convolutional\narchitecture with partially asymmetric design based on the scheme of sliding\nwindow to realize accurate time series forecasting. First, the construction\nstrategy of traditional fuzzy time series is improved to further extract short\nand long term temporal interrelation, which enables every time node to\nautomatically possess corresponding global information and inner relationships\namong them in a restricted sliding window and the process does not require\nhuman involvement. Second, a bilateral Atrous algorithm is devised to reduce\ncalculation demand of the proposed model without sacrificing global\ncharacteristics of elements. And it also allows the model to avoid processing\nredundant information. Third, after the transformation of time series, a\npartially asymmetric convolutional architecture is designed to more flexibly\nmine data features by filters in different directions on feature maps, which\ngives the convolutional neural network (CNN) the ability to construct\nsub-windows within existing sliding windows to model at a more fine-grained\nlevel. And after obtaining the time series information at different levels, the\nmulti-scale features from different sub-windows will be sent to the\ncorresponding network layer for time series information fusion. Compared with\nother competitive modern models, the proposed method achieves state-of-the-art\nresults on most of popular time series datasets, which is fully verified by the\nexperimental results.", "published": "2025-07-28 08:58:25", "link": "http://arxiv.org/abs/2507.20641v1", "categories": ["cs.AI", "cs.IT", "math.IT"], "primary_category": "cs.AI"}
{"title": "The Coverage Depth Problem in DNA Storage Over Small Alphabets", "abstract": "The coverage depth problem in DNA data storage is about minimizing the\nexpected number of reads until all data is recovered. When they exist, MDS\ncodes offer the best performance in this context. This paper focuses on the\nscenario where the base field is not large enough to allow the existence of MDS\ncodes. We investigate the performance for the coverage depth problem of codes\ndefined over a small finite field, providing closed formulas for the expected\nnumber of reads for various code families. We also compare the results with the\ntheoretical bounds in asymptotic regimes. The techniques we apply range from\nprobability, to duality theory and combinatorics.", "published": "2025-07-28 08:57:02", "link": "http://arxiv.org/abs/2507.20639v1", "categories": ["cs.IT", "math.CO", "math.IT"], "primary_category": "cs.IT"}
{"title": "A note on the Artstein-Avidan-Milman's generalized Legendre transforms", "abstract": "Artstein-Avidan and Milman [Annals of mathematics (2009), (169):661-674]\ncharacterized invertible reverse-ordering transforms on the space of\nlower-semi-continuous extended real-valued convex functions as affine\ndeformations of the ordinary Legendre transform. In this note, we prove that\nall those generalized Legendre transforms on functions correspond to the\nordinary Legendre transform on dually corresponding affine-deformed functions.\nThat is, generalized convex conjugates are convex conjugates of affine-deformed\nfunctions. We conclude this note by sketching how this result can be\ninterpreted from the lens of information geometry.", "published": "2025-07-28 07:21:57", "link": "http://arxiv.org/abs/2507.20577v1", "categories": ["cs.IT", "cs.LG", "math.IT"], "primary_category": "cs.IT"}
{"title": "Construction of non-generalized Reed-Solomon MDS codes based on systematic generator matrix", "abstract": "Maximum distance separable (MDS) codes are considered optimal because the\nminimum distance cannot be improved for a given length and code size. The most\nprominent MDS codes are likely the generalized Reed-Solomon (GRS) codes. In\n1989, Roth and Lempel constructed a type of MDS code that is not a GRS code\n(referred to as non-GRS). In 2017, Beelen et al. introduced twisted\nReed-Solomon (TRS) codes and demonstrated that many MDS TRS codes are indeed\nnon-GRS. Following this, the definition of TRS codes was generalized to the\nmost comprehensive form, which we refer to as generalized twisted Reed-Solomon\n(GTRS) codes. In this paper, we prove that two families of GTRS codes are\nnon-GRS and provide a systematic generator matrix for a class of GTRS codes.\nInspired by the form of the systematic generator matrix for GTRS codes,we also\npresent a construction of non-GRS MDS codes.", "published": "2025-07-28 06:43:02", "link": "http://arxiv.org/abs/2507.20559v1", "categories": ["cs.IT", "math.IT"], "primary_category": "cs.IT"}
{"title": "Cooperative Jamming Detection Using Low-Rank Structure of Received Signal Matrix", "abstract": "Wireless communication can be simply subjected to malicious attacks due to\nits open nature and shared medium. Detecting jamming attacks is the first and\nnecessary step to adopt the anti-jamming strategies. This paper presents novel\ncooperative jamming detection methods that use the low-rank structure of the\nreceived signal matrix. We employed the likelihood ratio test to propose\ndetectors for various scenarios. We regarded several scenarios with different\nnumbers of friendly and jamming nodes and different levels of available\nstatistical information on noise. We also provided an analytical examination of\nthe false alarm performance of one of the proposed detectors, which can be used\nto adjust the detection threshold. We discussed the synthetic signal generation\nand the Monte Carlo (MC)-based threshold setting method, where knowledge of the\ndistribution of the jamming-free signal, as well as several parameters such as\nnoise variance and channel state information (CSI), is required to accurately\ngenerate synthetic signals for threshold estimation. Extensive simulations\nreveal that the proposed detectors outperform several existing methods,\noffering robust and accurate jamming detection in a collaborative network of\nsensing nodes.", "published": "2025-07-28 03:59:35", "link": "http://arxiv.org/abs/2507.20504v1", "categories": ["cs.IT", "math.IT"], "primary_category": "cs.IT"}
{"title": "Rethinking Multi-User Communication in Semantic Domain: Enhanced OMDMA by Shuffle-Based Orthogonalization and Diffusion Denoising", "abstract": "Inter-user interference remains a critical bottleneck in wireless\ncommunication systems, particularly in the emerging paradigm of semantic\ncommunication (SemCom). Compared to traditional systems, inter-user\ninterference in SemCom severely degrades key semantic information, often\ncausing worse performance than Gaussian noise under the same power level. To\naddress this challenge, inspired by the recently proposed concept of Orthogonal\nModel Division Multiple Access (OMDMA) that leverages semantic orthogonality\nrooted in the personalized joint source and channel (JSCC) models to\ndistinguish users, we propose a novel, scalable framework that eliminates the\nneed for user-specific JSCC models as did in original OMDMA. Our key innovation\nlies in shuffle-based orthogonalization, where randomly permuting the positions\nof JSCC feature vectors transforms inter-user interference into Gaussian-like\nnoise. By assigning each user a unique shuffling pattern, the interference is\ntreated as channel noise, enabling effective mitigation using diffusion models\n(DMs). This approach not only simplifies system design by requiring a single\nuniversal JSCC model but also enhances privacy, as shuffling patterns act as\nimplicit private keys. Additionally, we extend the framework to scenarios\ninvolving semantically correlated data. By grouping users based on semantic\nsimilarity, a cooperative beamforming strategy is introduced to exploit\nredundancy in correlated data, further improving system performance. Extensive\nsimulations demonstrate that the proposed method outperforms state-of-the-art\nmulti-user SemCom frameworks, achieving superior semantic fidelity, robustness\nto interference, and scalability-all without requiring additional training\noverhead.", "published": "2025-07-28 02:25:01", "link": "http://arxiv.org/abs/2507.20477v1", "categories": ["cs.IT", "eess.SP", "math.IT"], "primary_category": "cs.IT"}
{"title": "GenoMAS: A Multi-Agent Framework for Scientific Discovery via Code-Driven Gene Expression Analysis", "abstract": "Gene expression analysis holds the key to many biomedical discoveries, yet\nextracting insights from raw transcriptomic data remains formidable due to the\ncomplexity of multiple large, semi-structured files and the need for extensive\ndomain expertise. Current automation approaches are often limited by either\ninflexible workflows that break down in edge cases or by fully autonomous\nagents that lack the necessary precision for rigorous scientific inquiry.\nGenoMAS charts a different course by presenting a team of LLM-based scientists\nthat integrates the reliability of structured workflows with the adaptability\nof autonomous agents. GenoMAS orchestrates six specialized LLM agents through\ntyped message-passing protocols, each contributing complementary strengths to a\nshared analytic canvas. At the heart of GenoMAS lies a guided-planning\nframework: programming agents unfold high-level task guidelines into Action\nUnits and, at each juncture, elect to advance, revise, bypass, or backtrack,\nthereby maintaining logical coherence while bending gracefully to the\nidiosyncrasies of genomic data.\n  On the GenoTEX benchmark, GenoMAS reaches a Composite Similarity Correlation\nof 89.13% for data preprocessing and an F$_1$ of 60.48% for gene\nidentification, surpassing the best prior art by 10.61% and 16.85%\nrespectively. Beyond metrics, GenoMAS surfaces biologically plausible\ngene-phenotype associations corroborated by the literature, all while adjusting\nfor latent confounders. Code is available at https://github.com/Liu-Hy/GenoMAS.", "published": "2025-07-28 17:55:08", "link": "http://arxiv.org/abs/2507.21035v1", "categories": ["cs.AI", "cs.LG", "cs.MA", "q-bio.GN"], "primary_category": "cs.AI"}
{"title": "Core Safety Values for Provably Corrigible Agents", "abstract": "We introduce the first implementable framework for corrigibility, with\nprovable guarantees in multi-step, partially observed environments. Our\nframework replaces a single opaque reward with five *structurally separate*\nutility heads -- deference, switch-access preservation, truthfulness,\nlow-impact behavior via a belief-based extension of Attainable Utility\nPreservation, and bounded task reward -- combined lexicographically by strict\nweight gaps. Theorem 1 proves exact single-round corrigibility in the partially\nobservable off-switch game; Theorem 3 extends the guarantee to multi-step,\nself-spawning agents, showing that even if each head is \\emph{learned} to\nmean-squared error $\\varepsilon$ and the planner is $\\varepsilon$-sub-optimal,\nthe probability of violating \\emph{any} safety property is bounded while still\nensuring net human benefit. In contrast to Constitutional AI or RLHF/RLAIF,\nwhich merge all norms into one learned scalar, our separation makes obedience\nand impact-limits dominate even when incentives conflict. For open-ended\nsettings where adversaries can modify the agent, we prove that deciding whether\nan arbitrary post-hack agent will ever violate corrigibility is undecidable by\nreduction to the halting problem, then carve out a finite-horizon ``decidable\nisland'' where safety can be certified in randomized polynomial time and\nverified with privacy-preserving, constant-round zero-knowledge proofs.\nConsequently, the remaining challenge is the ordinary ML task of data coverage\nand generalization: reward-hacking risk is pushed into evaluation quality\nrather than hidden incentive leak-through, giving clearer implementation\nguidance for today's LLM assistants and future autonomous systems.", "published": "2025-07-28 16:19:25", "link": "http://arxiv.org/abs/2507.20964v1", "categories": ["cs.AI", "cs.CC", "cs.GT", "cs.LG", "cs.MA"], "primary_category": "cs.AI"}
{"title": "Explicit and Effectively Symmetric Runge-Kutta Methods", "abstract": "Symmetry is a key property of numerical methods. The geometric properties of\nsymmetric schemes make them an attractive option for integrating Hamiltonian\nsystems, whilst their ability to exactly recover the initial condition without\nthe need to store the entire solution trajectory makes them ideal for the\nefficient implementation of Neural ODEs. In this work, we present a Hopf\nalgebraic approach to the study of symmetric B-series methods. We show that\nevery B-series method can be written as the composition of a symmetric and\n\"antisymmetric\" component, and explore the structure of this decomposition for\nRunge-Kutta schemes. A major bottleneck of symmetric Runge-Kutta schemes is\ntheir implicit nature, which requires solving a nonlinear system at each step.\nBy introducing a new set of order conditions which minimise the antisymmetric\ncomponent of a scheme, we derive what we call Explicit and Effectively\nSymmetric (EES) schemes -- a new class of explicit Runge-Kutta schemes with\nnear-symmetric properties. We present examples of second-order EES schemes and\ndemonstrate that, despite their low order, these schemes readily outperform\nhigher-order explicit schemes such as RK4 and RK5, and achieve results\ncomparable to implicit symmetric schemes at a significantly lower computational\ncost.", "published": "2025-07-28 17:19:07", "link": "http://arxiv.org/abs/2507.21006v1", "categories": ["math.NA", "cs.NA", "math.CA", "math.RA", "16T05, 65L05, 65L06, 05C05"], "primary_category": "math.NA"}
{"title": "Stochastic gradient with least-squares control variates", "abstract": "The stochastic gradient descent (SGD) method is a widely used approach for\nsolving stochastic optimization problems, but its convergence is typically\nslow. Existing variance reduction techniques, such as SAGA, improve convergence\nby leveraging stored gradient information; however, they are restricted to\nsettings where the objective functional is a finite sum, and their performance\ndegrades when the number of terms in the sum is large. In this work, we propose\na novel approach which is well suited when the objective is given by an\nexpectation over random variables with a continuous probability distribution.\nOur method constructs a control variate by fitting a linear model to past\ngradient evaluations using weighted discrete least-squares, effectively\nreducing variance while preserving computational efficiency. We establish\ntheoretical sublinear convergence guarantees for strongly convex objectives and\ndemonstrate the method's effectiveness through numerical experiments on random\nPDE-constrained optimization problems.", "published": "2025-07-28 16:43:27", "link": "http://arxiv.org/abs/2507.20981v1", "categories": ["math.OC", "cs.NA", "math.NA"], "primary_category": "math.OC"}
{"title": "Methodology for intelligent injection point location based on geometric algorithms and discrete topologies for virtual digital twin environments", "abstract": "This article presents an innovative methodology for locating injection points\nin injection-molded parts using intelligent models with geometric algorithms\nfor discrete topologies. The first algorithm calculates the center of mass of\nthe discrete model based on the center of mass of each triangular facet in the\nsystem, ensuring uniform molten plastic distribution during mold cavity\nfilling. Two sub-algorithms intelligently evaluate the geometry and optimal\ninjection point location. The first sub-algorithm generates a geometric matrix\nbased on a two-dimensional nodal quadrature adapted to the part's bounding box.\nThe second sub-algorithm projects the nodal matrix and associated circular\nareas orthogonally on the part's surface along the demolding direction. The\noptimal injection point location is determined by minimizing the distance to\nthe center of mass from the first algorithm's result. This novel methodology\nhas been validated through rheological simulations in six case studies with\ncomplex geometries. The results demonstrate uniform and homogeneous molten\nplastic distribution with minimal pressure loss during the filling phase.\nImportantly, this methodology does not require expert intervention, reducing\ntime and costs associated with manual injection mold feed system design. It is\nalso adaptable to various design environments and virtual twin systems, not\ntied to specific CAD software. The validated results surpass the state of the\nart, offering an agile alternative for digital twin applications in new product\ndesign environments, reducing dependence on experts, facilitating designer\ntraining, and ultimately cutting costs", "published": "2025-07-28 15:25:30", "link": "http://arxiv.org/abs/2507.20922v1", "categories": ["cs.GR", "cs.NA", "math.NA"], "primary_category": "cs.GR"}
{"title": "Enhancing Complex Injection Mold Design Validation Using Multicombined RV Environments", "abstract": "The intricate design of real complex injection molds poses significant\nchallenges. Mold design vali-dation often falls to operators with tool-handling\nexperience but limited CAD proficiency. Unlike other industries, the scale and\ncosts of injection mold fabrication hinder prototyping before pro-duction.\nVirtual reality (VR) has emerged as a revolutionary solution offering a safe,\nimmersive, and realistic experience and accessible using QR codes. This paper\npresents a new multimodal virtual environment tailored to validate mold design\ncomplexities. Integrating knowledge-enriched visual tools like interactive 3D\nmodels and dynamic visualizations enables users to explore complex mold\ndesigns. Statistical analyses, including the Wilcoxon test, unveil significant\ndifferences in interference detection, internal topology tracking, and\nvalidation of assembly and disassembly accessibility for both small and large\nmold components when comparing validation conducted through traditional means\nusing solely CAD systems versus the utilization of multidimensional validation\nmethods. Efficiency gains in using VR devices for mold design validation in a\nhybrid environment in the analysis of relative frequencies. The present study\nsurpasses the state of the art illustrating how VR technology can substantially\nreduce manufacturing errors in injection molding processes, thereby offering\nimportant advantages for manufacturers emerging as an essential tool for this\nimpact in-dustry in the next years.", "published": "2025-07-28 11:34:17", "link": "http://arxiv.org/abs/2507.20732v1", "categories": ["math.NA", "cs.NA"], "primary_category": "math.NA"}
{"title": "A general framework for the OSRC-preconditioned EFIE in computational electromagnetics", "abstract": "This work presents a comprehensive study of preconditioning strategies for\nthe Electric Field Integral Equation (EFIE) using On-Surface Radiation\nCondition (OSRC) operators. We examine two distinct formulations -- the\nMagnetic-to-Electric (MtE) and Electric-to-Magnetic (EtM) maps -- used to\nprecondition the EFIE, and we analyze their spectral properties, discretization\nbehavior, and numerical performance. A central objective is to bridge the gap\nbetween theoretical development and practical implementation, identifying the\nstrengths and limitations of each approach. Through numerical experiments on\nsmooth, closed geometries, we show that the MtE formulation stands out as a\ncost-effective preconditioner in the context of Boundary Element Methods. We\nalso offer implementation guidelines and propose improvements to address\nexisting challenges. These findings provide a valuable reference for\nresearchers and practitioners working with preconditioned boundary integral\nformulations in computational electromagnetics.", "published": "2025-07-28 11:00:28", "link": "http://arxiv.org/abs/2507.20707v1", "categories": ["math.NA", "cs.NA"], "primary_category": "math.NA"}
{"title": "A fixed-time stable dynamical model for solving EVLCPs", "abstract": "A fixed-time stable dynamical system for solving the extended vertical linear\ncomplementarity problem (EVLCP) is developed. The system is based on the\nreformulation of EVLCP as a special case of a new kind of generalized absolute\nvalue equations. Some properties of the new kind of generalized absolute value\nequations are explored which are useful for developing a fixed-time stable\ndynamical system for solving it. Without using any smoothing technique, we\ndevelop a dynamical system for solving the new kind of generalized absolute\nvalue equations and prove its fixed-time stability. The model is applicable for\nsolving EVLCP. As two by-products, a new condition which guarantees the unique\nsolvability of EVLCP and a new error bound of EVLCP are given. Numerical\nresults are given to demonstrate our claims.", "published": "2025-07-28 09:20:34", "link": "http://arxiv.org/abs/2507.20652v1", "categories": ["math.NA", "cs.NA", "math.OC", "90C33, 65H10, 90C30"], "primary_category": "math.NA"}
{"title": "Matrices with invariant by rotation numerical ranges", "abstract": "We characterize the d x d matrices whose numerical ranges are invariant by\nrotations of angle 2$\\pi$/d.", "published": "2025-07-28 08:45:39", "link": "http://arxiv.org/abs/2507.20631v1", "categories": ["math.FA", "cs.NA", "math.NA"], "primary_category": "math.FA"}
{"title": "On rank-2 Nonnegative Matrix Factorizations and their variants", "abstract": "We consider the problem of finding the best nonnegative rank-2 approximation\nof an arbitrary nonnegative matrix. We first revisit the theory, including an\nexplicit parametrization of all possible nonnegative factorizations of a\nnonnegative matrix of rank 2. Based on this result, we construct a cheaply\ncomputable (albeit suboptimal) nonnegative rank-2 approximation for an\narbitrary nonnegative matrix input. This can then be used as a starting point\nfor the Alternating Nonnegative Least Squares method to find a nearest\napproximate nonnegative rank-2 factorization of the input; heuristically, our\nnewly proposed initial value results in both improved computational complexity\nand enhanced output quality. We provide extensive numerical experiments to\nsupport these claims. Motivated by graph-theoretical applications, we also\nstudy some variants of the problem, including matrices with symmetry\nconstraints.", "published": "2025-07-28 08:26:45", "link": "http://arxiv.org/abs/2507.20612v1", "categories": ["math.NA", "cs.NA", "15B48, 65F99, 15A23, 15A18"], "primary_category": "math.NA"}
{"title": "Operator Inference Aware Quadratic Manifolds with Isotropic Reduced Coordinates for Nonintrusive Model Reduction", "abstract": "Quadratic manifolds for nonintrusive reduced modeling are typically trained\nto minimize the reconstruction error on snapshot data, which means that the\nerror of models fitted to the embedded data in downstream learning steps is\nignored. In contrast, we propose a greedy training procedure that takes into\naccount both the reconstruction error on the snapshot data and the prediction\nerror of reduced models fitted to the data. Because our procedure learns\nquadratic manifolds with the objective of achieving accurate reduced models, it\navoids oscillatory and other non-smooth embeddings that can hinder learning\naccurate reduced models. Numerical experiments on transport and turbulent flow\nproblems show that quadratic manifolds trained with the proposed greedy\napproach lead to reduced models with up to two orders of magnitude higher\naccuracy than quadratic manifolds trained with respect to the reconstruction\nerror alone.", "published": "2025-07-28 01:45:55", "link": "http://arxiv.org/abs/2507.20463v1", "categories": ["math.DS", "cs.LG", "cs.NA", "math.NA", "35A01, 65L10, 65L12, 65L20, 65L70"], "primary_category": "math.DS"}
{"title": "A generalized ENO reconstruction in compact GKS for compressible flow simulations", "abstract": "This paper presents a generalized ENO (GENO)-type nonlinear reconstruction\nscheme for compressible flow simulations. The proposed reconstruction preserves\nthe accuracy of the linear scheme while maintaining essentially non-oscillatory\nbehavior at discontinuities. By generalizing the adaptive philosophy of ENO\nschemes, the method employs a smooth path function that directly connects\nhigh-order linear reconstruction with a reliable lower-order alternative. This\ndirect adaptive approach significantly simplifies the construction of nonlinear\nschemes, particularly for very high-order methods on unstructured meshes. A\ncomparative analysis with various WENO methods demonstrates the reliability and\naccuracy of the proposed reconstruction, which provides an optimal transition\nbetween linear and nonlinear reconstructions across all limiting cases based on\nstencil smoothness. The consistency and performance of the GENO reconstruction\nare validated through implementation in both high-order compact gas-kinetic\nschemes (GKS) and non-compact Riemann-solver-based methods. Benchmark tests\nconfirm the robustness and shock-capturing capabilities of GENO, with\nparticularly superior performance when integrated with compact schemes. This\nwork advances the construction methodology of nonlinear schemes and establishes\nENO-type reconstruction as a mature and practical approach for engineering\napplications.", "published": "2025-07-28 01:42:26", "link": "http://arxiv.org/abs/2507.20461v1", "categories": ["math.NA", "cs.NA", "physics.comp-ph"], "primary_category": "math.NA"}
{"title": "Diagonally-Weighted Generalized Method of Moments Estimation for Gaussian Mixture Modeling", "abstract": "Since Pearson [Philosophical Transactions of the Royal Society of London. A,\n185 (1894), pp. 71-110] first applied the method of moments (MM) for modeling\ndata as a mixture of one-dimensional Gaussians, moment-based estimation methods\nhave proliferated. Among these methods, the generalized method of moments (GMM)\nimproves the statistical efficiency of MM by weighting the moments\nappropriately. However, the computational complexity and storage complexity of\nMM and GMM grow exponentially with the dimension, making these methods\nimpractical for high-dimensional data or when higher-order moments are\nrequired. Such computational bottlenecks are more severe in GMM since it\nadditionally requires estimating a large weighting matrix. To overcome these\nbottlenecks, we propose the diagonally-weighted GMM (DGMM), which achieves a\nbalance among statistical efficiency, computational complexity, and numerical\nstability. We apply DGMM to study the parameter estimation problem for weakly\nseparated heteroscedastic low-rank Gaussian mixtures and design a\ncomputationally efficient and numerically stable algorithm that obtains the\nDGMM estimator without explicitly computing or storing the moment tensors. We\nimplement the proposed algorithm and empirically validate the advantages of\nDGMM: in numerical studies, DGMM attains smaller estimation errors while\nrequiring substantially shorter runtime than MM and GMM. The code and data will\nbe available upon publication at https://github.com/liu-lzhang/dgmm.", "published": "2025-07-28 01:24:55", "link": "http://arxiv.org/abs/2507.20459v1", "categories": ["cs.LG", "cs.NA", "math.NA", "math.ST", "stat.ME", "stat.ML", "stat.TH", "62F12, 62H30, 15A69, 65Y20"], "primary_category": "cs.LG"}
{"title": "Transformers as Unrolled Inference in Probabilistic Laplacian Eigenmaps: An Interpretation and Potential Improvements", "abstract": "We propose a probabilistic interpretation of transformers as unrolled\ninference steps assuming a probabilistic Laplacian Eigenmaps model from the\nProbDR framework. Our derivation shows that at initialisation, transformers\nperform \"linear\" dimensionality reduction. We also show that within the\ntransformer block, a graph Laplacian term arises from our arguments, rather\nthan an attention matrix (which we interpret as an adjacency matrix). We\ndemonstrate that simply subtracting the identity from the attention matrix (and\nthereby taking a graph diffusion step) improves validation performance on a\nlanguage model and a simple vision transformer.", "published": "2025-07-28 17:56:34", "link": "http://arxiv.org/abs/2507.21040v1", "categories": ["cs.LG", "stat.ML"], "primary_category": "cs.LG"}
{"title": "Personalized Treatment Effect Estimation from Unstructured Data", "abstract": "Existing methods for estimating personalized treatment effects typically rely\non structured covariates, limiting their applicability to unstructured data.\nYet, leveraging unstructured data for causal inference has considerable\napplication potential, for instance in healthcare, where clinical notes or\nmedical images are abundant. To this end, we first introduce an approximate\n'plug-in' method trained directly on the neural representations of unstructured\ndata. However, when these fail to capture all confounding information, the\nmethod may be subject to confounding bias. We therefore introduce two\ntheoretically grounded estimators that leverage structured measurements of the\nconfounders during training, but allow estimating personalized treatment\neffects purely from unstructured inputs, while avoiding confounding bias. When\nthese structured measurements are only available for a non-representative\nsubset of the data, these estimators may suffer from sampling bias. To address\nthis, we further introduce a regression-based correction that accounts for the\nnon-uniform sampling, assuming the sampling mechanism is known or can be\nwell-estimated. Our experiments on two benchmark datasets show that the plug-in\nmethod, directly trainable on large unstructured datasets, achieves strong\nempirical performance across all settings, despite its simplicity.", "published": "2025-07-28 16:52:31", "link": "http://arxiv.org/abs/2507.20993v1", "categories": ["cs.LG", "cs.AI", "stat.ML"], "primary_category": "cs.LG"}
{"title": "Locally Adaptive Conformal Inference for Operator Models", "abstract": "Operator models are regression algorithms for functional data and have become\na key tool for emulating large-scale dynamical systems. Recent advances in deep\nneural operators have dramatically improved the accuracy and scalability of\noperator modeling, but lack an inherent notion of predictive uncertainty. We\nintroduce Local Spectral Conformal Inference (LSCI), a new framework for\nlocally adaptive, distribution-free uncertainty quantification for neural\noperator models. LSCI uses projection-based depth scoring and localized\nconformal inference to generate function-valued prediction sets with\nstatistical guarantees. We prove approximate finite-sample marginal coverage\nunder local exchangeability, and demonstrate significant gains in adaptivity\nand coverage across synthetic and real-world operator learning tasks.", "published": "2025-07-28 16:37:56", "link": "http://arxiv.org/abs/2507.20975v1", "categories": ["stat.ML", "cs.LG"], "primary_category": "stat.ML"}
{"title": "Multivariate Conformal Prediction via Conformalized Gaussian Scoring", "abstract": "While achieving exact conditional coverage in conformal prediction is\nunattainable without making strong, untestable regularity assumptions, the\npromise of conformal prediction hinges on finding approximations to conditional\nguarantees that are realizable in practice. A promising direction for obtaining\nconditional dependence for conformal sets--in particular capturing\nheteroskedasticity--is through estimating the conditional density\n$\\mathbb{P}_{Y|X}$ and conformalizing its level sets. Previous work in this\nvein has focused on nonconformity scores based on the empirical cumulative\ndistribution function (CDF). Such scores are, however, computationally costly,\ntypically requiring expensive sampling methods. To avoid the need for sampling,\nwe observe that the CDF-based score reduces to a Mahalanobis distance in the\ncase of Gaussian scores, yielding a closed-form expression that can be directly\nconformalized. Moreover, the use of a Gaussian-based score opens the door to a\nnumber of extensions of the basic conformal method; in particular, we show how\nto construct conformal sets with missing output values, refine conformal sets\nas partial information about $Y$ becomes available, and construct conformal\nsets on transformations of the output space. Finally, empirical results\nindicate that our approach produces conformal sets that more closely\napproximate conditional coverage in multivariate settings compared to\nalternative methods.", "published": "2025-07-28 15:55:29", "link": "http://arxiv.org/abs/2507.20941v1", "categories": ["stat.ML", "cs.AI", "cs.LG", "stat.ME", "stat.OT"], "primary_category": "stat.ML"}
{"title": "Statistical Inference for Differentially Private Stochastic Gradient Descent", "abstract": "Privacy preservation in machine learning, particularly through Differentially\nPrivate Stochastic Gradient Descent (DP-SGD), is critical for sensitive data\nanalysis. However, existing statistical inference methods for SGD predominantly\nfocus on cyclic subsampling, while DP-SGD requires randomized subsampling. This\npaper first bridges this gap by establishing the asymptotic properties of SGD\nunder the randomized rule and extending these results to DP-SGD. For the output\nof DP-SGD, we show that the asymptotic variance decomposes into statistical,\nsampling, and privacy-induced components. Two methods are proposed for\nconstructing valid confidence intervals: the plug-in method and the random\nscaling method. We also perform extensive numerical analysis, which shows that\nthe proposed confidence intervals achieve nominal coverage rates while\nmaintaining privacy.", "published": "2025-07-28 06:45:15", "link": "http://arxiv.org/abs/2507.20560v1", "categories": ["stat.ML", "cs.LG", "stat.ME"], "primary_category": "stat.ML"}
{"title": "Improving Group Fairness in Tensor Completion via Imbalance Mitigating Entity Augmentation", "abstract": "Group fairness is important to consider in tensor decomposition to prevent\ndiscrimination based on social grounds such as gender or age. Although few\nworks have studied group fairness in tensor decomposition, they suffer from\nperformance degradation. To address this, we propose STAFF(Sparse Tensor\nAugmentation For Fairness) to improve group fairness by minimizing the gap in\ncompletion errors of different groups while reducing the overall tensor\ncompletion error. Our main idea is to augment a tensor with augmented entities\nincluding sufficient observed entries to mitigate imbalance and group bias in\nthe sparse tensor. We evaluate \\method on tensor completion with various\ndatasets under conventional and deep learning-based tensor models. STAFF\nconsistently shows the best trade-off between completion error and group\nfairness; at most, it yields 36% lower MSE and 59% lower MADE than the\nsecond-best baseline.", "published": "2025-07-28 05:59:35", "link": "http://arxiv.org/abs/2507.20542v1", "categories": ["cs.LG", "stat.ML"], "primary_category": "cs.LG"}
{"title": "End-to-End DOA-Guided Speech Extraction in Noisy Multi-Talker Scenarios", "abstract": "Target Speaker Extraction (TSE) plays a critical role in enhancing speech\nsignals in noisy and multi-speaker environments. This paper presents an\nend-to-end TSE model that incorporates Direction of Arrival (DOA) and beamwidth\nembeddings to extract speech from a specified spatial region centered around\nthe DOA. Our approach efficiently captures spatial and temporal features,\nenabling robust performance in highly complex scenarios with multiple\nsimultaneous speakers. Experimental results demonstrate that the proposed model\nnot only significantly enhances the target speech within the defined beamwidth\nbut also effectively suppresses interference from other directions, producing a\nclear and isolated target voice. Furthermore, the model achieves remarkable\nimprovements in downstream Automatic Speech Recognition (ASR) tasks, making it\nparticularly suitable for real-world applications.", "published": "2025-07-28 15:36:30", "link": "http://arxiv.org/abs/2507.20926v1", "categories": ["eess.AS"], "primary_category": "eess.AS"}
{"title": "MIMII-Agent: Leveraging LLMs with Function Calling for Relative Evaluation of Anomalous Sound Detection", "abstract": "This paper proposes a method for generating machine-type-specific anomalies\nto evaluate the relative performance of unsupervised anomalous sound detection\n(UASD) systems across different machine types, even in the absence of real\nanomaly sound data. Conventional keyword-based data augmentation methods often\nproduce unrealistic sounds due to their reliance on manually defined labels,\nlimiting scalability as machine types and anomaly patterns diversify. Advanced\naudio generative models, such as MIMII-Gen, show promise but typically depend\non anomalous training data, making them less effective when diverse anomalous\nexamples are unavailable. To address these limitations, we propose a novel\nsynthesis approach leveraging large language models (LLMs) to interpret textual\ndescriptions of faults and automatically select audio transformation functions,\nconverting normal machine sounds into diverse and plausible anomalous sounds.\nWe validate this approach by evaluating a UASD system trained only on normal\nsounds from five machine types, using both real and synthetic anomaly data.\nExperimental results reveal consistent trends in relative detection difficulty\nacross machine types between synthetic and real anomalies. This finding\nsupports our hypothesis and highlights the effectiveness of the proposed\nLLM-based synthesis approach for relative evaluation of UASD systems.", "published": "2025-07-28 09:42:41", "link": "http://arxiv.org/abs/2507.20666v1", "categories": ["eess.AS", "cs.AI", "cs.LG", "cs.SD"], "primary_category": "eess.AS"}
{"title": "Controllable Video-to-Music Generation with Multiple Time-Varying Conditions", "abstract": "Music enhances video narratives and emotions, driving demand for automatic\nvideo-to-music (V2M) generation. However, existing V2M methods relying solely\non visual features or supplementary textual inputs generate music in a\nblack-box manner, often failing to meet user expectations. To address this\nchallenge, we propose a novel multi-condition guided V2M generation framework\nthat incorporates multiple time-varying conditions for enhanced control over\nmusic generation. Our method uses a two-stage training strategy that enables\nlearning of V2M fundamentals and audiovisual temporal synchronization while\nmeeting users' needs for multi-condition control. In the first stage, we\nintroduce a fine-grained feature selection module and a progressive temporal\nalignment attention mechanism to ensure flexible feature alignment. For the\nsecond stage, we develop a dynamic conditional fusion module and a\ncontrol-guided decoder module to integrate multiple conditions and accurately\nguide the music composition process. Extensive experiments demonstrate that our\nmethod outperforms existing V2M pipelines in both subjective and objective\nevaluations, significantly enhancing control and alignment with user\nexpectations.", "published": "2025-07-28 08:41:20", "link": "http://arxiv.org/abs/2507.20627v1", "categories": ["cs.MM", "cs.AI", "cs.SD", "eess.AS"], "primary_category": "cs.MM"}
{"title": "Binaural Sound Event Localization and Detection based on HRTF Cues for Humanoid Robots", "abstract": "This paper introduces Binaural Sound Event Localization and Detection\n(BiSELD), a task that aims to jointly detect and localize multiple sound events\nusing binaural audio, inspired by the spatial hearing mechanism of humans. To\nsupport this task, we present a synthetic benchmark dataset, called the\nBinaural Set, which simulates realistic auditory scenes using measured\nhead-related transfer functions (HRTFs) and diverse sound events. To\neffectively address the BiSELD task, we propose a new input feature\nrepresentation called the Binaural Time-Frequency Feature (BTFF), which encodes\ninteraural time difference (ITD), interaural level difference (ILD), and\nhigh-frequency spectral cues (SC) from binaural signals. BTFF is composed of\neight channels, including left and right mel-spectrograms, velocity-maps,\nSC-maps, and ITD-/ILD-maps, designed to cover different spatial cues across\nfrequency bands and spatial axes. A CRNN-based model, BiSELDnet, is then\ndeveloped to learn both spectro-temporal patterns and HRTF-based localization\ncues from BTFF. Experiments on the Binaural Set show that each BTFF sub-feature\nenhances task performance: V-map improves detection, ITD-/ILD-maps enable\naccurate horizontal localization, and SC-map captures vertical spatial cues.\nThe final system achieves a SELD error of 0.110 with 87.1% F-score and\n4.4{\\deg} localization error, demonstrating the effectiveness of the proposed\nframework in mimicking human-like auditory perception.", "published": "2025-07-28 05:27:07", "link": "http://arxiv.org/abs/2507.20530v1", "categories": ["eess.AS", "cs.SD"], "primary_category": "eess.AS"}
{"title": "On Using the Shapley Value for Anomaly Localization: A Statistical Investigation", "abstract": "Recent publications have suggested using the Shapley value for anomaly\nlocalization for sensor data systems. Using a reasonable mathematical anomaly\nmodel for full control, experiments indicate that using a single fixed term in\nthe Shapley value calculation achieves a lower complexity anomaly localization\ntest, with the same probability of error, as a test using the Shapley value for\nall cases tested. A proof demonstrates these conclusions must be true for all\nindependent observation cases. For dependent observation cases, no proof is\navailable.", "published": "2025-07-28 17:43:53", "link": "http://arxiv.org/abs/2507.21023v1", "categories": ["cs.LG", "eess.SP"], "primary_category": "cs.LG"}
{"title": "Analytical Modeling of Batteryless IoT Sensors Powered by Ambient Energy Harvesting", "abstract": "This paper presents a comprehensive mathematical model to characterize the\nenergy dynamics of batteryless IoT sensor nodes powered entirely by ambient\nenergy harvesting. The model captures both the energy harvesting and\nconsumption phases, explicitly incorporating power management tasks to enable\nprecise estimation of device behavior across diverse environmental conditions.\nThe proposed model is applicable to a wide range of IoT devices and supports\nintelligent power management units designed to maximize harvested energy under\nfluctuating environmental conditions. We validated our model against a\nprototype batteryless IoT node, conducting experiments under three distinct\nillumination scenarios. Results show a strong correlation between analytical\nand measured supercapacitor voltage profiles, confirming the proposed model's\naccuracy.", "published": "2025-07-28 16:02:46", "link": "http://arxiv.org/abs/2507.20952v1", "categories": ["eess.SP", "94C30", "I.2.9"], "primary_category": "eess.SP"}
{"title": "Interference Analysis and Successive Interference Cancellation for Multistatic OFDM-based ISAC Systems", "abstract": "Multistatic integrated sensing and communications (ISAC) systems, which use\ndistributed transmitters and receivers, offer enhanced spatial coverage and\nsensing accuracy compared to stand-alone ISAC configurations. However, these\nsystems face challenges due to interference between co-existing ISAC nodes,\nespecially during simultaneous operation. In this paper, we analyze the impact\nof this mutual interference arising from the co-existence in a multistatic ISAC\nscenario, where a mono- and a bistatic ISAC system share the same spectral\nresources. We first classify differenct types of interference in the power\ndomain. Then, we discuss how the interference can affect both sensing and\ncommunications in terms of bit error rate (BER), error vector magnitude (EVM),\nand radar image under varied transmit power and RCS configurations through\nsimulations. Along with interfernce analysis, we propose a low-complexity\nsuccessive interference cancellation method that adaptively cancels either the\nmonostatic reflection or the bistatic line-of-sight signal based on a\nmonostatic radar image signal-to-interference-plus-noise ratio (SINR). The\nproposed framework is evaluated with both simulations and proof-of-concept\nmeasurements using an ISAC testbed with a radar echo generator for object\nemulation. The results have shown that the proposed method reduces BER and\nimproves EVM as well as radar image SINR across a wide range of SINR\nconditions. These results demonstrate that accurate component-wise cancellation\ncan be achieved with low computational overhead, making the method suitable for\npractical applications.", "published": "2025-07-28 15:56:12", "link": "http://arxiv.org/abs/2507.20942v1", "categories": ["eess.SP"], "primary_category": "eess.SP"}
{"title": "Precision spectral estimation at sub-Hz frequencies: closed-form posteriors and Bayesian noise projection", "abstract": "We present a Bayesian method for estimating spectral quantities in\nmultivariate Gaussian time series. The approach, based on periodograms and\nWishart statistics, yields closed-form expressions at any given frequency for\nthe marginal posterior distributions of the individual power spectral\ndensities, the pairwise coherence, and the multiple coherence, as well as for\nthe joint posterior distribution of the full cross-spectral density matrix. In\nthe context of noise projection - where one series is modeled as a linear\ncombination of filtered versions of the others, plus a background component -\nthe method also provides closed-form posteriors for both the susceptibilities,\ni.e., the filter transfer functions, and the power spectral density of the\nbackground. Originally developed for the analysis of the data from the European\nSpace Agency's LISA Pathfinder mission, the method is particularly well-suited\nto very-low-frequency data, where long observation times preclude averaging\nover large sets of periodograms, which would otherwise allow these to be\ntreated as approximately normally distributed.", "published": "2025-07-28 13:54:37", "link": "http://arxiv.org/abs/2507.20846v1", "categories": ["astro-ph.IM", "eess.SP", "stat.AP"], "primary_category": "astro-ph.IM"}
{"title": "Chirp-Permuted AFDM: A New Degree of Freedom for Next-Generation Versatile Waveform Design", "abstract": "We present a novel multicarrier waveform, termed chirp-permuted affine\nfrequency division multiplexing (CP-AFDM), which introduces a unique\nchirp-permutation domain on top of the chirp subcarriers of the conventional\nAFDM. Rigorous analysis of the signal model and waveform properties, supported\nby numerical simulations, demonstrates that the proposed CP-AFDM preserves all\ncore characteristics of affine frequency division multiplexing (AFDM) -\nincluding robustness to doubly-dispersive channels, peak-to-average power ratio\n(PAPR), and full delay-Doppler representation - while further enhancing\nambiguity function resolution and peak-to-sidelobe ratio (PSLR) in the Doppler\ndomain. These improvements establish CP-AFDM as a highly attractive candidate\nfor emerging sixth generation (6G) use cases demanding both reliability and\nsensing-awareness. Moreover, by exploiting the vast degree of freedom in the\nchirp-permutation domain, two exemplary multifunctional applications are\nintroduced: an index modulation (IM) technique over the permutation domain\nwhich achieves significant spectral efficiency gains, and a physical-layer\nsecurity scheme that ensures practically perfect security through\npermutation-based keying, without requiring additional transmit energy or\nsignaling overhead.", "published": "2025-07-28 13:30:48", "link": "http://arxiv.org/abs/2507.20825v1", "categories": ["eess.SP"], "primary_category": "eess.SP"}
{"title": "UAV-Borne Digital Radar System for Coherent Multistatic SAR Imaging", "abstract": "Advancements in analog-to-digital converter (ADC) technology have enabled\nhigher sampling rates, making it feasible to adopt digital radar architectures\nthat directly sample the radio-frequency (RF) signal, eliminating the need for\nanalog downconversion. This digital approach supports greater flexibility in\nwaveform design and signal processing, particularly through digital modulation\nschemes like orthogonal frequency division multiplexing (OFDM). This paper\npresents a digital radar system mounted on an uncrewed aerial vehicle (UAV),\nwhich employs OFDM waveforms for coherent multistatic synthetic aperture radar\n(SAR) imaging in the L-band. The radar setup features a primary UAV node\nresponsible for signal transmission and monostatic data acquisition, alongside\nsecondary nodes that operate in a receive-only mode. These secondary nodes\ncapture the radar signal reflected from the scene as well as a direct sidelink\nsignal. RF signals from both the radar and sidelink paths are sampled and\nprocessed offline. To manage data storage efficiently, a trigger mechanism is\nemployed to record only the relevant portions of the radar signal. The system\nmaintains coherency in both fast-time and slow-time domains, which is essential\nfor multistatic SAR imaging. Because the secondary nodes are passive, the\nsystem can be easily scaled to accommodate a larger swarm of UAVs. The paper\ndetails the full signal processing workflow for both monostatic and multistatic\nSAR image formation, including an analysis and correction of synchronization\nerrors that arise from the uncoupled operation of the nodes. The proposed\ncoherent processing method is validated through static radar measurements,\ndemonstrating coherency achieved by the concept. Additionally, a UAV-based\nbistatic SAR experiment demonstrates the system's performance by producing\nhigh-resolution monostatic, bistatic, and combined multistatic SAR images.", "published": "2025-07-28 13:03:16", "link": "http://arxiv.org/abs/2507.20792v1", "categories": ["eess.SY", "cs.SY", "eess.SP"], "primary_category": "eess.SY"}
{"title": "DT-Aided Resource Management in Spectrum Sharing Integrated Satellite-Terrestrial Networks", "abstract": "The integrated satellite-terrestrial networks (ISTNs) through spectrum\nsharing have emerged as a promising solution to improve spectral efficiency and\nmeet increasing wireless demand. However, this coexistence introduces\nsignificant challenges, including inter-system interference (ISI) and the low\nEarth orbit satellite (LSat) movements. To capture the actual environment for\nresource management, we propose a time-varying digital twin (DT)-aided\nframework for ISTNs incorporating 3D map that enables joint optimization of\nbandwidth (BW) allocation, traffic steering, and resource allocation, and aims\nto minimize congestion. The problem is formulated as a mixed-integer nonlinear\nprogramming (MINLP), addressed through a two-phase algorithm based on\nsuccessive convex approximation (SCA) and compressed sensing approaches.\nNumerical results demonstrate the proposed method's superior performance in\nqueue length minimization compared to benchmarks.", "published": "2025-07-28 13:00:40", "link": "http://arxiv.org/abs/2507.20789v1", "categories": ["eess.SP"], "primary_category": "eess.SP"}
{"title": "A Nonlinear Spectral Approach for Radar-Based Heartbeat Estimation via Autocorrelation of Higher Harmonics", "abstract": "This study presents a nonlinear signal processing method for accurate\nradar-based heartbeat interval estimation by exploiting the periodicity of\nhigher-order harmonics inherent in heartbeat signals. Unlike conventional\napproaches that employ selective frequency filtering or track individual\nharmonics, the proposed method enhances the global periodic structure of the\nspectrum via nonlinear correlation processing. Specifically, smoothing and\nsecond-derivative operations are first applied to the radar displacement signal\nto suppress noise and accentuate higher-order heartbeat harmonics. Rather than\nisolating specific frequency components, we compute localized autocorrelations\nof the Fourier spectrum around the harmonic frequencies. The incoherent\nsummation of these autocorrelations yields a pseudo-spectrum in which the\nfundamental heartbeat periodicity is distinctly emphasized. This nonlinear\napproach mitigates the effects of respiratory harmonics and noise, enabling\nrobust interbeat interval estimation. Experiments with radar measurements from\nfive participants demonstrate that the proposed method reduces root-mean-square\nerror by 20% and improves the correlation coefficient by 0.20 relative to\nconventional techniques.", "published": "2025-07-28 09:35:05", "link": "http://arxiv.org/abs/2507.20664v1", "categories": ["eess.SP"], "primary_category": "eess.SP"}
{"title": "The micro-Doppler Attack Against AI-based Human Activity Classification from Wireless Signals", "abstract": "A subset of Human Activity Classification (HAC) systems are based on AI\nalgorithms that use passively collected wireless signals. This paper presents\nthe micro-Doppler attack targeting HAC from wireless orthogonal frequency\ndivision multiplexing (OFDM) signals. The attack is executed by inserting\nartificial variations in a transmitted OFDM waveform to alter its micro-Doppler\nsignature when it reflects off a human target. We investigate two variants of\nour scheme that manipulate the waveform at different time scales resulting in\naltered receiver spectrograms. HAC accuracy with a deep convolutional neural\nnetwork (CNN) can be reduced to less than 10%.", "published": "2025-07-28 09:23:18", "link": "http://arxiv.org/abs/2507.20657v1", "categories": ["eess.SP"], "primary_category": "eess.SP"}
{"title": "Angle-distance decomposition based on deep learning for active sonar detection", "abstract": "Underwater target detection using active sonar constitutes a critical\nresearch area in marine sciences and engineering. However, traditional signal\nprocessing methods face significant challenges in complex underwater\nenvironments due to noise, reverberation, and interference. To address these\nissues, this paper presents a deep learning-based active sonar target detection\nmethod that decomposes the detection process into separate angle and distance\nestimation tasks. Active sonar target detection employs deep learning models to\npredict target distance and angle, with the final target position determined by\nintegrating these estimates. Limited underwater acoustic data hinders effective\nmodel training, but transfer learning and simulation offer practical solutions\nto this challenge. Experimental results verify that the method achieves\neffective and robust performance under challenging conditions.", "published": "2025-07-28 09:20:23", "link": "http://arxiv.org/abs/2507.20651v1", "categories": ["eess.SP"], "primary_category": "eess.SP"}
{"title": "RFI and Jamming Detection in Antenna Arrays with an LSTM Autoencoder", "abstract": "Radio frequency interference (RFI) and malicious jammers are a significant\nproblem in our wireless world. De- tecting RFI or jamming is typically\nperformed with model-based statistical detection or AI-empowered algorithms\nthat use an input baseband data or time-frequency representations like\nspectrograms. In this work we depart from the previous approaches and we\nleverage data in antenna array systems. We use Fourier imaging to localize\nspatially the sources and then deploy a deep LSTM autoencoder that detects RFI\nand jamming as anomalies. Our results for different power levels of the\nRFI/jamming sources, and the signal of interest, reveal that our detector\noffers high performance without needing any pre-existing knowledge regarding\nthe RFI or jamming signal.", "published": "2025-07-28 09:12:52", "link": "http://arxiv.org/abs/2507.20648v1", "categories": ["eess.SP"], "primary_category": "eess.SP"}
{"title": "Real-Time Distributed Optical Fiber Vibration Recognition via Extreme Lightweight Model and Cross-Domain Distillation", "abstract": "Distributed optical fiber vibration sensing (DVS) systems offer a promising\nsolution for large-scale monitoring and intrusion event recognition. However,\ntheir practical deployment remains hindered by two major challenges:\ndegradation of recognition accuracy in dynamic conditions, and the\ncomputational bottleneck of real-time processing for mass sensing data. This\npaper presents a new solution to these challenges, through a FPGA-accelerated\nextreme lightweight model along with a newly proposed knowledge distillation\nframework. The proposed three-layer depthwise separable convolution network\ncontains only 4141 parameters, which is the most compact architecture in this\nfield to date, and achieves a maximum processing speed of 0.019 ms for each\nsample covering a 12.5 m fiber length over 0.256 s. This performance\ncorresponds to real-time processing capabilities for sensing fibers extending\nup to 168.68 km. To improve generalizability under changing environments, the\nproposed cross-domain distillation framework guided by physical priors is used\nhere to embed frequency-domain insights into the time-domain model. This allows\nfor time-frequency representation learning without increasing complexity and\nboosts recognition accuracy from 51.93% to 95.72% under unseen environmental\nconditions. The proposed methodology provides key advancements including a\nframework combining interpretable signal processing technique with deep\nlearning and a reference architecture for real-time processing and\nedge-computing in DVS systems, and more general distributed optical fiber\nsensing (DOFS) area. It mitigates the trade-off between sensing range and\nreal-time capability, bridging the gap between theoretical capabilities and\npractical deployment requirements. Furthermore, this work reveals a new\ndirection for building more efficient, robust and explainable artificial\nintelligence systems for DOFS technologies.", "published": "2025-07-28 07:52:18", "link": "http://arxiv.org/abs/2507.20587v1", "categories": ["eess.SP", "cs.SY", "eess.SY"], "primary_category": "eess.SP"}
{"title": "Energy-Efficient Secure Communications via Joint Optimization of UAV Trajectory and Movable-Antenna Array Beamforming", "abstract": "This paper investigates the potential of unmanned aerial vehicles (UAVs)\nequipped with movable-antenna (MA) arrays to strengthen security in wireless\ncommunication systems. We propose a novel framework that jointly optimizes the\nUAV trajectory and the reconfigurable beamforming of the MA array to maximize\nsecrecy energy efficiency, while ensuring reliable communication with\nlegitimate users. By exploiting the spatial degrees of freedom enabled by the\nMA array, the system can form highly directional beams and deep nulls, thereby\nsignificantly improving physical layer security. Numerical results demonstrate\nthat the proposed approach achieves superior secrecy energy efficiency,\nattributed to the enhanced spatial flexibility provided by the movable antenna\narchitecture.", "published": "2025-07-28 02:55:00", "link": "http://arxiv.org/abs/2507.20489v1", "categories": ["eess.SP"], "primary_category": "eess.SP"}
