{"title": "Convergence of a Deep BSDE solver with jumps", "abstract": "We study the error arising in the numerical approximation of FBSDEs and\nrelated PIDEs by means of a deep learning-based method. Our results focus on\ndecoupled FBSDEs with jumps and extend the seminal work of HAn and Long (2020)\nanalyzing the numerical error of the deep BSDE solver proposed in E et al.\n(2017). We provide a priori and a posteriori error estimates for the finite and\ninfinite activity case.", "published": "2025-01-16 18:21:14", "link": "http://arxiv.org/abs/2501.09727v1", "categories": ["math.PR", "cs.NA", "math.NA", "math.OC", "q-fin.CP", "q-fin.PR", "60H35, 65C30, 65N75"], "primary_category": "math.PR"}
{"title": "ADAGE: A generic two-layer framework for adaptive agent based modelling", "abstract": "Agent-based models (ABMs) are valuable for modelling complex, potentially\nout-of-equilibria scenarios. However, ABMs have long suffered from the Lucas\ncritique, stating that agent behaviour should adapt to environmental changes.\nFurthermore, the environment itself often adapts to these behavioural changes,\ncreating a complex bi-level adaptation problem. Recent progress integrating\nmulti-agent reinforcement learning into ABMs introduces adaptive agent\nbehaviour, beginning to address the first part of this critique, however, the\napproaches are still relatively ad hoc, lacking a general formulation, and\nfurthermore, do not tackle the second aspect of simultaneously adapting\nenvironmental level characteristics in addition to the agent behaviours. In\nthis work, we develop a generic two-layer framework for ADaptive AGEnt based\nmodelling (ADAGE) for addressing these problems. This framework formalises the\nbi-level problem as a Stackelberg game with conditional behavioural policies,\nproviding a consolidated framework for adaptive agent-based modelling based on\nsolving a coupled set of non-linear equations. We demonstrate how this generic\napproach encapsulates several common (previously viewed as distinct) ABM tasks,\nsuch as policy design, calibration, scenario generation, and robust behavioural\nlearning under one unified framework. We provide example simulations on\nmultiple complex economic and financial environments, showing the strength of\nthe novel framework under these canonical settings, addressing long-standing\ncritiques of traditional ABMs.", "published": "2025-01-16 09:58:24", "link": "http://arxiv.org/abs/2501.09429v1", "categories": ["cs.MA", "cs.AI", "cs.LG", "econ.GN", "q-fin.CP", "q-fin.EC"], "primary_category": "cs.MA"}
{"title": "Optimal Execution among $N$ Traders with Transient Price Impact", "abstract": "We study $N$-player optimal execution games in an Obizhaeva--Wang model of\ntransient price impact. When the game is regularized by an instantaneous cost\non the trading rate, a unique equilibrium exists and we derive its closed form.\nWhereas without regularization, there is no equilibrium. We prove that\nexistence is restored if (and only if) a very particular, time-dependent cost\non block trades is added to the model. In that case, the equilibrium is\nparticularly tractable. We show that this equilibrium is the limit of the\nregularized equilibria as the instantaneous cost parameter $\\varepsilon$ tends\nto zero. Moreover, we explain the seemingly ad-hoc block cost as the limit of\nthe equilibrium instantaneous costs. Notably, in contrast to the single-player\nproblem, the optimal instantaneous costs do not vanish in the limit\n$\\varepsilon\\to0$. We use this tractable equilibrium to study the cost of\nliquidating in the presence of predators and the cost of anarchy. Our results\nalso give a new interpretation to the erratic behaviors previously observed in\ndiscrete-time trading games with transient price impact.", "published": "2025-01-16 16:27:52", "link": "http://arxiv.org/abs/2501.09638v1", "categories": ["q-fin.TR", "q-fin.MF", "91A06, 91A15, 91G10"], "primary_category": "q-fin.TR"}
{"title": "LLM-Based Routing in Mixture of Experts: A Novel Framework for Trading", "abstract": "Recent advances in deep learning and large language models (LLMs) have\nfacilitated the deployment of the mixture-of-experts (MoE) mechanism in the\nstock investment domain. While these models have demonstrated promising trading\nperformance, they are often unimodal, neglecting the wealth of information\navailable in other modalities, such as textual data. Moreover, the traditional\nneural network-based router selection mechanism fails to consider contextual\nand real-world nuances, resulting in suboptimal expert selection. To address\nthese limitations, we propose LLMoE, a novel framework that employs LLMs as the\nrouter within the MoE architecture. Specifically, we replace the conventional\nneural network-based router with LLMs, leveraging their extensive world\nknowledge and reasoning capabilities to select experts based on historical\nprice data and stock news. This approach provides a more effective and\ninterpretable selection mechanism. Our experiments on multimodal real-world\nstock datasets demonstrate that LLMoE outperforms state-of-the-art MoE models\nand other deep neural network approaches. Additionally, the flexible\narchitecture of LLMoE allows for easy adaptation to various downstream tasks.", "published": "2025-01-16 16:25:30", "link": "http://arxiv.org/abs/2501.09636v2", "categories": ["cs.LG", "q-fin.TR"], "primary_category": "cs.LG"}
{"title": "Agent-Based Simulation of a Perpetual Futures Market", "abstract": "I introduce an agent-based model of a Perpetual Futures market with\nheterogeneous agents trading via a central limit order book. Perpetual Futures\n(henceforth Perps) are financial derivatives introduced by the economist Robert\nShiller, designed to peg their price to that of the underlying Spot market.\nThis paper extends the limit order book model of Chiarella et al. (2002) by\ntaking their agent and orderbook parameters, designed for a simple stock\nexchange, and applying it to the more complex environment of a Perp market with\nlong and short traders who exhibit both positional and basis-trading behaviors.\nI find that despite the simplicity of the agent behavior, the simulation is\nable to reproduce the most salient feature of a Perp market, the pegging of the\nPerp price to the underlying Spot price. In contrast to fundamental simulations\nof stock markets which aim to reproduce empirically observed stylized facts\nsuch as the leptokurtosis and heteroscedasticity of returns, volatility\nclustering and others, in derivatives markets many of these features are\nprovided exogenously by the underlying Spot price signal. This is especially\ntrue of Perps since the derivative is designed to mimic the price of the Spot\nmarket. Therefore, this paper will focus exclusively on analyzing how market\nand agent parameters such as order lifetime, trading horizon and spread affect\nthe premiums at which Perps trade with respect to the underlying Spot market. I\nshow that this simulation provides a simple and robust environment for\nexploring the dynamics of Perpetual Futures markets and their microstructure in\nthis regard. Lastly, I explore the ability of the model to reproduce the\neffects of biasing long traders to trade positionally and short traders to\nbasis-trade, which was the original intention behind the market design, and is\na tendency observed empirically in real Perp markets.", "published": "2025-01-16 09:19:08", "link": "http://arxiv.org/abs/2501.09404v1", "categories": ["q-fin.TR"], "primary_category": "q-fin.TR"}
