{"title": "Improving DeFi Accessibility through Efficient Liquidity Provisioning with Deep Reinforcement Learning", "abstract": "This paper applies deep reinforcement learning (DRL) to optimize liquidity\nprovisioning in Uniswap v3, a decentralized finance (DeFi) protocol\nimplementing an automated market maker (AMM) model with concentrated liquidity.\nWe model the liquidity provision task as a Markov Decision Process (MDP) and\ntrain an active liquidity provider (LP) agent using the Proximal Policy\nOptimization (PPO) algorithm. The agent dynamically adjusts liquidity positions\nby using information about price dynamics to balance fee maximization and\nimpermanent loss mitigation. We use a rolling window approach for training and\ntesting, reflecting realistic market conditions and regime shifts. This study\ncompares the data-driven performance of the DRL-based strategy against common\nheuristics adopted by small retail LP actors that do not systematically modify\ntheir liquidity positions. By promoting more efficient liquidity management,\nthis work aims to make DeFi markets more accessible and inclusive for a broader\nrange of participants. Through a data-driven approach to liquidity management,\nthis work seeks to contribute to the ongoing development of more efficient and\nuser-friendly DeFi markets.", "published": "2025-01-13 17:27:11", "link": "http://arxiv.org/abs/2501.07508v1", "categories": ["q-fin.CP", "cs.LG"], "primary_category": "q-fin.CP"}
{"title": "Pricing Quanto and Composite Contracts with Local-Correlation Models", "abstract": "Pricing composite and quanto contracts requires a joint model of both the\nunderlying asset and the exchange rate. In this contribution, we explore the\npotential of local-correlation models to address the challenges of calibrating\nsynthetic quanto forward contracts and composite options quoted in the market.\nSpecifically, we design on-line calibration procedures for generic local and\nstochastic volatility models. The paper concludes with a numerical study\nassessing the calibration performance of these methodologies and comparing them\nto simpler approximations of the correlation structure.", "published": "2025-01-13 10:52:29", "link": "http://arxiv.org/abs/2501.07200v1", "categories": ["q-fin.PR", "q-fin.CP", "65C05, 91G20, 91G60"], "primary_category": "q-fin.PR"}
{"title": "How low-cost AI universal approximators reshape market efficiency", "abstract": "The efficient market hypothesis (EMH) famously stated that prices fully\nreflect the information available to traders. This critically depends on the\ntransfer of information into prices through trading strategies. Traders\noptimise their strategy with models of increasing complexity that identify the\nrelationship between information and profitable trades more and more\naccurately. Under specific conditions, the increased availability of low-cost\nuniversal approximators, such as AI systems, should be naturally pushing\ntowards more advanced trading strategies, potentially making it harder and\nharder for inefficient traders to profit. In this paper, we leverage on a\ngeneralised notion of market efficiency, based on the definition of an\nequilibrium price process, that allows us to distinguish different levels of\nmodel complexity through investors' beliefs, and trading strategies\noptimisation, and discuss the relationship between AI-powered trading and the\ntime-evolution of market efficiency. Finally, we outline the need for and the\nchallenge of describing out-of-equilibrium market dynamics in an adaptive\nmulti-agent environment.", "published": "2025-01-13 17:06:25", "link": "http://arxiv.org/abs/2501.07489v1", "categories": ["q-fin.MF", "q-fin.GN", "q-fin.TR"], "primary_category": "q-fin.MF"}
{"title": "Follow the Leader: Enhancing Systematic Trend-Following Using Network Momentum", "abstract": "We present a systematic, trend-following strategy, applied to commodity\nfutures markets, that combines univariate trend indicators with cross-sectional\ntrend indicators that capture so-called {\\em momentum spillover}, which can\noccur when there is a lead-lag relationship between the trending behaviour of\ndifferent markets. Our strategy utilises two methods for detecting lead-lag\nrelationships, with a method for computing {\\em network momentum}, to produce a\nnovel trend-following indicator. We use our new trend indicator to construct a\nportfolio whose performance we compare to a baseline model which uses only\nunivariate indicators, and demonstrate statistically significant improvements\nin Sharpe ratio, skewness of returns, and downside performance, using synthetic\nbootstrapped data samples taken from time-series of actual prices.", "published": "2025-01-13 08:53:44", "link": "http://arxiv.org/abs/2501.07135v1", "categories": ["q-fin.TR", "q-fin.MF"], "primary_category": "q-fin.TR"}
