{"title": "On the number of asynchronous attractors in AND-NOT Boolean networks", "abstract": "Boolean Networks (BNs) describe the time evolution of binary states using\nlogic functions on the nodes of a network. They are fundamental models for\ncomplex discrete dynamical systems, with applications in various areas of\nscience and engineering, and especially in systems biology. A key aspect of the\ndynamical behavior of BNs is the number of attractors, which determines the\ndiversity of long-term system trajectories. Due to the noisy nature and\nincomplete characterization of biological systems, a stochastic asynchronous\nupdate scheme is often more appropriate than the deterministic synchronous one.\nAND-NOT BNs, whose logic functions are the conjunction of literals, are an\nimportant subclass of BNs because of their structural simplicity and their\nusefulness in analyzing biological systems for which the only information\navailable is a collection of interactions among components. In this paper, we\nestablish new theoretical results regarding asynchronous attractors in AND-NOT\nBNs. We derive two new upper bounds for the number of asynchronous attractors\nin an AND-NOT BN based on structural properties (strong even cycles and\ndominating sets, respectively) of the AND-NOT BN. These findings contribute to\na more comprehensive understanding of asynchronous dynamics in AND-NOT BNs,\nwith implications for attractor enumeration and counting, as well as for\nnetwork design and control.", "published": "2025-03-24 21:06:32", "link": "http://arxiv.org/abs/2503.19147v1", "categories": ["cs.DM", "cs.LO"], "primary_category": "cs.DM"}
{"title": "When Distances Lie: Euclidean Embeddings in the Presence of Outliers and Distance Violations", "abstract": "Distance geometry explores the properties of distance spaces that can be\nexactly represented as the pairwise Euclidean distances between points in\n$\\mathbb{R}^d$ ($d \\geq 1$), or equivalently, distance spaces that can be\nisometrically embedded in $\\mathbb{R}^d$. In this work, we investigate whether\na distance space can be isometrically embedded in $\\mathbb{R}^d$ after applying\na limited number of modifications. Specifically, we focus on two types of\nmodifications: outlier deletion (removing points) and distance modification\n(adjusting distances between points). The central problem, Euclidean Embedding\nEditing (EEE), asks whether an input distance space on $n$ points can be\ntransformed, using at most $k$ modifications, into a space that is\nisometrically embeddable in $\\mathbb{R}^d$.\n  We present several fixed-parameter tractable (FPT) and approximation\nalgorithms for this problem. Our first result is an algorithm that solves EEE\nin time $(dk)^{\\mathcal{O}(d+k)} + n^{\\mathcal{O}(1)}$. The core subroutine of\nthis algorithm, which is of independent interest, is a polynomial-time method\nfor compressing the input distance space into an equivalent instance of EEE\nwith $\\mathcal{O}((dk)^2)$ points.\n  For the special but important case of EEE where only outlier deletions are\nallowed, we improve the parameter dependence of the FPT algorithm and obtain a\nrunning time of $\\min\\{(d+3)^k, 2^{d+k}\\} \\cdot n^{\\mathcal{O}(1)}$.\nAdditionally, we provide an FPT-approximation algorithm for this problem, which\noutputs a set of at most $2 \\cdot {\\rm OPT}$ outliers in time $2^d \\cdot\nn^{\\mathcal{O}(1)}$. This 2-approximation algorithm improves upon the previous\n$(3+\\varepsilon)$-approximation algorithm by Sidiropoulos, Wang, and Wang [SODA\n'17]. Furthermore, we complement our algorithms with hardness results\nmotivating our choice of parameterizations.", "published": "2025-03-24 19:25:53", "link": "http://arxiv.org/abs/2503.19093v1", "categories": ["cs.CG", "cs.DM", "cs.DS"], "primary_category": "cs.CG"}
{"title": "Path degeneracy and applications", "abstract": "In this work, we relate girth and path-degeneracy in classes with\nsub-exponential expansion, with explicit bounds for classes with polynomial\nexpansion and proper minor-closed classes that are tight up to a constant\nfactor (and tight up to second order terms if a classical conjecture on\nexistence of $g$-cages is verified). As an application, we derive bounds on the\ngeneralized acyclic indices, on the generalized arboricities, and on the weak\ncoloring numbers of high-girth graphs in such classes. Along the way, we prove\na conjecture proposed in [T.~Bartnicki et al., Generalized arboricity of graphs\nwith large girth, Discrete Mathematics 342 (2019), no.~5, 1343--1350.], which\nasserts that, for every integer $k$, there is an integer $g(p,k)$ such that\nevery $K_k$ minor-free graph with girth at least $g(p,k)$ has $p$-arboricity at\nmost $p+1$.", "published": "2025-03-24 12:13:57", "link": "http://arxiv.org/abs/2503.18614v1", "categories": ["math.CO", "cs.DM"], "primary_category": "math.CO"}
{"title": "Identifying and Characterising Higher Order Interactions in Mobility Networks Using Hypergraphs", "abstract": "Understanding human mobility is essential for applications ranging from urban\nplanning to public health. Traditional mobility models such as flow networks\nand colocation matrices capture only pairwise interactions between discrete\nlocations, overlooking higher-order relationships among locations (i.e.,\nmobility flow among two or more locations). To address this, we propose\nco-visitation hypergraphs, a model that leverages temporal observation windows\nto extract group interactions between locations from individual mobility\ntrajectory data. Using frequent pattern mining, our approach constructs\nhypergraphs that capture dynamic mobility behaviors across different spatial\nand temporal scales. We validate our method on a publicly available mobility\ndataset and demonstrate its effectiveness in analyzing city-scale mobility\npatterns, detecting shifts during external disruptions such as extreme weather\nevents, and examining how a location's connectivity (degree) relates to the\nnumber of points of interest (POIs) within it. Our results demonstrate that our\nhypergraph-based mobility analysis framework is a valuable tool with potential\napplications in diverse fields such as public health, disaster resilience, and\nurban planning.", "published": "2025-03-24 11:29:06", "link": "http://arxiv.org/abs/2503.18572v1", "categories": ["cs.SI", "cs.AI", "cs.DB", "cs.DM", "math.CO"], "primary_category": "cs.SI"}
{"title": "Counterexample to Winkler's conjecture on Venn diagrams", "abstract": "In 1984, Peter Winkler conjectured that every simple Venn diagram with $n$\ncurves can be extended to a simple Venn diagram with $n+1$ curves. We present a\ncounterexample to his conjecture for $n=7$, which is obtained by combining\ntheoretical ideas with computer assistance from state-of-the-art SAT solvers.", "published": "2025-03-24 11:06:34", "link": "http://arxiv.org/abs/2503.18554v1", "categories": ["math.CO", "cs.DM"], "primary_category": "math.CO"}
{"title": "QubitSwap: The Informational Edge in Decentralised Exchanges", "abstract": "Decentralised exchanges (DEXs) have transformed trading by enabling\ntrustless, permissionless transactions, yet they face significant challenges\nsuch as impermanent loss and slippage, which undermine profitability for\nliquidity providers and traders. In this paper, we introduce QubitSwap, an\ninnovative DEX model designed to tackle these issues through a hybrid approach\nthat integrates an external oracle price with internal pool dynamics. This is\nachieved via a parameter $z$, which governs the balance between these price\nsources, creating a flexible and adaptive pricing mechanism. Through rigorous\nmathematical analysis, we derive a novel reserve function and pricing model\nthat substantially reduces impermanent loss and slippage compared to\ntraditional DEX frameworks. Notably, our results show that as $z$ approaches 1,\nslippage approaches zero, enhancing trading stability. QubitSwap marks a novel\napproach in DEX design, delivering a more efficient and resilient platform.\nThis work not only advances the theoretical foundations of decentralised\nfinance but also provides actionable solutions for the broader DeFi ecosystem.", "published": "2025-03-24 06:13:40", "link": "http://arxiv.org/abs/2504.06281v1", "categories": ["q-fin.TR", "q-fin.MF"], "primary_category": "q-fin.TR"}
{"title": "Rough Heston model as the scaling limit of bivariate cumulative heavy-tailed INAR($\\infty$) processes and applications", "abstract": "This paper establishes a novel link between nearly unstable cumulative\nheavy-tailed integer-valued autoregressive (INAR($\\infty$)) processes and the\nrough Heston model via discrete scaling limits. We prove that a sequence of\nbivariate cumulative INAR($\\infty$) processes converge in law to the rough\nHeston model under appropriate scaling conditions, providing a rigorous\nmathematical foundation for understanding how microstructural order flow drives\nmacroscopic prices following rough volatility dynamics. Our theoretical\nframework extends the scaling limit techniques from Hawkes processes to the\nINAR($\\infty$) setting. Hence we can carry out efficient Monte Carlo simulation\nof the rough Heston model through simulating the corresponding approximating\nINAR($\\infty$) processes, which provides an alternative discrete-time\nsimulation method to the Euler-Maruyama method. Extensive numerical experiments\nillustrate the improved accuracy and efficiency of the proposed simulation\nscheme as compared to the literature, in the valuation of European options, and\nalso path-dependent options such as arithmetic Asian options, lookback options\nand barrier options.", "published": "2025-03-24 00:58:26", "link": "http://arxiv.org/abs/2503.18259v3", "categories": ["math.PR", "q-fin.MF", "60G22, 60H35, 91G20, 62M10, 60F17"], "primary_category": "math.PR"}
{"title": "Cryptocurrency Time Series on the Binary Complexity-Entropy Plane: Ranking Efficiency from the Perspective of Complex Systems", "abstract": "We report the first application of a tailored Complexity-Entropy Plane\ndesigned for binary sequences and structures. We do so by considering the daily\nup/down price fluctuations of the largest cryptocurrencies in terms of\ncapitalization (stable-coins excluded) that are worth $circa \\,\\, 90 \\%$ of the\ntotal crypto market capitalization. With that, we focus on the basic elements\nof price motion that compare with the random walk backbone features associated\nwith mathematical properties of the Efficient Market Hypothesis. From the\nlocation of each crypto on the Binary Complexity-Plane (BiCEP) we define an\ninefficiency score, $\\mathcal I$, and rank them accordingly. The results based\non the BiCEP analysis, which we substantiate with statistical testing, indicate\nthat only Shiba Inu (SHIB) is significantly inefficient, whereas the largest\nstake of crypto trading is reckoned to operate in close-to-efficient\nconditions. Generically, our $\\mathcal I$-based ranking hints the design and\nconsensus architecture of a crypto is at least as relevant to efficiency as the\nfeatures that are usually taken into account in the appraisal of the efficiency\nof financial instruments, namely canonical fiat money. Lastly, this set of\nresults supports the validity of the binary complexity analysis.", "published": "2025-03-24 22:01:24", "link": "http://arxiv.org/abs/2504.01974v1", "categories": ["q-fin.ST", "physics.data-an", "physics.soc-ph"], "primary_category": "q-fin.ST"}
