{"title": "The Impact of Annotator Personas on LLM Behavior Across the Perspectivism Spectrum", "abstract": "In this work, we explore the capability of Large Language Models (LLMs) to\nannotate hate speech and abusiveness while considering predefined annotator\npersonas within the strong-to-weak data perspectivism spectra. We evaluated\nLLM-generated annotations against existing annotator modeling techniques for\nperspective modeling. Our findings show that LLMs selectively use demographic\nattributes from the personas. We identified prototypical annotators, with\npersona features that show varying degrees of alignment with the original human\nannotators. Within the data perspectivism paradigm, annotator modeling\ntechniques that do not explicitly rely on annotator information performed\nbetter under weak data perspectivism compared to both strong data perspectivism\nand human annotations, suggesting LLM-generated views tend towards aggregation\ndespite subjective prompting. However, for more personalized datasets tailored\nto strong perspectivism, the performance of LLM annotator modeling approached,\nbut did not exceed, human annotators.", "published": "2025-08-23 23:32:09", "link": "http://arxiv.org/abs/2508.17164v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Quantifying Language Disparities in Multilingual Large Language Models", "abstract": "Results reported in large-scale multilingual evaluations are often fragmented\nand confounded by factors such as target languages, differences in experimental\nsetups, and model choices. We propose a framework that disentangles these\nconfounding variables and introduces three interpretable metrics--the\nperformance realisation ratio, its coefficient of variation, and language\npotential--enabling a finer-grained and more insightful quantification of\nactual performance disparities across both (i) models and (ii) languages.\nThrough a case study of 13 model variants on 11 multilingual datasets, we\ndemonstrate that our framework provides a more reliable measurement of model\nperformance and language disparities, particularly for low-resource languages,\nwhich have so far proven challenging to evaluate. Importantly, our results\nreveal that higher overall model performance does not necessarily imply greater\nfairness across languages.", "published": "2025-08-23 23:25:38", "link": "http://arxiv.org/abs/2508.17162v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "SPORTSQL: An Interactive System for Real-Time Sports Reasoning and Visualization", "abstract": "We present a modular, interactive system, SPORTSQL, for natural language\nquerying and visualization of dynamic sports data, with a focus on the English\nPremier League (EPL). The system translates user questions into executable SQL\nover a live, temporally indexed database constructed from real-time Fantasy\nPremier League (FPL) data. It supports both tabular and visual outputs,\nleveraging the symbolic reasoning capabilities of Large Language Models (LLMs)\nfor query parsing, schema linking, and visualization selection. To evaluate\nsystem performance, we introduce the Dynamic Sport Question Answering benchmark\n(DSQABENCH), comprising 1,700+ queries annotated with SQL programs, gold\nanswers, and database snapshots. Our demo highlights how non-expert users can\nseamlessly explore evolving sports statistics through a natural, conversational\ninterface.", "published": "2025-08-23 22:51:30", "link": "http://arxiv.org/abs/2508.17157v1", "categories": ["cs.CL"], "primary_category": "cs.CL"}
{"title": "Natural Language Satisfiability: Exploring the Problem Distribution and Evaluating Transformer-based Language Models", "abstract": "Efforts to apply transformer-based language models (TLMs) to the problem of\nreasoning in natural language have enjoyed ever-increasing success in recent\nyears. The most fundamental task in this area to which nearly all others can be\nreduced is that of determining satisfiability. However, from a logical point of\nview, satisfiability problems vary along various dimensions, which may affect\nTLMs' ability to learn how to solve them. The problem instances of\nsatisfiability in natural language can belong to different computational\ncomplexity classes depending on the language fragment in which they are\nexpressed. Although prior research has explored the problem of natural language\nsatisfiability, the above-mentioned point has not been discussed adequately.\nHence, we investigate how problem instances from varying computational\ncomplexity classes and having different grammatical constructs impact TLMs'\nability to learn rules of inference. Furthermore, to faithfully evaluate TLMs,\nwe conduct an empirical study to explore the distribution of satisfiability\nproblems.", "published": "2025-08-23 22:19:16", "link": "http://arxiv.org/abs/2508.17153v1", "categories": ["cs.CL", "cs.AI"], "primary_category": "cs.CL"}
{"title": "Geolocation-Aware Robust Spoken Language Identification", "abstract": "While Self-supervised Learning (SSL) has significantly improved Spoken\nLanguage Identification (LID), existing models often struggle to consistently\nclassify dialects and accents of the same language as a unified class. To\naddress this challenge, we propose geolocation-aware LID, a novel approach that\nincorporates language-level geolocation information into the SSL-based LID\nmodel. Specifically, we introduce geolocation prediction as an auxiliary task\nand inject the predicted vectors into intermediate representations as\nconditioning signals. This explicit conditioning encourages the model to learn\nmore unified representations for dialectal and accented variations. Experiments\nacross six multilingual datasets demonstrate that our approach improves\nrobustness to intra-language variations and unseen domains, achieving new\nstate-of-the-art accuracy on FLEURS (97.7%) and 9.7% relative improvement on\nML-SUPERB 2.0 dialect set.", "published": "2025-08-23 21:49:27", "link": "http://arxiv.org/abs/2508.17148v1", "categories": ["cs.CL", "cs.SD"], "primary_category": "cs.CL"}
{"title": "The Power of Framing: How News Headlines Guide Search Behavior", "abstract": "Search engines play a central role in how people gather information, but\nsubtle cues like headline framing may influence not only what users believe but\nalso how they search. While framing effects on judgment are well documented,\ntheir impact on subsequent search behavior is less understood. We conducted a\ncontrolled experiment where participants issued queries and selected from\nheadlines filtered by specific linguistic frames. Headline framing\nsignificantly shaped follow-up queries: conflict and strategy frames disrupted\nalignment with prior selections, while episodic frames led to more concrete\nqueries than thematic ones. We also observed modest short-term frame\npersistence that declined over time. These results suggest that even brief\nexposure to framing can meaningfully alter the direction of users\ninformation-seeking behavior.", "published": "2025-08-23 20:12:19", "link": "http://arxiv.org/abs/2508.17131v1", "categories": ["cs.CL", "cs.HC", "cs.IR"], "primary_category": "cs.CL"}
{"title": "A Straightforward Pipeline for Targeted Entailment and Contradiction Detection", "abstract": "Finding the relationships between sentences in a document is crucial for\ntasks like fact-checking, argument mining, and text summarization. A key\nchallenge is to identify which sentences act as premises or contradictions for\na specific claim. Existing methods often face a trade-off: transformer\nattention mechanisms can identify salient textual connections but lack explicit\nsemantic labels, while Natural Language Inference (NLI) models can classify\nrelationships between sentence pairs but operate independently of contextual\nsaliency. In this work, we introduce a method that combines the strengths of\nboth approaches for a targeted analysis. Our pipeline first identifies\ncandidate sentences that are contextually relevant to a user-selected target\nsentence by aggregating token-level attention scores. It then uses a pretrained\nNLI model to classify each candidate as a premise (entailment) or\ncontradiction. By filtering NLI-identified relationships with attention-based\nsaliency scores, our method efficiently isolates the most significant semantic\nrelationships for any given claim in a text.", "published": "2025-08-23 19:59:24", "link": "http://arxiv.org/abs/2508.17127v1", "categories": ["cs.CL", "cs.LO"], "primary_category": "cs.CL"}
{"title": "Token Homogenization under Positional Bias", "abstract": "This paper investigates token homogenization - the convergence of token\nrepresentations toward uniformity across transformer layers and its\nrelationship to positional bias in large language models. We empirically\nexamine whether homogenization occurs and how positional bias amplifies this\neffect. Through layer-wise similarity analysis and controlled experiments, we\ndemonstrate that tokens systematically lose distinctiveness during processing,\nparticularly when biased toward extremal positions. Our findings confirm both\nthe existence of homogenization and its dependence on positional attention\nmechanisms.", "published": "2025-08-23 19:59:05", "link": "http://arxiv.org/abs/2508.17126v1", "categories": ["cs.CL", "cs.AI", "cs.LG"], "primary_category": "cs.CL"}
{"title": "Linguistic Neuron Overlap Patterns to Facilitate Cross-lingual Transfer on Low-resource Languages", "abstract": "The current Large Language Models (LLMs) face significant challenges in\nimproving performance on low-resource languages and urgently need\ndata-efficient methods without costly fine-tuning. From the perspective of\nlanguage-bridge, we propose BridgeX-ICL, a simple yet effective method to\nimprove zero-shot Cross-lingual In-Context Learning (X-ICL) for low-resource\nlanguages. Unlike existing works focusing on language-specific neurons,\nBridgeX-ICL explores whether sharing neurons can improve cross-lingual\nperformance in LLMs or not. We construct neuron probe data from the\nground-truth MUSE bilingual dictionaries, and define a subset of language\noverlap neurons accordingly, to ensure full activation of these anchored\nneurons. Subsequently, we propose an HSIC-based metric to quantify LLMs'\ninternal linguistic spectrum based on overlap neurons, which guides optimal\nbridge selection. The experiments conducted on 2 cross-lingual tasks and 15\nlanguage pairs from 7 diverse families (covering both high-low and moderate-low\npairs) validate the effectiveness of BridgeX-ICL and offer empirical insights\ninto the underlying multilingual mechanisms of LLMs.", "published": "2025-08-23 16:13:57", "link": "http://arxiv.org/abs/2508.17078v1", "categories": ["cs.CL", "cs.AI"], "primary_category": "cs.CL"}
{"title": "Anemoi: A Semi-Centralized Multi-agent Systems Based on Agent-to-Agent Communication MCP server from Coral Protocol", "abstract": "Recent advances in generalist multi-agent systems (MAS) have largely followed\na context-engineering plus centralized paradigm, where a planner agent\ncoordinates multiple worker agents through unidirectional prompt passing. While\neffective under strong planner models, this design suffers from two critical\nlimitations: (1) strong dependency on the planner's capability, which leads to\ndegraded performance when a smaller LLM powers the planner; and (2) limited\ninter-agent communication, where collaboration relies on costly prompt\nconcatenation and context injection, introducing redundancy and information\nloss. To address these challenges, we propose Anemoi, a semi-centralized MAS\nbuilt on the Agent-to-Agent (A2A) communication MCP server from Coral Protocol.\nUnlike traditional designs, Anemoi enables structured and direct inter-agent\ncollaboration, allowing all agents to monitor progress, assess results,\nidentify bottlenecks, and propose refinements in real time. This paradigm\nreduces reliance on a single planner, supports adaptive plan updates, and\nminimizes redundant context passing, resulting in more scalable and\ncost-efficient execution. Evaluated on the GAIA benchmark, Anemoi achieved\n52.73\\% accuracy with a small LLM (GPT-4.1-mini) as the planner, surpassing the\nstrongest open-source baseline OWL (43.63\\%) by +9.09\\% under identical LLM\nsettings. Our implementation is publicly available at\nhttps://github.com/Coral-Protocol/Anemoi.", "published": "2025-08-23 15:45:10", "link": "http://arxiv.org/abs/2508.17068v1", "categories": ["cs.MA", "cs.CL"], "primary_category": "cs.MA"}
{"title": "VQL: An End-to-End Context-Aware Vector Quantization Attention for Ultra-Long User Behavior Modeling", "abstract": "In large-scale recommender systems, ultra-long user behavior sequences encode\nrich signals of evolving interests. Extending sequence length generally\nimproves accuracy, but directly modeling such sequences in production is\ninfeasible due to latency and memory constraints. Existing solutions fall into\ntwo categories: (1) top-k retrieval, which truncates the sequence and may\ndiscard most attention mass when L >> k; and (2) encoder-based compression,\nwhich preserves coverage but often over-compresses and fails to incorporate key\ncontext such as temporal gaps or target-aware signals. Neither class achieves a\ngood balance of low-loss compression, context awareness, and efficiency.\n  We propose VQL, a context-aware Vector Quantization Attention framework for\nultra-long behavior modeling, with three innovations. (1) Key-only\nquantization: only attention keys are quantized, while values remain intact; we\nprove that softmax normalization yields an error bound independent of sequence\nlength, and a codebook loss directly supervises quantization quality. This also\nenables L-free inference via offline caches. (2) Multi-scale quantization:\nattention heads are partitioned into groups, each with its own small codebook,\nwhich reduces quantization error while keeping cache size fixed. (3) Efficient\ncontext injection: static features (e.g., item category, modality) are directly\nintegrated, and relative position is modeled via a separable temporal kernel.\nAll context is injected without enlarging the codebook, so cached\nrepresentations remain query-independent.\n  Experiments on three large-scale datasets (KuaiRand-1K, KuaiRec, TMALL) show\nthat VQL consistently outperforms strong baselines, achieving higher accuracy\nwhile reducing inference latency, establishing a new state of the art in\nbalancing accuracy and efficiency for ultra-long sequence recommendation.", "published": "2025-08-23 19:58:18", "link": "http://arxiv.org/abs/2508.17125v1", "categories": ["cs.IR"], "primary_category": "cs.IR"}
{"title": "Zero-shot Multimodal Document Retrieval via Cross-modal Question Generation", "abstract": "Rapid advances in Multimodal Large Language Models (MLLMs) have expanded\ninformation retrieval beyond purely textual inputs, enabling retrieval from\ncomplex real world documents that combine text and visuals. However, most\ndocuments are private either owned by individuals or confined within corporate\nsilos and current retrievers struggle when faced with unseen domains or\nlanguages. To address this gap, we introduce PREMIR, a simple yet effective\nframework that leverages the broad knowledge of an MLLM to generate cross modal\npre questions (preQs) before retrieval. Unlike earlier multimodal retrievers\nthat compare embeddings in a single vector space, PREMIR leverages preQs from\nmultiple complementary modalities to expand the scope of matching to the token\nlevel. Experiments show that PREMIR achieves state of the art performance on\nout of distribution benchmarks, including closed domain and multilingual\nsettings, outperforming strong baselines across all retrieval metrics. We\nconfirm the contribution of each component through in depth ablation studies,\nand qualitative analyses of the generated preQs further highlight the model's\nrobustness in real world settings.", "published": "2025-08-23 16:14:41", "link": "http://arxiv.org/abs/2508.17079v1", "categories": ["cs.IR", "cs.AI"], "primary_category": "cs.IR"}
{"title": "Towards a Real-World Aligned Benchmark for Unlearning in Recommender Systems", "abstract": "Modern recommender systems heavily leverage user interaction data to deliver\npersonalized experiences. However, relying on personal data presents challenges\nin adhering to privacy regulations, such as the GDPR's \"right to be forgotten\".\nMachine unlearning (MU) aims to address these challenges by enabling the\nefficient removal of specific training data from models post-training, without\ncompromising model utility or leaving residual information. However, current\nbenchmarks for unlearning in recommender systems -- most notably CURE4Rec --\nfail to reflect real-world operational demands. They focus narrowly on\ncollaborative filtering, overlook tasks like session-based and next-basket\nrecommendation, simulate unrealistically large unlearning requests, and ignore\ncritical efficiency constraints. In this paper, we propose a set of design\ndesiderata and research questions to guide the development of a more realistic\nbenchmark for unlearning in recommender systems, with the goal of gathering\nfeedback from the research community. Our benchmark proposal spans multiple\nrecommendation tasks, includes domain-specific unlearning scenarios, and\nseveral unlearning algorithms -- including ones adapted from a recent NeurIPS\nunlearning competition. Furthermore, we argue for an unlearning setup that\nreflects the sequential, time-sensitive nature of real-world deletion requests.\nWe also present a preliminary experiment in a next-basket recommendation\nsetting based on our proposed desiderata and find that unlearning also works\nfor sequential recommendation models, exposed to many small unlearning\nrequests. In this case, we observe that a modification of a custom-designed\nunlearning algorithm for recommender systems outperforms general unlearning\nalgorithms significantly, and that unlearning can be executed with a latency of\nonly several seconds.", "published": "2025-08-23 16:05:40", "link": "http://arxiv.org/abs/2508.17076v1", "categories": ["cs.IR"], "primary_category": "cs.IR"}
{"title": "DeAR: Dual-Stage Document Reranking with Reasoning Agents via LLM Distillation", "abstract": "Large Language Models (LLMs) have transformed listwise document reranking by\nenabling global reasoning over candidate sets, yet single models often struggle\nto balance fine-grained relevance scoring with holistic cross-document\nanalysis. We propose \\textbf{De}ep\\textbf{A}gent\\textbf{R}ank (\\textbf{\\DeAR}),\nan open-source framework that decouples these tasks through a dual-stage\napproach, achieving superior accuracy and interpretability. In \\emph{Stage 1},\nwe distill token-level relevance signals from a frozen 13B LLaMA teacher into a\ncompact \\{3, 8\\}B student model using a hybrid of cross-entropy, RankNet, and\nKL divergence losses, ensuring robust pointwise scoring. In \\emph{Stage 2}, we\nattach a second LoRA adapter and fine-tune on 20K GPT-4o-generated\nchain-of-thought permutations, enabling listwise reasoning with\nnatural-language justifications. Evaluated on TREC-DL19/20, eight BEIR\ndatasets, and NovelEval-2306, \\DeAR surpasses open-source baselines by +5.1\nnDCG@5 on DL20 and achieves 90.97 nDCG@10 on NovelEval, outperforming GPT-4 by\n+3.09. Without fine-tuning on Wikipedia, DeAR also excels in open-domain QA,\nachieving 54.29 Top-1 accuracy on Natural Questions, surpassing baselines like\nMonoT5, UPR, and RankGPT. Ablations confirm that dual-loss distillation ensures\nstable calibration, making \\DeAR a highly effective and interpretable solution\nfor modern reranking systems.\\footnote{Dataset and code available at\nhttps://github.com/DataScienceUIBK/DeAR-Reranking.}.", "published": "2025-08-23 11:46:08", "link": "http://arxiv.org/abs/2508.16998v1", "categories": ["cs.CL", "cs.IR"], "primary_category": "cs.CL"}
{"title": "THEME : Enhancing Thematic Investing with Semantic Stock Representations and Temporal Dynamics", "abstract": "Thematic investing aims to construct portfolios aligned with structural\ntrends, yet selecting relevant stocks remains challenging due to overlapping\nsector boundaries and evolving market dynamics. To address this challenge, we\nconstruct the Thematic Representation Set (TRS), an extended dataset that\nbegins with real-world thematic ETFs and expands upon them by incorporating\nindustry classifications and financial news to overcome their coverage\nlimitations. The final dataset contains both the explicit mapping of themes to\ntheir constituent stocks and the rich textual profiles for each. Building on\nthis dataset, we introduce \\textsc{THEME}, a hierarchical contrastive learning\nframework. By representing the textual profiles of themes and stocks as\nembeddings, \\textsc{THEME} first leverages their hierarchical relationship to\nachieve semantic alignment. Subsequently, it refines these semantic embeddings\nthrough a temporal refinement stage that incorporates individual stock returns.\nThe final stock representations are designed for effective retrieval of\nthematically aligned assets with strong return potential. Empirical results\nshow that \\textsc{THEME} outperforms strong baselines across multiple retrieval\nmetrics and significantly improves performance in portfolio construction. By\njointly modeling thematic relationships from text and market dynamics from\nreturns, \\textsc{THEME} provides a scalable and adaptive solution for\nnavigating complex investment themes.", "published": "2025-08-23 08:05:37", "link": "http://arxiv.org/abs/2508.16936v1", "categories": ["q-fin.PM", "cs.AI", "cs.CL", "cs.IR"], "primary_category": "q-fin.PM"}
{"title": "Rao Differential Privacy", "abstract": "Differential privacy (DP) has recently emerged as a definition of privacy to\nrelease private estimates. DP calibrates noise to be on the order of an\nindividuals contribution. Due to the this calibration a private estimate\nobscures any individual while preserving the utility of the estimate. Since the\noriginal definition, many alternate definitions have been proposed. These\nalternates have been proposed for various reasons including improvements on\ncomposition results, relaxations, and formalizations. Nevertheless, thus far\nnearly all definitions of privacy have used a divergence of densities as the\nbasis of the definition. In this paper we take an information geometry\nperspective towards differential privacy. Specifically, rather than define\nprivacy via a divergence, we define privacy via the Rao distance. We show that\nour proposed definition of privacy shares the interpretation of previous\ndefinitions of privacy while improving on sequential composition.", "published": "2025-08-23 20:25:59", "link": "http://arxiv.org/abs/2508.17135v1", "categories": ["stat.ML", "cs.CR", "cs.IT", "cs.LG", "math.IT"], "primary_category": "stat.ML"}
{"title": "Two-Level Priority Coding for Resilience to Arbitrary Blockage Patterns", "abstract": "Ultra-reliable low-latency communication is essential in mission-critical\nsettings, including military applications, where persistent and asymmetric link\nblockages caused by mobility, jamming, or adversarial attacks can disrupt\ndelay-sensitive transmissions. This paper addresses this challenge by deploying\na multilevel diversity coding (MDC) scheme that controls the received\ninformation, offers distinct reliability guarantees based on the priority of\ndata streams, and maintains low design and operational complexity as the number\nof network paths increases. For two priority levels over three edge-disjoint\npaths, the complete capacity region is characterized, showing that\nsuperposition coding achieves the region in general, whereas network coding is\nrequired only in a specific corner case. Moreover, sufficient conditions under\nwhich a simple superposition coding scheme achieves the capacity for an\narbitrary number of paths are identified. To prove these results and provide a\nunified analytical framework, the problem of designing high-performing MDC\nschemes is shown to be equivalent to the problem of designing high-performing\nencoding schemes over a class of broadcast networks, referred to as combination\nnetworks in the literature.", "published": "2025-08-23 05:11:56", "link": "http://arxiv.org/abs/2508.16899v1", "categories": ["cs.IT", "math.IT"], "primary_category": "cs.IT"}
{"title": "Error analysis for the deep Kolmogorov method", "abstract": "The deep Kolmogorov method is a simple and popular deep learning based method\nfor approximating solutions of partial differential equations (PDEs) of the\nKolmogorov type. In this work we provide an error analysis for the deep\nKolmogorov method for heat PDEs. Specifically, we reveal convergence with\nconvergence rates for the overall mean square distance between the exact\nsolution of the heat PDE and the realization function of the approximating deep\nneural network (DNN) associated with a stochastic optimization algorithm in\nterms of the size of the architecture (the depth/number of hidden layers and\nthe width of the hidden layers) of the approximating DNN, in terms of the\nnumber of random sample points used in the loss function (the number of\ninput-output data pairs used in the loss function), and in terms of the size of\nthe optimization error made by the employed stochastic optimization method.", "published": "2025-08-23 23:49:01", "link": "http://arxiv.org/abs/2508.17167v1", "categories": ["math.NA", "cs.AI", "cs.NA", "math.AP", "68T07, 60H30", "G.1.8; I.2.6"], "primary_category": "math.NA"}
{"title": "Some new properties of the PamPa scheme", "abstract": "In this paper, we provide a few new properties of Active Flux\n(AF)/Point-Average-Moment PolynomiAl-interpreted (PAMPA) schemes. First, we\nshow, in full generality, that the Active Flux (AF)/Point-Average-Moment\nPolynomiAl-interpreted (PAMPA) schemes can be interpreted in such a way that\nthe discontinuous Galerkin (dG) scheme is one of their building blocks.\nSecondly we provide some intrinsic bound preserving properties. This is also\nillustrated numericaly. Last, we show, at least in one dimension, that the\nPAMPA scheme has the Summation by part property.", "published": "2025-08-23 21:36:05", "link": "http://arxiv.org/abs/2508.17147v1", "categories": ["math.NA", "cs.NA", "76M10, 76M12, 65M08, 35L40"], "primary_category": "math.NA"}
{"title": "Characterizations of structured Bohemian matrices and their Inner and Outer Bohemian Inverses", "abstract": "In this paper, we systematically define and characterize various classes of\nBohemian matrices with respect to the population $\\mathbb{P}=\\{0, \\pm 1\\}$,\nfocusing on their inner and outer Bohemian inverses. The classes under\nconsideration include rank-one Bohemian matrices, as well as higher-rank\nBohemian matrix classes, specifically Classes I, II, and III. For rank-one\nBohemian matrices, a complete description of the outer Bohemian inverse sets is\nprovided along with their cardinalities. Additionally, new insights into inner\nBohemian inverses and their cardinalities are given. Characterizations of the\ncomplete set of inner inverses for the Class III matrices and full-row rank\nClass II matrices are obtained. Furthermore, we study the sets of rank-one\nouter inverses for Classes I and II, and examine the sets of rank $r$ outer\ninverses for full-row rank Class II matrices of rank $r$. Moreover, the set of\nouter inverses is completely characterized for rank-two full-row rank Class III\nmatrices. In particular, we provide an explicit formula for the cardinality of\nthe set of outer Bohemian inverses for rank-two full-row rank Class I matrices.", "published": "2025-08-23 17:55:56", "link": "http://arxiv.org/abs/2508.17098v1", "categories": ["math.NA", "cs.NA", "15A09, 15B36"], "primary_category": "math.NA"}
{"title": "An implicit-explicit BDF-Galerkin scheme of second order for the nonlinear thermistor problem", "abstract": "This paper proposes and analyzes an implicit-explicit BDF-Galerkin scheme of\nsecond order for the time-dependent nonlinear thermistor problem. For this, we\ncombine the second-order backward differentiation formula with special\nextrapolation terms for time discretization with standard finite elements for\nspatial discretization. Unconditionally superclose and superconvergent error\nestimates are established, relying on two key techniques. First, a\ntime-discrete system is introduced to decompose the error function into its\ntemporal and spatial components. Second, superclose error estimates between the\nnumerical solution and the interpolation of the time-discrete solution are\nemployed to effectively handle the nonlinear coupling term. Finally, we present\nnumerical examples that validate the theoretical findings, demonstrating the\nunconditional stability and the second-order accuracy of the proposed method.", "published": "2025-08-23 12:22:40", "link": "http://arxiv.org/abs/2508.17004v1", "categories": ["math.NA", "cs.NA"], "primary_category": "math.NA"}
{"title": "Physics-Informed Kolmogorov-Arnold Networks for multi-material elasticity problems in electronic packaging", "abstract": "This paper proposes a Physics-Informed Kolmogorov-Arnold Network (PIKAN)\nmethod for analyzing elasticity problems in electronic packaging multi-material\nstructures. The core innovation lies in replacing Multi-Layer Perceptrons\n(MLPs) with Kolmogorov-Arnold Networks (KANs) within the energy-based\nPhysics-Informed Neural Networks (PINNs) framework. The method constructs\nadmissible displacement fields that automatically satisfy essential boundary\nconditions and employs various numerical integration schemes to compute loss\nfunctions for network optimization. Unlike traditional PINNs that require\ndomain decomposition and penalty terms for multi-material problems, KANs'\ntrainable B-spline activation functions provide inherent piecewise function\ncharacteristics that naturally accommodate material property discontinuities.\nConsequently, this approach requires only a single KAN to achieve accurate\napproximation across the entire computational domain without subdomain\npartitioning and interface continuity constraints. Numerical validation\ndemonstrates PIKAN's accuracy and robustness for multi-material elasticity\nproblems. The method maintains high accuracy while significantly reducing\ncomputational complexity compared to domain decomposition approaches. Results\nconfirm PIKAN's unique advantages in solving multi-material problems and its\nsignificant potential for electronic packaging structure analysis. Source codes\nare available at https://github.com/yanpeng-gong/PIKAN-MultiMaterial.", "published": "2025-08-23 11:50:35", "link": "http://arxiv.org/abs/2508.16999v1", "categories": ["math.NA", "cs.NA"], "primary_category": "math.NA"}
{"title": "Iterative Methods for Computing the Moore-Penrose Pseudoinverse of Quaternion Matrices, with Applications", "abstract": "We develop iterative methods to compute the Moore-Penrose pseudoinverse of\nquaternion matrices directly in $\\mathbb{H}$. We introduce a damped\nNewton-Schulz (NS) iteration, proving its convergence under spectral scaling\n$X_0=\\alpha A^H$ with $\\alpha\\in(0,2/\\|A\\|_2^2)$. We derive higher-order\nhyperpower NS schemes with optimized factorizations. Beyond NS, we propose a\nrandomized sketch-and-project method (RSP-Q) and a conjugate gradient on normal\nequations (CGNE-Q). Numerically, spectrally-scaled NS achieves superior\naccuracy and runtime. In applications (image completion, filtering,\ndeblurring), the NS family delivers state-of-the-art performance with the\nlowest wall time, providing efficient solvers for large-scale quaternion\ninverse problems.", "published": "2025-08-23 10:05:44", "link": "http://arxiv.org/abs/2508.16979v1", "categories": ["math.NA", "cs.NA"], "primary_category": "math.NA"}
{"title": "Spatially Correlated Blockage Aware Placement of RIS in IIoT Networks", "abstract": "We study the impact of deploying reconfigurable intelligent surfaces (RISs)\nin mitigating coverage gaps and enhancing transmission reliability in an\nindustrial internet of things (IIoT) network. First, we consider a single\nblockage scenario and characterize the correlation between blocking events of\nthe base station (BS)-user and the RIS-user links and study its impact on the\nprobability of establishing a viable reflected link. Then, by considering\nmultiple blockages, we derive the distribution of the signal to noise ratio\n(SNR) as a function of data size, blockage density, the number of RISs, and the\ndeployment area. We analyze the impact of normalized blockage radius and\nidentify the threshold beyond which the assumption of independent blockages\ndeviates from the ground truth of correlated blocking. Finally, we compare the\noutage performance of this RIS-assisted system with that operated with network-\ncontrolled relays, and demonstrate that while the relays provide a higher\nreliability beyond a certain blockage threshold, increasing the number of RISs\nmay help mitigate this effect. These insights offer valuable design guidelines\nfor deploying RIS-aided IIoT networks in dense blockage environments.", "published": "2025-08-23 08:31:23", "link": "http://arxiv.org/abs/2508.16946v1", "categories": ["eess.SP", "cs.NA", "math.NA", "60D05, 60G55, 68M10", "C.2.1; C.2.3; G.3"], "primary_category": "eess.SP"}
{"title": "Enhanced shape recovery in advection--diffusion problems via a novel ADMM-based CCBM optimization", "abstract": "This work proposes a novel shape optimization framework for geometric inverse\nproblems governed by the advection-diffusion equation, based on the coupled\ncomplex boundary method (CCBM). Building on recent developments [2, 45, 46, 47,\n51], we aim to recover the shape of an unknown inclusion via shape optimization\ndriven by a cost functional constructed from the imaginary part of the\ncomplex-valued state variable over the entire domain. We rigorously derive the\nassociated shape derivative in variational form and provide explicit\nexpressions for the gradient and second-order information. Optimization is\ncarried out using a Sobolev gradient method within a finite element framework.\nTo address difficulties in reconstructing obstacles with concave boundaries,\nparticularly under measurement noise and the combined effects of advection and\ndiffusion, we introduce a numerical scheme inspired by the Alternating\nDirection Method of Multipliers (ADMM). In addition to implementing this\nnon-conventional approach, we demonstrate how the adjoint method can be\nefficiently applied and utilize partial gradients to develop a more efficient\nCCBM-ADMM scheme. The accuracy and robustness of the proposed computational\napproach are validated through various numerical experiments.", "published": "2025-08-23 05:02:23", "link": "http://arxiv.org/abs/2508.16898v1", "categories": ["math.NA", "cs.NA", "math.OC", "49Q10, 35R25, 35R30, 49Q12"], "primary_category": "math.NA"}
{"title": "A Decoupled LOB Representation Framework for Multilevel Manipulation Detection with Supervised Contrastive Learning", "abstract": "Financial markets are critical to global economic stability, yet trade-based\nmanipulation (TBM) often undermines their fairness. Spoofing, a particularly\ndeceptive TBM strategy, exhibits multilevel anomaly patterns that have not been\nadequately modeled. These patterns are usually concealed within the rich,\nhierarchical information of the Limit Order Book (LOB), which is challenging to\nleverage due to high dimensionality and noise. To address this, we propose a\nrepresentation learning framework combining a cascaded LOB representation\npipeline with supervised contrastive learning. Extensive experiments\ndemonstrate that our framework consistently improves detection performance\nacross diverse models, with Transformer-based architectures achieving\nstate-of-the-art results. In addition, we conduct systematic analyses and\nablation studies to investigate multilevel anomalies and the contributions of\nkey components, offering broader insights into representation learning and\nanomaly detection for complex sequential data. Our code will be released later\nat this URL.", "published": "2025-08-23 16:57:32", "link": "http://arxiv.org/abs/2508.17086v1", "categories": ["q-fin.CP", "cs.CE", "cs.LG", "q-fin.TR"], "primary_category": "q-fin.CP"}
{"title": "Risk-Neutral Pricing of Random-Expiry Options Using Trinomial Trees", "abstract": "Random-expiry options are nontraditional derivative contracts that may expire\nearly based on a random event. We develop a methodology for pricing these\noptions using a trinomial tree, where the middle path is interpreted as early\nexpiry. We establish that this approach is free of arbitrage, derive its\ncontinuous-time limit, and show how it may be implemented numerically in an\nefficient manner.", "published": "2025-08-23 12:59:38", "link": "http://arxiv.org/abs/2508.17014v1", "categories": ["q-fin.PR", "q-fin.CP", "91G20, 91G60, 60J65, 60F05"], "primary_category": "q-fin.PR"}
{"title": "On the sample complexity of semi-supervised multi-objective learning", "abstract": "In multi-objective learning (MOL), several possibly competing prediction\ntasks must be solved jointly by a single model. Achieving good trade-offs may\nrequire a model class $\\mathcal{G}$ with larger capacity than what is necessary\nfor solving the individual tasks. This, in turn, increases the statistical\ncost, as reflected in known MOL bounds that depend on the complexity of\n$\\mathcal{G}$. We show that this cost is unavoidable for some losses, even in\nan idealized semi-supervised setting, where the learner has access to the\nBayes-optimal solutions for the individual tasks as well as the marginal\ndistributions over the covariates. On the other hand, for objectives defined\nwith Bregman losses, we prove that the complexity of $\\mathcal{G}$ may come\ninto play only in terms of unlabeled data. Concretely, we establish sample\ncomplexity upper bounds, showing precisely when and how unlabeled data can\nsignificantly alleviate the need for labeled data. These rates are achieved by\na simple, semi-supervised algorithm via pseudo-labeling.", "published": "2025-08-23 22:15:36", "link": "http://arxiv.org/abs/2508.17152v1", "categories": ["stat.ML", "cs.LG"], "primary_category": "stat.ML"}
{"title": "Frequency Response Identification of Low-Order Systems: Finite-Sample Analysis", "abstract": "This paper proposes a frequency-domain system identification method for\nlearning low-order systems. The identification problem is formulated as the\nminimization of the l2 norm between the identified and measured frequency\nresponses, with the nuclear norm of the Loewner matrix serving as a\nregularization term. This formulation results in an optimization problem that\ncan be efficiently solved using standard convex optimization techniques. We\nderive an upper bound on the sampled-frequency complexity of the identification\nprocess and subsequently extend this bound to characterize the identification\nerror over all frequencies. A detailed analysis of the sample complexity is\nprovided, along with a thorough interpretation of its terms and dependencies.\nFinally, the efficacy of the proposed method is demonstrated through an\nexample, along with numerical simulations validating the growth rate of the\nsample complexity bound.", "published": "2025-08-23 20:53:26", "link": "http://arxiv.org/abs/2508.17142v1", "categories": ["eess.SY", "cs.LG", "cs.SY", "stat.ML"], "primary_category": "eess.SY"}
{"title": "Factor Informed Double Deep Learning For Average Treatment Effect Estimation", "abstract": "We investigate the problem of estimating the average treatment effect (ATE)\nunder a very general setup where the covariates can be high-dimensional, highly\ncorrelated, and can have sparse nonlinear effects on the propensity and outcome\nmodels. We present the use of a Double Deep Learning strategy for estimation,\nwhich involves combining recently developed factor-augmented deep\nlearning-based estimators, FAST-NN, for both the response functions and\npropensity scores to achieve our goal. By using FAST-NN, our method can select\nvariables that contribute to propensity and outcome models in a completely\nnonparametric and algorithmic manner and adaptively learn low-dimensional\nfunction structures through neural networks. Our proposed novel estimator,\nFIDDLE (Factor Informed Double Deep Learning Estimator), estimates ATE based on\nthe framework of augmented inverse propensity weighting AIPW with the\nFAST-NN-based response and propensity estimates. FIDDLE consistently estimates\nATE even under model misspecification and is flexible to also allow for\nlow-dimensional covariates. Our method achieves semiparametric efficiency under\na very flexible family of propensity and outcome models. We present extensive\nnumerical studies on synthetic and real datasets to support our theoretical\nguarantees and establish the advantages of our methods over other traditional\nchoices, especially when the data dimension is large.", "published": "2025-08-23 20:26:33", "link": "http://arxiv.org/abs/2508.17136v1", "categories": ["stat.ML", "cs.LG", "math.ST", "stat.ME", "stat.TH", "62G08, 62G20"], "primary_category": "stat.ML"}
{"title": "Neural Stochastic Differential Equations on Compact State-Spaces", "abstract": "Many modern probabilistic models rely on SDEs, but their adoption is hampered\nby instability, poor inductive bias outside bounded domains, and reliance on\nrestrictive dynamics or training tricks. While recent work constrains SDEs to\ncompact spaces using reflected dynamics, these approaches lack continuous\ndynamics and efficient high-order solvers, limiting interpretability and\napplicability. We propose a novel class of neural SDEs on compact polyhedral\nspaces with continuous dynamics, amenable to higher-order solvers, and with\nfavorable inductive bias.", "published": "2025-08-23 17:05:42", "link": "http://arxiv.org/abs/2508.17090v1", "categories": ["stat.ML", "cs.LG"], "primary_category": "stat.ML"}
{"title": "CP4SBI: Local Conformal Calibration of Credible Sets in Simulation-Based Inference", "abstract": "Current experimental scientists have been increasingly relying on\nsimulation-based inference (SBI) to invert complex non-linear models with\nintractable likelihoods. However, posterior approximations obtained with SBI\nare often miscalibrated, causing credible regions to undercover true\nparameters. We develop $\\texttt{CP4SBI}$, a model-agnostic conformal\ncalibration framework that constructs credible sets with local Bayesian\ncoverage. Our two proposed variants, namely local calibration via regression\ntrees and CDF-based calibration, enable finite-sample local coverage guarantees\nfor any scoring function, including HPD, symmetric, and quantile-based regions.\nExperiments on widely used SBI benchmarks demonstrate that our approach\nimproves the quality of uncertainty quantification for neural posterior\nestimators using both normalizing flows and score-diffusion modeling.", "published": "2025-08-23 16:13:10", "link": "http://arxiv.org/abs/2508.17077v1", "categories": ["stat.ML", "cs.LG"], "primary_category": "stat.ML"}
{"title": "Limitations of refinement methods for weak to strong generalization", "abstract": "Standard techniques for aligning large language models (LLMs) utilize\nhuman-produced data, which could limit the capability of any aligned LLM to\nhuman level. Label refinement and weak training have emerged as promising\nstrategies to address this superalignment problem. In this work, we adopt\nprobabilistic assumptions commonly used to study label refinement and analyze\nwhether refinement can be outperformed by alternative approaches, including\ncomputationally intractable oracle methods. We show that both weak training and\nlabel refinement suffer from irreducible error, leaving a performance gap\nbetween label refinement and the oracle. These results motivate future research\ninto developing alternative methods for weak to strong generalization that\nsynthesize the practicality of label refinement or weak training and the\noptimality of the oracle procedure.", "published": "2025-08-23 13:17:26", "link": "http://arxiv.org/abs/2508.17018v1", "categories": ["stat.ML", "cs.LG"], "primary_category": "stat.ML"}
{"title": "GraphPPD: Posterior Predictive Modelling for Graph-Level Inference", "abstract": "Accurate modelling and quantification of predictive uncertainty is crucial in\ndeep learning since it allows a model to make safer decisions when the data is\nambiguous and facilitates the users' understanding of the model's confidence in\nits predictions. Along with the tremendously increasing research focus on\n\\emph{graph neural networks} (GNNs) in recent years, there have been numerous\ntechniques which strive to capture the uncertainty in their predictions.\nHowever, most of these approaches are specifically designed for node or\nlink-level tasks and cannot be directly applied to graph-level learning\nproblems. In this paper, we propose a novel variational modelling framework for\nthe \\emph{posterior predictive distribution}~(PPD) to obtain uncertainty-aware\nprediction in graph-level learning tasks. Based on a graph-level embedding\nderived from one of the existing GNNs, our framework can learn the PPD in a\ndata-adaptive fashion. Experimental results on several benchmark datasets\nexhibit the effectiveness of our approach.", "published": "2025-08-23 11:28:50", "link": "http://arxiv.org/abs/2508.16995v1", "categories": ["stat.ML", "cs.LG"], "primary_category": "stat.ML"}
{"title": "Sig-DEG for Distillation: Making Diffusion Models Faster and Lighter", "abstract": "Diffusion models have achieved state-of-the-art results in generative\nmodelling but remain computationally intensive at inference time, often\nrequiring thousands of discretization steps. To this end, we propose Sig-DEG\n(Signature-based Differential Equation Generator), a novel generator for\ndistilling pre-trained diffusion models, which can universally approximate the\nbackward diffusion process at a coarse temporal resolution. Inspired by\nhigh-order approximations of stochastic differential equations (SDEs), Sig-DEG\nleverages partial signatures to efficiently summarize Brownian motion over\nsub-intervals and adopts a recurrent structure to enable accurate global\napproximation of the SDE solution. Distillation is formulated as a supervised\nlearning task, where Sig-DEG is trained to match the outputs of a\nfine-resolution diffusion model on a coarse time grid. During inference,\nSig-DEG enables fast generation, as the partial signature terms can be\nsimulated exactly without requiring fine-grained Brownian paths. Experiments\ndemonstrate that Sig-DEG achieves competitive generation quality while reducing\nthe number of inference steps by an order of magnitude. Our results highlight\nthe effectiveness of signature-based approximations for efficient generative\nmodeling.", "published": "2025-08-23 08:16:14", "link": "http://arxiv.org/abs/2508.16939v1", "categories": ["cs.LG", "math.PR", "stat.ML"], "primary_category": "cs.LG"}
{"title": "Pinhole Effect on Linkability and Dispersion in Speaker Anonymization", "abstract": "Speaker anonymization aims to conceal speaker-specific attributes in speech\nsignals, making the anonymized speech unlinkable to the original speaker\nidentity. Recent approaches achieve this by disentangling speech into content\nand speaker components, replacing the latter with pseudo speakers. The\nanonymized speech can be mapped either to a common pseudo speaker shared across\nutterances or to distinct pseudo speakers unique to each utterance. This paper\ninvestigates the impact of these mapping strategies on three key dimensions:\nspeaker linkability, dispersion in the anonymized speaker space, and\nde-identification from the original identity. Our findings show that using\ndistinct pseudo speakers increases speaker dispersion and reduces linkability\ncompared to common pseudo-speaker mapping, thereby enhancing privacy\npreservation. These observations are interpreted through the proposed pinhole\neffect, a conceptual framework introduced to explain the relationship between\nmapping strategies and anonymization performance. The hypothesis is validated\nthrough empirical evaluation.", "published": "2025-08-23 20:25:02", "link": "http://arxiv.org/abs/2508.17134v1", "categories": ["eess.AS"], "primary_category": "eess.AS"}
{"title": "HunyuanVideo-Foley: Multimodal Diffusion with Representation Alignment for High-Fidelity Foley Audio Generation", "abstract": "Recent advances in video generation produce visually realistic content, yet\nthe absence of synchronized audio severely compromises immersion. To address\nkey challenges in video-to-audio generation, including multimodal data\nscarcity, modality imbalance and limited audio quality in existing methods, we\npropose HunyuanVideo-Foley, an end-to-end text-video-to-audio framework that\nsynthesizes high-fidelity audio precisely aligned with visual dynamics and\nsemantic context. Our approach incorporates three core innovations: (1) a\nscalable data pipeline curating 100k-hour multimodal datasets through automated\nannotation; (2) a representation alignment strategy using self-supervised audio\nfeatures to guide latent diffusion training, efficiently improving audio\nquality and generation stability; (3) a novel multimodal diffusion transformer\nresolving modal competition, containing dual-stream audio-video fusion through\njoint attention, and textual semantic injection via cross-attention.\nComprehensive evaluations demonstrate that HunyuanVideo-Foley achieves new\nstate-of-the-art performance across audio fidelity, visual-semantic alignment,\ntemporal alignment and distribution matching. The demo page is available at:\nhttps://szczesnys.github.io/hunyuanvideo-foley/.", "published": "2025-08-23 07:30:18", "link": "http://arxiv.org/abs/2508.16930v1", "categories": ["eess.AS", "cs.CV", "cs.SD"], "primary_category": "eess.AS"}
{"title": "Localization using Angle-of-Arrival Triangulation", "abstract": "Indoor localization is a long-standing challenge in mobile computing, with\nsignificant implications for enabling location-aware and intelligent\napplications within smart environments such as homes, offices, and retail\nspaces. As AI assistants such as Amazon Alexa and Google Nest become\nincreasingly pervasive, microphone-equipped devices are emerging as key\ncomponents of everyday life and home automation. This paper introduces a\npassive, infrastructure-light system for localizing human speakers using speech\nsignals captured by two or more spatially distributed smart devices. The\nproposed approach, GCC+, extends the Generalized Cross-Correlation with Phase\nTransform (GCC-PHAT) method to estimate the Angle-of-Arrival (AoA) of audio\nsignals at each device and applies robust triangulation techniques to infer the\nspeaker's two-dimensional position. To further improve temporal resolution and\nlocalization accuracy, feature-space expansion and subsample interpolation\ntechniques are employed for precise Time Difference of Arrival (TDoA)\nestimation. The system operates without requiring hardware modifications, prior\ncalibration, explicit user cooperation, or knowledge of the speaker's signal\ncontent, thereby offering a highly practical solution for real-world\ndeployment. Experimental evaluation in a real-world home environment yields a\nmedian AoA estimation error of 2.2 degrees and a median localization error of\n1.25 m, demonstrating the feasibility and effectiveness of audio-based\nlocalization for enabling context-aware, privacy-preserving ambient\nintelligence.", "published": "2025-08-23 05:45:13", "link": "http://arxiv.org/abs/2508.16908v1", "categories": ["eess.AS", "cs.HC", "cs.NI", "cs.SD", "eess.SP", "C.3; C.2.1; C.2.4; I.5.4; H.5.2; J.7"], "primary_category": "eess.AS"}
{"title": "Enhancing Energy and Spectral Efficiency in IoT-Cellular Networks via Active SIM-Equipped LEO Satellites", "abstract": "This paper investigates a low Earth orbit (LEO) satellite communication\nsystem enhanced by an active stacked intelligent metasurface (ASIM), mounted on\nthe backplate of the satellite solar panels to efficiently utilize limited\nonboard space and reduce the main satellite power amplifier requirements. The\nsystem serves multiple ground users via rate-splitting multiple access (RSMA)\nand IoT devices through a symbiotic radio network. Multi-layer sequential\nprocessing in the ASIM improves effective channel gains and suppresses\ninter-user interference, outperforming active RIS and beyond-diagonal RIS\ndesigns. Three optimization approaches are evaluated: block coordinate descent\nwith successive convex approximation (BCD-SCA), model-assisted multi-agent\nconstraint soft actor-critic (MA-CSAC), and multi-constraint proximal policy\noptimization (MCPPO). Simulation results show that BCD-SCA converges fast and\nstably in convex scenarios without learning, MCPPO achieves rapid initial\nconvergence with moderate stability, and MA-CSAC attains the highest long-term\nspectral and energy efficiency in large-scale networks. Energy-spectral\nefficiency trade-offs are analyzed for different ASIM elements, satellite\nantennas, and transmit power. Overall, the study demonstrates that integrating\nmulti-layer ASIM with suitable optimization algorithms offers a scalable,\nenergy-efficient, and high-performance solution for next-generation LEO\nsatellite communications.", "published": "2025-08-23 22:00:33", "link": "http://arxiv.org/abs/2508.17149v1", "categories": ["eess.SY", "cs.SY", "eess.SP"], "primary_category": "eess.SY"}
{"title": "Performance Validation of Coded Wavefront Sensing for Quantitative Phase Imaging of Static and Dynamic Specimens Using Digital Holographic Microscopy", "abstract": "Coded wavefront sensing (Coded-WFS) is a snapshot quantitative phase imaging\n(QPI) technique that has been shown to successfully leverage the memory effect\nto retrieve the phase of biological specimens. In this paper, we perform QPI on\nstatic silica beads and dynamic HEK cells using Coded-WFS. The accuracy of the\nretrieved phase map is validated using digital holographic microscopy (DHM) for\nthe same specimens. We report comparisons of simultaneous bright-field\nintensity and optical path delay.", "published": "2025-08-23 20:56:13", "link": "http://arxiv.org/abs/2508.17143v1", "categories": ["physics.optics", "eess.SP"], "primary_category": "physics.optics"}
{"title": "Radio Frequency Identification: Decades at a Time", "abstract": "In this article, we briefly review the history of the use of radio signals to\nidentify objects, and of the key Radio Frequency Identification (RFID)\nstandards for ultra-high-frequency (UHF) and near-field communications that\nenabled broad use of these technologies in daily life. We will compare the\nvision for the future presented by the Auto-ID Lab in the early 21st century\nwith the reality we see today, two decades and a little after. We will review\nsome of the applications in which UHF RFID technology has become hugely\nsuccessful, others where High Frequency Near-field Communications (HF NFC) is\npreferred, and applications where optical identification or active wireless\ncommunications are dominant.\n  We will then examine some possible future paths for RFID technology. We\nanticipate that UHF read capability will become widely available for\ncellphones, making it as universal as NFC and Bluetooth are today. We will look\nat more sophisticated radio interfaces, such as multiple-antenna phased arrays\nfor readers, and tunnel diode reflection for tags. We will discuss the\nintegration of information from Artificial Intelligence (AI)-based image\nprocessing, barcodes, NFC and UHF tags, into a digital twin of the real\nenvironment experienced by the human user. We will examine the role of RFID\nwith sensing in improving the management of perishable goods. The role that\nRFID might play in a truly circular economy, with intelligent recycling and\nreuse, will be discussed. Finally, we survey the many hazards and obstacles\nthat obstruct the path to an RF-informed future.", "published": "2025-08-23 15:01:17", "link": "http://arxiv.org/abs/2508.17051v1", "categories": ["eess.SP"], "primary_category": "eess.SP"}
{"title": "Beamforming Control in RIS-Aided Wireless Communications: A Predictive Physics-Based Approach", "abstract": "Integrating reconfigurable intelligent surfaces (RIS) into wireless\ncommunication systems is a promising approach for enhancing coverage and data\nrates by intelligently redirecting signals, through a process known as\nbeamforming. However, the process of RIS beamforming (or passive beamforming)\ncontrol is associated with multiple latency-inducing factors. As a result, by\nthe time the beamforming is effectively updated, the channel conditions may\nhave already changed. For example, the low update rate of localization systems\nbecomes a critical limitation, as a mobile UE's position may change\nsignificantly between two consecutive measurements. To address this issue, this\nwork proposes a practical and scalable physics-based solution that is effective\nacross a wide range of UE movement models. Specifically, we propose a kinematic\nobserver and predictor to enable proactive RIS control. From low-rate position\nestimates provided by a localizer, the kinematic observer infers the UE's speed\nand acceleration. These motion parameters are then used by a predictor to\nestimate the UE's future positions at a higher rate, allowing the RIS to adjust\npromptly and compensate for inherent delays in both the RIS control and\nlocalization systems. Numerical results validate the effectiveness of the\nproposed approach, demonstrating real-time RIS adjustments with low\ncomputational complexity, even in scenarios involving rapid UE movement.", "published": "2025-08-23 10:07:08", "link": "http://arxiv.org/abs/2508.16980v1", "categories": ["eess.SY", "cs.SY", "eess.SP", "physics.app-ph"], "primary_category": "eess.SY"}
{"title": "TSPC-PFD: TSPC-Based Low-Power High-Resolution CMOS Phase Frequency Detector", "abstract": "Phase Frequency Detectors (PFDs) are essential components in Phase-Locked\nLoop (PLL) and Delay-Locked Loop (DLL) systems, responsible for comparing phase\nand frequency differences and generating up/down signals to regulate charge\npumps and/or, consequently, Voltage-Controlled Oscillators (VCOs). Conventional\nPFD designs often suffer from significant dead zones and blind zones, which\ndegrade phase detection accuracy and increase jitter in high-speed\napplications. This paper addresses PFD design challenges and presents a novel\nlow-power True Single-Phase Clock (TSPC)-based PFD. The proposed design\neliminates the blind zone entirely while achieving a minimal dead zone of 40\nps. The proposed PFD, implemented using TSMC 28 nm technology, demonstrates a\nlow-power consumption of 4.41 uW at 3 GHz input frequency with a layout area of\n$10.42\\mu m^2$.", "published": "2025-08-23 07:49:02", "link": "http://arxiv.org/abs/2508.16933v1", "categories": ["cs.ET", "eess.SP"], "primary_category": "cs.ET"}
{"title": "Relative Navigation and Dynamic Target Tracking for Autonomous Underwater Proximity Operations", "abstract": "Estimating a target's 6-DoF motion in underwater proximity operations is\ndifficult because the chaser lacks target-side proprioception and the available\nrelative observations are sparse, noisy, and often partial (e.g., Ultra-Short\nBaseline (USBL) positions). Without a motion prior, factor-graph maximum a\nposteriori estimation is underconstrained: consecutive target states are weakly\nlinked and orientation can drift. We propose a generalized constant-twist\nmotion prior defined on the tangent space of Lie groups that enforces\ntemporally consistent trajectories across all degrees of freedom; in SE(3) it\ncouples translation and rotation in the body frame. We present a ternary factor\nand derive its closed-form Jacobians based on standard Lie group operations,\nenabling drop-in use for trajectories on arbitrary Lie groups. We evaluate two\ndeployment modes: (A) an SE(3)-only representation that regularizes orientation\neven when only position is measured, and (B) a mode with boundary factors that\nswitches the target representation between SE(3) and 3D position while applying\nthe same generalized constant-twist prior across representation changes.\nValidation on a real-world dynamic docking scenario dataset shows consistent\nego-target trajectory estimation through USBL-only and optical relative\nmeasurement segments with an improved relative tracking accuracy compared to\nthe noisy measurements to the target. Because the construction relies on\nstandard Lie group primitives, it is portable across state manifolds and\nsensing modalities.", "published": "2025-08-23 05:19:50", "link": "http://arxiv.org/abs/2508.16901v1", "categories": ["cs.RO", "cs.SY", "eess.SP", "eess.SY", "I.2.9; I.2.8; F.2.2"], "primary_category": "cs.RO"}
{"title": "Dual Orthogonal Projections-Based Multiuser Interference Cancellation for mmWave Beamforming in XL-MIMO Systems", "abstract": "This paper investigates multiuser interference (MUI) cancellation for\nmillimeter-wave (mmWave) beamforming in extremely large-scale multiple-input\nmultiple-output (XL-MIMO) communication systems. We propose a linear algorithm,\ntermed iterative dual orthogonal projections (DOP), which alternates between\ntwo orthogonal projections: one to eliminate MUI and the other to refine\ncombiners, ensuring a monotonic increase in spectral efficiency. Theoretical\nanalysis and simulation results show that, with each iteration, the signal\npower for each user increases monotonically, the equivalent noise power after\nreceive combining decreases monotonically, and the spectral efficiency improves\naccordingly and converges rapidly, closely approaching the theoretical optimum\ndetermined by dirty paper coding (DPC), outperforming existing linear\nalgorithms in spectral efficiency.", "published": "2025-08-23 03:31:06", "link": "http://arxiv.org/abs/2508.16888v1", "categories": ["eess.SP"], "primary_category": "eess.SP"}
