{"title": "CayleyPy RL: Pathfinding and Reinforcement Learning on Cayley Graphs", "abstract": "This paper is the second in a series of studies on developing efficient\nartificial intelligence-based approaches to pathfinding on extremely large\ngraphs (e.g. $10^{70}$ nodes) with a focus on Cayley graphs and mathematical\napplications. The open-source CayleyPy project is a central component of our\nresearch. The present paper proposes a novel combination of a reinforcement\nlearning approach with a more direct diffusion distance approach from the first\npaper. Our analysis includes benchmarking various choices for the key building\nblocks of the approach: architectures of the neural network, generators for the\nrandom walks and beam search pathfinding. We compared these methods against the\nclassical computer algebra system GAP, demonstrating that they \"overcome the\nGAP\" for the considered examples. As a particular mathematical application we\nexamine the Cayley graph of the symmetric group with cyclic shift and\ntransposition generators. We provide strong support for the OEIS-A186783\nconjecture that the diameter is equal to n(n-1)/2 by machine learning and\nmathematical methods. We identify the conjectured longest element and generate\nits decomposition of the desired length. We prove a diameter lower bound of\nn(n-1)/2-n/2 and an upper bound of n(n-1)/2+ 3n by presenting the algorithm\nwith given complexity. We also present several conjectures motivated by\nnumerical experiments, including observations on the central limit phenomenon\n(with growth approximated by a Gumbel distribution), the uniform distribution\nfor the spectrum of the graph, and a numerical study of sorting networks. To\nstimulate crowdsourcing activity, we create challenges on the Kaggle platform\nand invite contributions to improve and benchmark approaches on Cayley graph\npathfinding and other tasks.", "published": "2025-02-25 21:53:41", "link": "http://arxiv.org/abs/2502.18663v1", "categories": ["cs.LG", "cs.DM", "cs.SI", "math.CO", "math.GR"], "primary_category": "cs.LG"}
{"title": "Unbent Collections of Orthogonal Drawings", "abstract": "Recently, there has been interest in representing single graphs by multiple\ndrawings; for example, using graph stories, storyplans, or uncrossed\ncollections. In this paper, we apply this idea to orthogonal graph drawing. Due\nto the orthogonal drawing style, we focus on plane 4-graphs, that is, planar\ngraphs of maximum degree 4 whose embedding is fixed. Our goal is to represent\nany plane 4-graph $G$ by an unbent collection, that is, a collection of\northogonal drawings of $G$ that adhere to the embedding of $G$ and ensure that\neach edge of $G$ is drawn without bends in at least one of the drawings. We\ninvestigate two objectives. First, we consider minimizing the number of\ndrawings in an unbent collection. We prove that every plane 4-graph can be\nrepresented by a collection with at most three drawings, which is tight. We\nalso give sufficient conditions for a graph to admit an unbent collection of\nsize 2. Second, we consider minimizing the total number of bends over all\ndrawings in an unbent collection. We show that this problem is NP-hard and give\na 3-approximation algorithm. For the special case of plane triconnected cubic\ngraphs, we show how to compute minimum-bend collections in linear time.", "published": "2025-02-25 17:35:01", "link": "http://arxiv.org/abs/2502.18390v1", "categories": ["cs.CG", "cs.DM", "cs.DS", "math.CO", "68R10"], "primary_category": "cs.CG"}
{"title": "Property Testing in Bounded Degree Hypergraphs", "abstract": "We extend the bounded degree graph model for property testing introduced by\nGoldreich and Ron (Algorithmica, 2002) to hypergraphs. In this framework, we\nanalyse the query complexity of three fundamental hypergraph properties:\ncolorability, $k$-partiteness, and independence number. We present a randomized\nalgorithm for testing $k$-partiteness within families of $k$-uniform $n$-vertex\nhypergraphs of bounded treewidth whose query complexity does not depend on $n$.\nIn addition, we prove optimal lower bounds of $\\Omega(n)$ on the query\ncomplexity of testing algorithms for $k$-colorability, $k$-partiteness, and\nindependence number in $k$-uniform $n$-vertex hypergraphs of bounded degree.\nFor each of these properties, we consider the problem of explicitly\nconstructing $k$-uniform hypergraphs of bounded degree that differ in\n$\\Theta(n)$ hyperedges from any hypergraph satisfying the property, but where\nviolations of the latter cannot be detected in any neighborhood of $o(n)$\nvertices.", "published": "2025-02-25 17:25:16", "link": "http://arxiv.org/abs/2502.18382v2", "categories": ["cs.CC", "cs.DM"], "primary_category": "cs.CC"}
{"title": "Graph Inference with Effective Resistance Queries", "abstract": "The goal of graph inference is to design algorithms for learning properties\nof a hidden graph using queries to an oracle that returns information about the\ngraph. Graph reconstruction, verification, and property testing are all types\nof graph inference.\n  In this work, we study graph inference using an oracle that returns the\neffective resistance (ER) between a pair of vertices. Effective resistance is a\ndistance originating from the study of electrical circuits with many\napplications. However, ER has received little attention from a graph inference\nperspective. Indeed, although it is known that an $n$-vertex graph can be\nuniquely reconstructed from all $\\binom{n}{2}$ possible ER queries, little else\nis known. We address this gap with several new results, including:\n  1. $O(n)$-query algorithms for testing whether a graph is a tree; deciding\nwhether two graphs are equal assuming one is a subgraph of the other; and\ntesting whether a given vertex (or edge) is a cut vertex (or cut edge).\n  2. Property testing algorithms, including for testing whether a graph is\nvertex- or edge-biconnected. We also give a reduction to adapt property testing\nresults from the bounded-degree model to our ER query model. This yields\nER-query-based algorithms for testing $k$-connectivity, bipartiteness,\nplanarity, and containment of a fixed subgraph.\n  3. Graph reconstruction algorithms, including an algorithm for reconstructing\na graph from a low-width tree decomposition; a $\\Theta(k^2)$-query,\npolynomial-time algorithm for recovering the adjacency matrix $A$ of a hidden\ngraph, given $A$ with $k$ of its entries deleted; and a $k$-query,\nexponential-time algorithm for the same task.\n  We also compare the power of ER queries and shortest path queries, which are\nclosely related but better studied. Interestingly, we show that the two query\nmodels are incomparable in power.", "published": "2025-02-25 16:37:25", "link": "http://arxiv.org/abs/2502.18350v1", "categories": ["cs.DS", "cs.DM", "cs.LG"], "primary_category": "cs.DS"}
{"title": "Local iterative algorithms for approximate symmetry guided by network centralities", "abstract": "Recently, the influence of potentially present symmetries has begun to be\nstudied in complex networks. A typical way of studying symmetries is via the\nautomorphism group of the corresponding graph. Since complex networks are often\nsubject to uncertainty and automorphisms are very sensitive to small changes,\nthis characterization needs to be modified to an approximate version for\nsuccessful application. This paper considers a recently introduced approximate\nsymmetry of complex networks computed as an automorphism with acceptance of\nsmall edge preservation error, see Liu 2020. This problem is generally very\nhard with respect to the large space of candidate permutations, and hence the\ncorresponding computation methods typically lead to the utilization of local\nalgorithms such as the simulated annealing used in the original work. This\npaper proposes a new heuristic algorithm extending such iterative search\nalgorithm method by using network centralities as heuristics. Centralities are\nshown to be a good tool to navigate the local search towards more appropriate\npermutations and lead to better search results.", "published": "2025-02-25 12:38:40", "link": "http://arxiv.org/abs/2502.18155v1", "categories": ["cs.SI", "cs.DM", "cs.NA", "math.NA", "05C60, 05C82, 68R10, 68W25", "G.2.2; F.2.2"], "primary_category": "cs.SI"}
{"title": "Merge-width and First-Order Model Checking", "abstract": "We introduce merge-width, a family of graph parameters that unifies several\nstructural graph measures, including treewidth, degeneracy, twin-width,\nclique-width, and generalized coloring numbers. Our parameters are based on new\ndecompositions called construction sequences. These are sequences of ever\ncoarser partitions of the vertex set, where each pair of parts has a specified\ndefault connection, and all vertex pairs of the graph that differ from the\ndefault are marked as resolved. The radius-$r$ merge-width is the maximum\nnumber of parts reached from a vertex by following a path of at most $r$\nresolved edges. Graph classes of bounded merge-width -- for which the\nradius-$r$ merge-width parameter can be bounded by a constant, for each fixed\n$r=1,2,3,\\ldots$ -- include all classes of bounded expansion or of bounded\ntwin-width, thus unifying two central notions from the Sparsity and Twin-width\nframeworks. Furthermore, they are preserved under first-order transductions,\nwhich attests to their robustness. We conjecture that classes of bounded\nmerge-width are equivalent to the previously introduced classes of bounded\nflip-width.\n  As our main result, we show that the model checking problem for first-order\nlogic is fixed-parameter tractable on graph classes of bounded merge-width,\nassuming the input includes a witnessing construction sequence. This unites and\nextends two previous model checking results: the result of Dvo\\v{r}\\'{a}k,\nKr\\'{a}l, and Thomas for classes of bounded expansion, and the result of\nBonnet, Kim, Thomass\\'e, and Watrigant for classes of bounded twin-width.\n  Finally, we suggest future research directions that could impact the study of\nstructural and algorithmic graph theory, in particular of monadically dependent\ngraph classes, which we conjecture to coincide with classes of almost bounded\nmerge-width.", "published": "2025-02-25 10:31:58", "link": "http://arxiv.org/abs/2502.18065v1", "categories": ["math.CO", "cs.DM", "cs.DS", "cs.LO"], "primary_category": "math.CO"}
{"title": "An unconditional lower bound for the active-set method on the hypercube", "abstract": "The existence of a polynomial-time pivot rule for the simplex method is a\nfundamental open question in optimization. While many super-polynomial lower\nbounds exist for individual or very restricted classes of pivot rules, there\ncurrently is little hope for an unconditional lower bound that addresses all\npivot rules. We approach this question by considering the active-set method as\na natural generalization of the simplex method to non-linear objectives. This\ngeneralization allows us to prove the first unconditional lower bound for all\npivot rules. More precisely, we construct a multivariate polynomial of degree\nlinear in the number of dimensions such that the active-set method started in\nthe origin visits all vertices of the hypercube. We hope that our framework\nserves as a starting point for a new angle of approach to understanding the\ncomplexity of the simplex method.", "published": "2025-02-25 09:28:43", "link": "http://arxiv.org/abs/2502.18019v1", "categories": ["cs.DM", "cs.CC", "cs.DS", "math.CO"], "primary_category": "cs.DM"}
{"title": "Adaptive Nesterov Accelerated Distributional Deep Hedging for Efficient Volatility Risk Management", "abstract": "In the field of financial derivatives trading, managing volatility risk is\ncrucial for protecting investment portfolios from market changes. Traditional\nVega hedging strategies, which often rely on basic and rule-based models, are\nhard to adapt well to rapidly changing market conditions. We introduce a new\nframework for dynamic Vega hedging, the Adaptive Nesterov Accelerated\nDistributional Deep Hedging (ANADDH), which combines distributional\nreinforcement learning with a tailored design based on adaptive Nesterov\nacceleration. This approach improves the learning process in complex financial\nenvironments by modeling the hedging efficiency distribution, providing a more\naccurate and responsive hedging strategy. The design of adaptive Nesterov\nacceleration refines gradient momentum adjustments, significantly enhancing the\nstability and speed of convergence of the model. Through empirical analysis and\ncomparisons, our method demonstrates substantial performance gains over\nexisting hedging techniques. Our results confirm that this innovative\ncombination of distributional reinforcement learning with the proposed\noptimization techniques improves financial risk management and highlights the\npractical benefits of implementing advanced neural network architectures in the\nfinance sector.", "published": "2025-02-25 02:12:16", "link": "http://arxiv.org/abs/2502.17777v1", "categories": ["cs.LG", "q-fin.CP"], "primary_category": "cs.LG"}
{"title": "Exactly solvable model of the square-root price impact dynamics under the long-range market-order correlation", "abstract": "In econophysics, there are several enigmatic empirical laws: (i)~the\nmarket-order flow has strong persistence (long-range order-sign correlation),\nwell formulated as the Lillo-Mike-Farmer model. This phenomenon seems\nparadoxical given the diffusive and unpredictable price dynamics; (ii)~the\nprice impact $I(Q)$ of a large metaorder $Q$ follows the square-root law,\n$I(Q)\\propto \\sqrt{Q}$. In this Letter, we propose an exactly solvable model of\nthe nonlinear price-impact dynamics that unifies these enigmas. We generalize\nthe Lillo-Mike-Farmer model to nonlinear price-impact dynamics, which is mapped\nto an exactly solvable L\\'evy-walk model. Our exact solution and numerical\nsimulations reveal three important points: First, the price dynamics remains\ndiffusive under the square-root law, even under the long-range correlation.\nSecond, price-movement statistics follows truncated power laws with typical\nexponent around three. Third, volatility has long memory. While this simple\nmodel lacks adjustable free parameters, it naturally aligns even with other\nenigmatic empirical laws, such as (iii)~the inverse-cubic law for price\nstatistics and (iv)~volatility clustering. This work illustrates the crucial\nrole of the square-root law in understanding rich and complex financial price\ndynamics from a single coherent viewpoint.", "published": "2025-02-25 07:12:03", "link": "http://arxiv.org/abs/2502.17906v2", "categories": ["q-fin.TR", "cond-mat.stat-mech", "econ.GN", "q-fin.EC", "q-fin.MF", "q-fin.PR"], "primary_category": "q-fin.TR"}
{"title": "Recurrent Neural Networks for Dynamic VWAP Execution: Adaptive Trading Strategies with Temporal Kolmogorov-Arnold Networks", "abstract": "The execution of Volume Weighted Average Price (VWAP) orders remains a\ncritical challenge in modern financial markets, particularly as trading volumes\nand market complexity continue to increase. In my previous work\narXiv:2502.13722, I introduced a novel deep learning approach that demonstrated\nsignificant improvements over traditional VWAP execution methods by directly\noptimizing the execution problem rather than relying on volume curve\npredictions. However, that model was static because it employed the fully\nlinear approach described in arXiv:2410.21448, which is not designed for\ndynamic adjustment. This paper extends that foundation by developing a dynamic\nneural VWAP framework that adapts to evolving market conditions in real time.\nWe introduce two key innovations: first, the integration of recurrent neural\nnetworks to capture complex temporal dependencies in market dynamics, and\nsecond, a sophisticated dynamic adjustment mechanism that continuously\noptimizes execution decisions based on market feedback. The empirical analysis,\nconducted across five major cryptocurrency markets, demonstrates that this\ndynamic approach achieves substantial improvements over both traditional\nmethods and our previous static implementation, with execution performance\ngains of 10 to 15% in liquid markets and consistent outperformance across\nvarying conditions. These results suggest that adaptive neural architectures\ncan effectively address the challenges of modern VWAP execution while\nmaintaining computational efficiency suitable for practical deployment.", "published": "2025-02-25 13:11:24", "link": "http://arxiv.org/abs/2502.18177v1", "categories": ["q-fin.ST", "cs.LG"], "primary_category": "q-fin.ST"}
{"title": "LLM Knows Geometry Better than Algebra: Numerical Understanding of LLM-Based Agents in A Trading Arena", "abstract": "Recent advancements in large language models (LLMs) have significantly\nimproved performance in natural language processing tasks. However, their\nability to generalize to dynamic, unseen tasks, particularly in numerical\nreasoning, remains a challenge. Existing benchmarks mainly evaluate LLMs on\nproblems with predefined optimal solutions, which may not align with real-world\nscenarios where clear answers are absent. To bridge this gap, we design the\nAgent Trading Arena, a virtual numerical game simulating complex economic\nsystems through zero-sum games, where agents invest in stock portfolios. Our\nexperiments reveal that LLMs, including GPT-4o, struggle with algebraic\nreasoning when dealing with plain-text stock data, often focusing on local\ndetails rather than global trends. In contrast, LLMs perform significantly\nbetter with geometric reasoning when presented with visual data, such as\nscatter plots or K-line charts, suggesting that visual representations enhance\nnumerical reasoning. This capability is further improved by incorporating the\nreflection module, which aids in the analysis and interpretation of complex\ndata. We validate our findings on NASDAQ Stock dataset, where LLMs demonstrate\nstronger reasoning with visual data compared to text. Our code and data are\npublicly available at https://github.com/wekjsdvnm/Agent-Trading-Arena.git.", "published": "2025-02-25 08:41:01", "link": "http://arxiv.org/abs/2502.17967v1", "categories": ["cs.LG", "cs.AI", "cs.CL", "cs.MA", "q-fin.ST"], "primary_category": "cs.LG"}
{"title": "To Make, or to Take, That Is the Question: Impact of LOB Mechanics on Natural Trading Strategies", "abstract": "Working at a very granular level, using data from a live trading experiment\non the Binance linear Bitcoin perpetual-the most liquid crypto market\nworldwide-we examine the effects of (i) basic order book mechanics and (ii) the\nstrong persistence of price changes from the immediate to the short timescale,\nrevealing the interplay between returns, queue sizes, and orders' queue\npositions. For maker orders, we find a negative correlation between fill\nlikelihood and subsequent short-term returns, posing a significant challenge\nfor maker order-based strategies, while the main hurdle with taker orders is\novercoming the taker fee. These dynamics render natural (and commonly-cited)\ntrading strategies highly unprofitable. Finally, we use the understanding\ngained to identify situations (Reversals) in which a successful trading\nstrategy can operate; we construct a signal for Reversals and demonstrate its\nefficacy.", "published": "2025-02-25 20:22:59", "link": "http://arxiv.org/abs/2502.18625v1", "categories": ["q-fin.TR"], "primary_category": "q-fin.TR"}
