{"title": "On the order of the shortest solution sequences for the pebble motion problems", "abstract": "Let $G$ be a connected graph with $N$ vertices. Let $k$ be the number of\nvertices in a longest path of $G$ such that every vertex on the path is a cut\nvertex of $G$, and every intermediate vertex of the path is a degree-two vertex\nof $G$. Let $k$ be the number of vertices of such a longest path of $T$ that\nevery vertex of the path is a cut vertex and that every intermediate vertex of\nthe path is a degree-two vertex of $T$. Let $P=\\{1,\\ldots,n\\}$ be a set of\npebbles with $n+k < N$. A configuration of $P$ on $G$ is defined as a function\n$f$ from $V(G)$ to $\\{0, 1, \\ldots, n \\}$ with $|f^{-1}(i)| = 1$ for $1 \\le i\n\\le n$, where $f^{-1}(i)$ is a vertex occupied with the $i$th pebble for $1 \\le\ni \\le n$ and $f^{-1}(0)$ is a set of unoccupied vertices. A move is defined as\nshifting a pebble from a vertex to some unoccupied neighbor. The pebble motion\nproblem on the pair $(G,P)$ is to decide whether a given configuration of\npebbles is reachable from another by executing a sequence of moves. In this\npaper, we show that the length of the shortest solution sequence of the pebble\nmotion problem on the pair $(G,P)$ is in $O(Nn + n^2 \\log(\\min\\{n,k\\}))$ if $G$\nis a $N$-vertex tree, and it is in $O(N^2 + \\frac{n^3}{N-n} + n^2\n\\log(\\min\\{n,N-n\\}))$ if $G$ is a connected general $N$-vertex graph. We\nprovide an algorithm that can obtain a solution sequence of lengths that\nsatisfy these orders, with the same computational complexity as the order of\nthe length.\n  Keywords: pebble motion, motion planning, multi-agent path finding,\n$15$-puzzle, tree", "published": "2025-03-26 13:46:44", "link": "http://arxiv.org/abs/2503.20550v2", "categories": ["math.CO", "cs.CC", "cs.DM"], "primary_category": "math.CO"}
{"title": "Local obstructions in sequences revisited", "abstract": "In this article, we consider some simple combinatorial game and a winning\nstrategy in this game. This game is then used to prove several known results\nabout non-repetitive sequences and approximations with denominators from a\nlacunary sequence. In this way we simplify the proofs, improve the bounds and\nget for free the computable versions that required a separate treatment.", "published": "2025-03-26 13:16:12", "link": "http://arxiv.org/abs/2503.20529v1", "categories": ["math.CO", "cs.DM", "math.NT"], "primary_category": "math.CO"}
{"title": "Beyond Worst-Case Subset Sum: An Adaptive, Structure-Aware Solver with Sub-$2^{n/2}$ Enumeration", "abstract": "The Subset Sum problem, which asks whether a set of $n$ integers has a subset\nsumming to a target $t$, is a fundamental NP-complete problem in cryptography\nand combinatorial optimization. The classical meet-in-the-middle (MIM)\nalgorithm of Horowitz--Sahni runs in\n$\\widetilde{\\mathcal{O}}\\bigl(2^{n/2}\\bigr)$, still the best-known\ndeterministic bound. Yet many instances exhibit abundant collisions in partial\nsums, so actual hardness often depends on the number of unique sums ($U$).\n  We present a structure-aware, adaptive solver that enumerates only distinct\nsums, pruning duplicates on the fly, thus running in\n$\\widetilde{\\mathcal{O}}(U)$ when $U \\ll 2^n$. Its core is a unique-subset-sums\nenumerator combined with a double meet-in-the-middle strategy and lightweight\ndynamic programming, avoiding the classical MIM's expensive merge. We also\nintroduce combinatorial tree compression to guarantee strictly sub-$2^{n/2}$\nenumeration even on unstructured inputs, shaving a nontrivial constant from the\nexponent.\n  Our solver supports anytime and online modes, producing partial solutions\nearly and adapting to newly added elements. Theoretical analysis and\nexperiments show that for structured instances -- e.g. with small doubling\nconstants, high additive energy, or significant redundancy -- our method can\nfar outperform classical approaches, often nearing dynamic-programming\nefficiency. Even in the worst case, it remains within\n$\\widetilde{\\mathcal{O}}\\bigl(2^{n/2}\\bigr)$, and its compression-based pruning\nyields a real constant-factor speedup over naive MIM. We conclude by discussing\nhow this instance-specific adaptivity refines the Subset Sum complexity\nlandscape and suggesting future adaptive-exponential directions.", "published": "2025-03-26 02:32:13", "link": "http://arxiv.org/abs/2503.20162v1", "categories": ["cs.DS", "cs.CC", "cs.DM"], "primary_category": "cs.DS"}
{"title": "Relative portfolio optimization via a value at risk based constraint", "abstract": "In this paper, we consider $n$ agents who invest in a general financial\nmarket that is free of arbitrage and complete. The aim of each investor is to\nmaximize her expected utility while ensuring, with a specified probability,\nthat her terminal wealth exceeds a benchmark defined by her competitors'\nperformance. This setup introduces an interdependence between agents, leading\nto a search for Nash equilibria. In the case of two agents and CRRA utility, we\nare able to derive all Nash equilibria in terms of terminal wealth. For $n>2$\nagents and logarithmic utility we distinguish two cases. In the first case, the\nprobabilities in the constraint are small and we can characterize all Nash\nequilibria. In the second case, the probabilities are larger and we look for\nNash equilibria in a certain set. We also discuss the impact of the competition\nusing some numerical examples. As a by-product, we solve some portfolio\noptimization problems with probability constraints.", "published": "2025-03-26 09:06:29", "link": "http://arxiv.org/abs/2503.20340v1", "categories": ["math.OC", "q-fin.MF", "q-fin.PM"], "primary_category": "math.OC"}
{"title": "Relative portfolio optimization via a value at risk based constraint", "abstract": "In this paper, we consider $n$ agents who invest in a general financial\nmarket that is free of arbitrage and complete. The aim of each investor is to\nmaximize her expected utility while ensuring, with a specified probability,\nthat her terminal wealth exceeds a benchmark defined by her competitors'\nperformance. This setup introduces an interdependence between agents, leading\nto a search for Nash equilibria. In the case of two agents and CRRA utility, we\nare able to derive all Nash equilibria in terms of terminal wealth. For $n>2$\nagents and logarithmic utility we distinguish two cases. In the first case, the\nprobabilities in the constraint are small and we can characterize all Nash\nequilibria. In the second case, the probabilities are larger and we look for\nNash equilibria in a certain set. We also discuss the impact of the competition\nusing some numerical examples. As a by-product, we solve some portfolio\noptimization problems with probability constraints.", "published": "2025-03-26 09:06:29", "link": "http://arxiv.org/abs/2503.20340v2", "categories": ["math.OC", "q-fin.MF", "q-fin.PM"], "primary_category": "math.OC"}
