{"title": "Forecasting S&P 500 Using LSTM Models", "abstract": "With the volatile and complex nature of financial data influenced by external\nfactors, forecasting the stock market is challenging. Traditional models such\nas ARIMA and GARCH perform well with linear data but struggle with non-linear\ndependencies. Machine learning and deep learning models, particularly Long\nShort-Term Memory (LSTM) networks, address these challenges by capturing\nintricate patterns and long-term dependencies. This report compares ARIMA and\nLSTM models in predicting the S&P 500 index, a major financial benchmark.\n  Using historical price data and technical indicators, we evaluated these\nmodels using Mean Absolute Error (MAE) and Root Mean Squared Error (RMSE). The\nARIMA model showed reasonable performance with an MAE of 462.1, RMSE of 614,\nand 89.8 percent accuracy, effectively capturing short-term trends but limited\nby its linear assumptions. The LSTM model, leveraging sequential processing\ncapabilities, outperformed ARIMA with an MAE of 369.32, RMSE of 412.84, and\n92.46 percent accuracy, capturing both short- and long-term dependencies.\nNotably, the LSTM model without additional features performed best, achieving\nan MAE of 175.9, RMSE of 207.34, and 96.41 percent accuracy, showcasing its\nability to handle market data efficiently.\n  Accurately predicting stock movements is crucial for investment strategies,\nrisk assessments, and market stability. Our findings confirm the potential of\ndeep learning models in handling volatile financial data compared to\ntraditional ones. The results highlight the effectiveness of LSTM and suggest\navenues for further improvements. This study provides insights into financial\nforecasting, offering a comparative analysis of ARIMA and LSTM while outlining\ntheir strengths and limitations.", "published": "2025-01-29 01:31:56", "link": "http://arxiv.org/abs/2501.17366v1", "categories": ["cs.LG", "cs.AI", "q-fin.CP", "q-fin.TR"], "primary_category": "cs.LG"}
{"title": "Transformer Based Time-Series Forecasting for Stock", "abstract": "To the naked eye, stock prices are considered chaotic, dynamic, and\nunpredictable. Indeed, it is one of the most difficult forecasting tasks that\nhundreds of millions of retail traders and professional traders around the\nworld try to do every second even before the market opens. With recent advances\nin the development of machine learning and the amount of data the market\ngenerated over years, applying machine learning techniques such as deep\nlearning neural networks is unavoidable. In this work, we modeled the task as a\nmultivariate forecasting problem, instead of a naive autoregression problem.\nThe multivariate analysis is done using the attention mechanism via applying a\nmutated version of the Transformer, \"Stockformer\", which we created.", "published": "2025-01-29 00:26:47", "link": "http://arxiv.org/abs/2502.09625v1", "categories": ["q-fin.CP", "cs.LG"], "primary_category": "q-fin.CP"}
{"title": "On the Singular Control of a Diffusion and Its Running Infimum or Supremum", "abstract": "We study a class of singular stochastic control problems for a\none-dimensional diffusion $X$ in which the performance criterion to be\noptimised depends explicitly on the running infimum $I$ (or supremum $S$) of\nthe controlled process. We introduce two novel integral operators that are\nconsistent with the Hamilton-Jacobi-Bellman equation for the resulting\ntwo-dimensional singular control problems. The first operator involves\nintegrals where the integrator is the control process of the two-dimensional\nprocess $(X,I)$ or $(X,S)$; the second operator concerns integrals where the\nintegrator is the running infimum or supremum process itself. Using these\ndefinitions, we prove a general verification theorem for problems involving\ntwo-dimensional state-dependent running costs, costs of controlling the\nprocess, costs of increasing the running infimum (or supremum) and exit times.\nFinally, we apply our results to explicitly solve an optimal dividend problem\nin which the manager's time-preferences depend on the company's historical\nworst performance.", "published": "2025-01-29 11:29:39", "link": "http://arxiv.org/abs/2501.17577v1", "categories": ["math.OC", "math.PR", "q-fin.MF", "93E20, 60J60, 49L12, 91B70"], "primary_category": "math.OC"}
{"title": "Bankruptcy analysis using images and convolutional neural networks (CNN)", "abstract": "The marketing departments of financial institutions strive to craft products\nand services that cater to the diverse needs of businesses of all sizes.\nHowever, it is evident upon analysis that larger corporations often receive a\nmore substantial portion of available funds. This disparity arises from the\nrelative ease of assessing the risk of default and bankruptcy in these more\nprominent companies. Historically, risk analysis studies have focused on data\nfrom publicly traded or stock exchange-listed companies, leaving a gap in\nknowledge about small and medium-sized enterprises (SMEs). Addressing this gap,\nthis study introduces a method for evaluating SMEs by generating images for\nprocessing via a convolutional neural network (CNN). To this end, more than\n10,000 images, one for each company in the sample, were created to identify\nscenarios in which the CNN can operate with higher assertiveness and reduced\ntraining error probability. The findings demonstrate a significant predictive\ncapacity, achieving 97.8% accuracy, when a substantial number of images are\nutilized. Moreover, the image creation method paves the way for potential\napplications of this technique in various sectors and for different analytical\npurposes.", "published": "2025-01-29 21:57:47", "link": "http://arxiv.org/abs/2502.15726v1", "categories": ["q-fin.RM", "cs.LG", "math.ST", "q-fin.ST", "stat.TH", "68T07 (Primary) 91G80, 91B84, 68U10, 62P20 (Secondary)"], "primary_category": "q-fin.RM"}
