{"title": "Understanding the Commodity Futures Term Structure Through Signatures", "abstract": "Signature methods have been widely and effectively used as a tool for feature\nextraction in statistical learning methods, notably in mathematical finance.\nThey lack, however, interpretability: in the general case, it is unclear why\nsignatures actually work. The present article aims to address this issue\ndirectly, by introducing and developing the concept of signature perturbations.\nIn particular, we construct a regular perturbation of the signature of the term\nstructure of log prices for various commodities, in terms of the convenience\nyield. Our perturbation expansion and rigorous convergence estimates help\nexplain the success of signature-based classification of commodities markets\naccording to their term structure, with the volatility of the convenience yield\nas the major discriminant.", "published": "2025-03-01 20:04:44", "link": "http://arxiv.org/abs/2503.00603v1", "categories": ["q-fin.MF", "math.PR", "q-fin.ST", "60L10, 62H30, 91G15, 91G20"], "primary_category": "q-fin.MF"}
{"title": "Ornstein-Uhlenbeck Process for Horse Race Betting: A Micro-Macro Analysis of Herding and Informed Bettors", "abstract": "We model the time evolution of single win odds in Japanese horse racing as a\nstochastic process, deriving an Ornstein--Uhlenbeck process by analyzing the\nprobability dynamics of vote shares and the empirical time series of odds\nmovements. Our framework incorporates two types of bettors: herders, who adjust\ntheir bets based on current odds, and fundamentalists, who wager based on a\nhorse's true winning probability. Using data from 3450 Japan Racing Association\nraces in 2008, we identify a microscopic probability rule governing individual\nbets and a mean-reverting macroscopic pattern in odds convergence. This\nstructure parallels financial markets, where traders' decisions are influenced\nby market fluctuations, and the interplay between herding and fundamentalist\nstrategies shapes price dynamics. These results highlight the broader\napplicability of our approach to non-equilibrium financial and betting markets,\nwhere mean-reverting dynamics emerge from simple behavioral interactions.", "published": "2025-03-01 07:24:53", "link": "http://arxiv.org/abs/2503.16470v1", "categories": ["physics.soc-ph", "q-fin.ST"], "primary_category": "physics.soc-ph"}
{"title": "Shifting Power: Leveraging LLMs to Simulate Human Aversion in ABMs of Bilateral Financial Exchanges, A bond market study", "abstract": "Bilateral markets, such as those for government bonds, involve decentralized\nand opaque transactions between market makers (MMs) and clients, posing\nsignificant challenges for traditional modeling approaches. To address these\ncomplexities, we introduce TRIBE an agent-based model augmented with a large\nlanguage model (LLM) to simulate human-like decision-making in trading\nenvironments. TRIBE leverages publicly available data and stylized facts to\ncapture realistic trading dynamics, integrating human biases like risk aversion\nand ambiguity sensitivity into the decision-making processes of agents. Our\nresearch yields three key contributions: first, we demonstrate that integrating\nLLMs into agent-based models to enhance client agency is feasible and enriches\nthe simulation of agent behaviors in complex markets; second, we find that even\nslight trade aversion encoded within the LLM leads to a complete cessation of\ntrading activity, highlighting the sensitivity of market dynamics to agents'\nrisk profiles; third, we show that incorporating human-like variability shifts\npower dynamics towards clients and can disproportionately affect the entire\nsystem, often resulting in systemic agent collapse across simulations. These\nfindings underscore the emergent properties that arise when introducing\nstochastic, human-like decision processes, revealing new system behaviors that\nenhance the realism and complexity of artificial societies.", "published": "2025-03-01 03:15:13", "link": "http://arxiv.org/abs/2503.00320v2", "categories": ["q-fin.TR", "cs.AI", "cs.MA"], "primary_category": "q-fin.TR"}
