{"title": "Light Edge Fault Tolerant Graph Spanners", "abstract": "There has recently been significant interest in fault tolerant spanners,\nwhich are spanners that still maintain their stretch guarantees after some\nnodes or edges fail. This work has culminated in an almost complete\nunderstanding of the three-way tradeoff between stretch, sparsity, and number\nof faults tolerated. However, despite some progress in metric settings, there\nhave been no results to date on the tradeoff in general graphs between stretch,\nlightness, and number of faults tolerated.\n  We initiate the study of light edge fault tolerant (EFT) graph spanners,\nobtaining the first such results. First, we observe that lightness can be\nunbounded if we use the traditional definition (normalizing by the MST). We\nthen argue that a natural definition of fault-tolerant lightness is to instead\nnormalize by a min-weight fault tolerant connectivity preserver; essentially, a\nfault-tolerant version of the MST. However, even with this, we show that it is\nstill not generally possible to construct $f$-EFT spanners whose weight\ncompares reasonably to the weight of a min-weight $f$-EFT connectivity\npreserver.\n  In light of this lower bound, it is natural to then consider bicriteria\nnotions of lightness, where we compare the weight of an $f$-EFT spanner to a\nmin-weight $(f' > f)$-EFT connectivity preserver. The most interesting question\nis to determine the minimum value of $f'$ that allows for reasonable lightness\nupper bounds. Our main result is a precise answer to this question: $f' = 2f$.\nIn particular, we show that the lightness can be untenably large (roughly $n/k$\nfor a $k$-spanner) if one normalizes by the min-weight $(2f-1)$-EFT\nconnectivity preserver. But if one normalizes by the min-weight $2f$-EFT\nconnectivity preserver, then we show that the lightness is bounded by just\n$O(f^{1/2})$ times the non-fault tolerant lightness (roughly $n^{1/k}$, for a\n$(1+\\epsilon)(2k-1)$-spanner).", "published": "2025-02-15 19:46:27", "link": "http://arxiv.org/abs/2502.10890v1", "categories": ["cs.DS", "cs.DM", "math.CO"], "primary_category": "cs.DS"}
{"title": "Heterogenous Macro-Finance Model: A Mean-field Game Approach", "abstract": "We investigate the full dynamics of capital allocation and wealth\ndistribution of heterogeneous agents in a frictional economy during booms and\nbusts using tools from mean-field games. Two groups in our models, namely the\nexpert and the household, are interconnected within and between their classes\nthrough the law of capital processes and are bound by financial constraints.\nSuch a mean-field interaction explains why experts accumulate a lot of capital\nin the good times and reverse their behavior quickly in the bad times even in\nthe absence of aggregate macro-shocks. When common noises from the market are\ninvolved, financial friction amplifies the mean-field effect and leads to\ncapital fire sales by experts. In addition, the implicit interlink between and\nwithin heterogeneous groups demonstrates the slow economic recovery and\ncharacterizes the deviating and fear-of-missing-out (FOMO) behaviors of\nhouseholds compared to their counterparts. Our model also gives a fairly\nexplicit representation of the equilibrium solution without exploiting\ncomplicated numerical approaches.", "published": "2025-02-15 04:21:15", "link": "http://arxiv.org/abs/2502.10666v1", "categories": ["q-fin.MF"], "primary_category": "q-fin.MF"}
