{"title": "Broadcast via Mobile Agents in a Dynamic Network: Interplay of Graph Properties & Agents", "abstract": "In this paper, we revisit the problem of \\textsc{Broadcast}, introduced by\nDas, Giachoudis, Luccio, and Markou [OPODIS, 2020], where $k+1$ agents are\ninitially placed on an $n$ node dynamic graph, where $1$ agent has a message\nthat must be broadcast to the remaining $k$ ignorant agents. The original paper\nstudied the relationship between the number of agents needed to solve the\nproblem and the edge density of the graph. The paper presented strong evidence\nthat edge density of a graph, or the number of redundant edges within the\ngraph, may be the correct graph property to accurately differentiate whether\n$k= o(n)$ agents (low edge density) or $k = \\Omega(n)$ agents (high edge\ndensity) are needed to solve the problem.\n  In this paper, we show that surprisingly, edge density may not in fact be the\ncorrect differentiating property. The original paper presents graphs with edge\ndensity $1.1\\overline{6}$ that require $\\Omega(n)$ agents, however, we\nconstruct graphs with edge density $> 1.1\\overline{6}$ and develop an algorithm\nto solve the problem on those graphs using only $o(n)$ agents. We subsequently\nshow that the relationship between edge density and number of agents is fairly\nweak by first constructing graphs with edge density tending to $1$ from above\nthat require $\\Omega(n/f(n))$ agents to solve, for any function $f(n) \\to\n\\infty$ as $n \\to \\infty$. We then construct an infinite family of graphs with\nedge density $< \\rho$ requiring exactly $k$ ignorant agents to solve\n\\textsc{Broadcast}, for any $k>0$ and $\\rho>1$.", "published": "2025-04-07 19:07:24", "link": "http://arxiv.org/abs/2504.05442v1", "categories": ["cs.DM"], "primary_category": "cs.DM"}
{"title": "Infinite precedence graphs for consistency verification in P-time event graphs", "abstract": "Precedence constraints are inequalities used to model time dependencies. In\n1958, Gallai proved that a finite system of precedence constraints admits\nsolutions if and only if the corresponding precedence graph does not contain\npositive-weight circuits. We show that this result extends naturally to the\ncase of infinitely many constraints. We then analyze two specific classes of\ninfinite precedence graphs -- $\\mathbb{N}$-periodic and ultimately periodic\ngraphs -- and prove that the existence of solutions of their related\nconstraints can be verified in strongly polynomial time. The obtained\nalgorithms find applications in P-time event graphs, which are a subclass of\nP-time Petri nets able to model production systems under cyclic schedules where\ntasks need to be performed within given time windows.", "published": "2025-04-07 13:26:23", "link": "http://arxiv.org/abs/2504.05056v1", "categories": ["eess.SY", "cs.DM", "cs.SY"], "primary_category": "eess.SY"}
{"title": "Supports for Outerplanar and Bounded Treewidth Graphs", "abstract": "We study the existence and construction of sparse supports for hypergraphs\nderived from subgraphs of a graph $G$. For a hypergraph $(X,\\mathcal{H})$, a\nsupport $Q$ is a graph on $X$ s.t. $Q[H]$, the graph induced on vertices in $H$\nis connected for every $H\\in\\mathcal{H}$.\n  We consider \\emph{primal}, \\emph{dual}, and \\emph{intersection} hypergraphs\ndefined by subgraphs of a graph $G$ that are \\emph{non-piercing}, (i.e., each\nsubgraph is connected, their pairwise differences remain connected).\n  If $G$ is outerplanar, we show that the primal, dual and intersection\nhypergraphs admit supports that are outerplanar. For a bounded treewidth graph\n$G$, we show that if the subgraphs are non-piercing, then there exist supports\nfor the primal and dual hypergraphs of treewidth $O(2^{tw(G)})$ and\n$O(2^{4tw(G)})$ respectively, and a support of treewidth $2^{O(2^{tw(G)})}$ for\nthe intersection hypergraph. We also show that for the primal and dual\nhypergraphs, the exponential blow-up of treewidth is sometimes essential.\n  All our results are algorithmic and yield polynomial-time algorithms (when\nthe treewidth is bounded). The existence and construction of sparse supports is\na crucial step in the design and analysis of PTASs and/or sub-exponential time\nalgorithms for several packing and covering problems.", "published": "2025-04-07 13:04:30", "link": "http://arxiv.org/abs/2504.05039v2", "categories": ["math.CO", "cs.DM"], "primary_category": "math.CO"}
{"title": "The Minimum Eternal Vertex Cover Problem on a Subclass of Series-Parallel Graphs", "abstract": "Eternal vertex cover is the following two-player game between a defender and\nan attacker on a graph. Initially, the defender positions k guards on k\nvertices of the graph; the game then proceeds in turns between the defender and\nthe attacker, with the attacker selecting an edge and the defender responding\nto the attack by moving some of the guards along the edges, including the\nattacked one. The defender wins a game on a graph G with k guards if they have\na strategy such that, in every round of the game, the vertices occupied by the\nguards form a vertex cover of G, and the attacker wins otherwise. The eternal\nvertex cover number of a graph G is the smallest number k of guards allowing\nthe defender to win and Eternal Vertex Cover is the problem of computing the\neternal vertex cover number of the given graph.\n  We study this problem when restricted to the well-known class of\nseries-parallel graphs. In particular, we prove that Eternal Vertex Cover can\nbe solved in linear time when restricted to melon graphs, a proper subclass of\nseries-parallel graphs. Moreover, we also conjecture that this problem is\nNP-hard on series-parallel graphs.", "published": "2025-04-07 10:12:09", "link": "http://arxiv.org/abs/2504.04897v1", "categories": ["math.CO", "cs.CC", "cs.DM", "cs.DS", "05C85, 68R10", "G.2.2"], "primary_category": "math.CO"}
{"title": "Strengthening Wilf's lower bound on clique number", "abstract": "Given an integer $k$, deciding whether a graph has a clique of size $k$ is an\nNP-complete problem. Wilf's inequality provides a spectral bound for the clique\nnumber of simple graphs. Wilf's inequality is stated as follows: $\\frac{n}{n -\n\\lambda_{1}} \\leq \\omega$, where $\\lambda_1$ is the largest eigenvalue of the\nadjacency matrix $A(G)$, $n$ is the number of vertices in $G$, and $\\omega$ is\nthe clique number of $G$. Strengthening this bound, Elphick and Wocjan proposed\na conjecture in 2018, which is stated as follows: $\\frac{n}{n - \\sqrt{s^{+}}}\n\\leq \\omega$, where $s^+ = \\sum_{\\lambda_{i} > 0} \\lambda_{i}^2$ and\n$\\lambda_i$ are the eigenvalues of $A(G)$. In this paper, we have settled this\nconjecture for some classes of graphs, such as conference graphs, strongly\nregular graphs with $\\lambda = \\mu$ (i.e., $srg(n, d, \\mu, \\mu)$) and $n\\geq\n2d$, the line graph of $K_{n}$, the Cartesian product of strongly regular\ngraphs, and Ramanujan graph with $n\\geq 11d$.", "published": "2025-04-07 08:46:55", "link": "http://arxiv.org/abs/2504.04836v1", "categories": ["cs.DM", "math.CO", "05C50, 05C69, 05C76, 05C48"], "primary_category": "cs.DM"}
{"title": "A Customized SAT-based Solver for Graph Coloring", "abstract": "We introduce ZykovColor, a novel SAT-based algorithm to solve the graph\ncoloring problem working on top of an encoding that mimics the Zykov tree. Our\nmethod is based on an approach of H\\'ebrard and Katsirelos (2020) that employs\na propagator to enforce transitivity constraints, incorporate lower bounds for\nsearch tree pruning, and enable inferred propagations. We leverage the recently\nintroduced IPASIR-UP interface for CaDiCal to implement these techniques with a\nSAT solver. Furthermore, we propose new features that take advantage of the\nunderlying SAT solver. These include modifying the integrated decision strategy\nwith vertex domination hints and using incremental bottom-up search that allows\nto reuse learned clauses from previous calls. Additionally, we integrate a more\nefficient clique computation to improve the lower bounds during the search. We\nvalidate the effectiveness of each new feature through an experimental\nanalysis. ZykovColor outperforms other state-of-the-art graph coloring\nimplementations on the DIMACS benchmark set. Further experiments on random\nErd\\H{o}s-R\\'enyi graphs show that our new approach dominates state-of-the-art\nSAT-based methods for both very sparse and highly dense graphs.", "published": "2025-04-07 08:22:00", "link": "http://arxiv.org/abs/2504.04821v1", "categories": ["cs.DM", "cs.AI", "cs.DS", "cs.LO", "05C15", "G.2.2"], "primary_category": "cs.DM"}
{"title": "Status Updating with Time Stamp Errors", "abstract": "A status updating system is considered in which multiple processes are\nsampled and transmitted through a shared channel. Each process has its\ndedicated server that processes its samples before time stamping them for\ntransmission. Time stamps, however, are prone to errors, and hence the status\nupdates received may not be credible. Our setting models the time stamp error\nrate as a function of the servers' busy times. Hence, to reduce errors and\nenhance credibility, servers need to process samples on a relatively prolonged\nschedule. This, however, deteriorates timeliness, which is captured through the\nage of information (AoI) metric. An optimization problem is formulated whose\ngoal to characterize the optimal processes' schedule and sampling instances to\nachieve the optimal trade-off between timeliness and credibility. The problem\nis first solved for a single process setting, where it is shown that a\nthreshold-based sleep-wake schedule is optimal, in which the server wakes up\nand is allowed to process newly incoming samples only if the AoI surpasses a\ncertain threshold that depends on the required timeliness-credibility\ntrade-off. Such insights are then extended to the multi-process setting, where\ntwo main scheduling and sleep-wake policies, namely round-robin scheduling with\nthreshold-waiting and asymmetric scheduling with zero-waiting, are introduced\nand analyzed.", "published": "2025-04-07 17:52:52", "link": "http://arxiv.org/abs/2504.05371v1", "categories": ["cs.IT", "cs.NI", "eess.SP", "math.IT"], "primary_category": "cs.IT"}
{"title": "Cellular Network Design for UAV Corridors via Data-driven High-dimensional Bayesian Optimization", "abstract": "We address the challenge of designing cellular networks for uncrewed aerial\nvehicles (UAVs) corridors through a novel data-driven approach. We assess\nmultiple state-of-the-art high-dimensional Bayesian optimization (HD-BO)\ntechniques to jointly optimize the cell antenna tilts and half-power beamwidth\n(HPBW). We find that some of these approaches achieve over 20dB gains in median\nSINR along UAV corridors, with negligible degradation to ground user\nperformance. Furthermore, we explore the HD-BO's capabilities in terms of model\ngeneralization via transfer learning, where data from a previously observed\nscenario source is leveraged to predict the optimal solution for a new scenario\ntarget. We provide examples of scenarios where such transfer learning is\nsuccessful and others where it fails. Moreover, we demonstrate that HD-BO\nenables multi-objective optimization, identifying optimal design trade-offs\nbetween data rates on the ground versus UAV coverage reliability. We observe\nthat aiming to provide UAV coverage across the entire sky can lower the rates\nfor ground users compared to setups specifically optimized for UAV corridors.\nFinally, we validate our approach through a case study in a real-world cellular\nnetwork, where HD-BO identifies optimal and non-obvious antenna configurations\nthat result in more than double the rates along 3D UAV corridors with\nnegligible ground performance loss.", "published": "2025-04-07 15:20:14", "link": "http://arxiv.org/abs/2504.05176v1", "categories": ["cs.IT", "cs.NI", "eess.SP", "math.IT"], "primary_category": "cs.IT"}
{"title": "Using AI to Help in the Semantic Lexical Database to Evaluate Ideas", "abstract": "Inside a challenge of ideas there are several phases in a Creative Support\nSystem (CSS), they are problem analysis, ideation, evaluation, and\nimplementation. Our problem: we need a full semantic lexical database SLD in an\noral (voice) and writing way to help stakeholders to create ideas, these ideas\ncontain nouns, verbs, adverbs, adjectives in the English, Spanish, and French\nlanguages. We utilize a Cloud Service Provider to use a service of Artificial\nIntelligence (AI), also we prepare nouns, verbs, adjectives and adverbs files\nin order to create the service text to voice and create our SLD with voice.\nThis paper presents, first, an introduction about some contests that use a\nsemantic lexical database in different languages; second, a SLD management\napproach using analysis of texts; third, a management application approach to\ncomplete all the new elements; fourth, the results of the management\napplication approach, finally the conclusions and future work.", "published": "2025-04-07 11:54:06", "link": "http://arxiv.org/abs/2504.04967v1", "categories": ["cs.IT", "math.IT"], "primary_category": "cs.IT"}
{"title": "Feature Importance-Aware Deep Joint Source-Channel Coding for Computationally Efficient and Adjustable Image Transmission", "abstract": "Recent advancements in deep learning-based joint source-channel coding\n(deepJSCC) have significantly improved communication performance, but their\nhigh computational demands restrict practical deployment. Furthermore, some\napplications require the adaptive adjustment of computational complexity. To\naddress these challenges, we propose a computationally efficient and adjustable\ndeepJSCC model for image transmission, which we call feature importance-aware\ndeepJSCC (FAJSCC). Unlike existing deepJSCC models that equally process all\nneural features of images, FAJSCC first classifies features into important and\nless important features and then processes them differently. Specifically,\ncomputationally-intensive self-attention is applied to the important features\nand computationally-efficient spatial attention to the less important ones. The\nfeature classification is based on the available computational budget and\nimportance scores predicted by an importance predictor, which estimates each\nfeature's contribution to performance. It also allows independent adjustment of\nencoder and decoder complexity within a single trained model. With these\nproperties, our FAJSCC is the first deepJSCC that is computationally efficient\nand adjustable while maintaining high performance. Experiments demonstrate that\nour FAJSCC achieves higher image transmission performance across various\nchannel conditions while using less computational complexity than the recent\nstate-of-the-art models. Adding to this, by separately varying the\ncomputational resources of the encoder and decoder, it is concluded that the\ndecoder's error correction function requires the largest computational\ncomplexity in FAJSCC, which is the first observation in deepJSCC literature.\nThe FAJSCC code is publicly available at\nhttps://github.com/hansung-choi/FAJSCC.", "published": "2025-04-07 06:11:39", "link": "http://arxiv.org/abs/2504.04758v1", "categories": ["cs.IT", "math.IT"], "primary_category": "cs.IT"}
{"title": "Grant-Free Random Access in Uplink LEO Satellite Communications with OFDM", "abstract": "This paper investigates joint device activity detection and channel\nestimation for grant-free random access in Low-earth orbit (LEO) satellite\ncommunications. We consider uplink communications from multiple single-antenna\nterrestrial users to a LEO satellite equipped with a uniform planar array of\nmultiple antennas, where orthogonal frequency division multiplexing (OFDM)\nmodulation is adopted. To combat the severe Doppler shift, a transmission\nscheme is proposed, where the discrete prolate spheroidal basis expansion model\n(DPS-BEM) is introduced to reduce the number of unknown channel parameters.\nThen the vector approximate message passing (VAMP) algorithm is employed to\napproximate the minimum mean square error estimation of the channel, and the\nMarkov random field is combined to capture the channel sparsity. Meanwhile, the\nexpectation-maximization (EM) approach is integrated to learn the\nhyperparameters in priors. Finally, active devices are detected by calculating\nenergy of the estimated channel. Simulation results demonstrate that the\nproposed method outperforms conventional algorithms in terms of activity error\nrate and channel estimation precision.", "published": "2025-04-07 02:35:46", "link": "http://arxiv.org/abs/2504.04686v2", "categories": ["cs.IT", "eess.SP", "math.IT"], "primary_category": "cs.IT"}
{"title": "A Replica for our Democracies? On Using Digital Twins to Enhance Deliberative Democracy", "abstract": "Deliberative democracy depends on carefully designed institutional\nframeworks, such as participant selection, facilitation methods, and\ndecision-making mechanisms, that shape how deliberation occurs. However,\ndetermining which institutional design best suits a given context often proves\ndifficult when relying solely on real-world observations or laboratory\nexperiments, which can be resource intensive and hard to replicate. To address\nthese challenges, this paper explores Digital Twin (DT) technology as a\nregulatory sandbox for deliberative democracy. DTs enable researchers and\npolicymakers to run \"what if\" scenarios on varied deliberative designs in a\ncontrolled virtual environment by creating dynamic, computer based models that\nmirror real or synthetic data. This makes systematic analysis of the\ninstitutional design possible without the practical constraints of real world\nor lab-based settings. The paper also discusses the limitations of this\napproach and outlines key considerations for future research.", "published": "2025-04-07 23:14:41", "link": "http://arxiv.org/abs/2504.07138v1", "categories": ["cs.MA", "cs.CY", "cs.ET"], "primary_category": "cs.MA"}
{"title": "Attention-Augmented Inverse Reinforcement Learning with Graph Convolutions for Multi-Agent Task Allocation", "abstract": "This work has been submitted to the IEEE for possible publication. Copyright\nmay be transferred without notice, after which this version may no longer be\naccessible.\n  Multi-agent task allocation (MATA) plays a vital role in cooperative\nmulti-agent systems, with significant implications for applications such as\nlogistics, search and rescue, and robotic coordination. Although traditional\ndeep reinforcement learning (DRL) methods have been shown to be promising,\ntheir effectiveness is hindered by a reliance on manually designed reward\nfunctions and inefficiencies in dynamic environments. In this paper, an inverse\nreinforcement learning (IRL)-based framework is proposed, in which multi-head\nself-attention (MHSA) and graph attention mechanisms are incorporated to\nenhance reward function learning and task execution efficiency. Expert\ndemonstrations are utilized to infer optimal reward densities, allowing\ndependence on handcrafted designs to be reduced and adaptability to be\nimproved. Extensive experiments validate the superiority of the proposed method\nover widely used multi-agent reinforcement learning (MARL) algorithms in terms\nof both cumulative rewards and task execution efficiency.", "published": "2025-04-07 13:14:45", "link": "http://arxiv.org/abs/2504.05045v3", "categories": ["cs.LG", "cs.MA"], "primary_category": "cs.LG"}
{"title": "Joint Pedestrian and Vehicle Traffic Optimization in Urban Environments using Reinforcement Learning", "abstract": "Reinforcement learning (RL) holds significant promise for adaptive traffic\nsignal control. While existing RL-based methods demonstrate effectiveness in\nreducing vehicular congestion, their predominant focus on vehicle-centric\noptimization leaves pedestrian mobility needs and safety challenges\nunaddressed. In this paper, we present a deep RL framework for adaptive control\nof eight traffic signals along a real-world urban corridor, jointly optimizing\nboth pedestrian and vehicular efficiency. Our single-agent policy is trained\nusing real-world pedestrian and vehicle demand data derived from Wi-Fi logs and\nvideo analysis. The results demonstrate significant performance improvements\nover traditional fixed-time signals, reducing average wait times per pedestrian\nand per vehicle by up to 67% and 52%, respectively, while simultaneously\ndecreasing total accumulated wait times for both groups by up to 67% and 53%.\nAdditionally, our results demonstrate generalization capabilities across\nvarying traffic demands, including conditions entirely unseen during training,\nvalidating RL's potential for developing transportation systems that serve all\nroad users.", "published": "2025-04-07 12:41:58", "link": "http://arxiv.org/abs/2504.05018v1", "categories": ["cs.LG", "cs.MA"], "primary_category": "cs.LG"}
{"title": "A Nature-Inspired Colony of Artificial Intelligence System with Fast, Detailed, and Organized Learner Agents for Enhancing Diversity and Quality", "abstract": "The concepts of convolutional neural networks (CNNs) and multi-agent systems\nare two important areas of research in artificial intelligence (AI). In this\npaper, we present an approach that builds a CNN-based colony of AI agents to\nserve as a single system and perform multiple tasks (e.g., predictions or\nclassifications) in an environment. The proposed system impersonates the\nnatural environment of a biological system, like an ant colony or a human\ncolony. The proposed colony of AI that is defined as a role-based system\nuniquely contributes to accomplish tasks in an environment by incorporating AI\nagents that are fast learners, detailed learners, and organized learners. These\nlearners can enhance their localized learning and their collective decisions as\na single system of colony of AI agents. This approach also enhances the\ndiversity and quality of the colony of AI with the help of Genetic Algorithms\nand their crossover and mutation mechanisms. The evolution of fast, detailed,\nand organized learners in the colony of AI is achieved by introducing a unique\none-to-one mapping between these learners and the pretrained VGG16, VGG19, and\nResNet50 models, respectively. This role-based approach creates two parent-AI\nagents using the AI models through the processes, called the intra- and\ninter-marriage of AI, so that they can share their learned knowledge (weights\nand biases) based on a probabilistic rule and produce diversified child-AI\nagents to perform new tasks. This process will form a colony of AI that\nconsists of families of multi-model and mixture-model AI agents to improve\ndiversity and quality. Simulations show that the colony of AI, built using the\nVGG16, VGG19, and ResNet50 models, can provide a single system that generates\nchild-AI agents of excellent predictive performance, ranging between 82% and\n95% of F1-scores, to make diversified collective and quality decisions on a\ntask.", "published": "2025-04-07 12:13:14", "link": "http://arxiv.org/abs/2504.05365v1", "categories": ["cs.NE", "cs.AI", "cs.CV", "cs.LG", "cs.MA"], "primary_category": "cs.NE"}
{"title": "Debate-Feedback: A Multi-Agent Framework for Efficient Legal Judgment Prediction", "abstract": "The use of AI in legal analysis and prediction (LegalAI) has gained\nwidespread attention, with past research focusing on retrieval-based methods\nand fine-tuning large models. However, these approaches often require large\ndatasets and underutilize the capabilities of modern large language models\n(LLMs). In this paper, inspired by the debate phase of real courtroom trials,\nwe propose a novel legal judgment prediction model based on the Debate-Feedback\narchitecture, which integrates LLM multi-agent debate and reliability\nevaluation models. Unlike traditional methods, our model achieves significant\nimprovements in efficiency by minimizing the need for large historical\ndatasets, thus offering a lightweight yet robust solution. Comparative\nexperiments show that it outperforms several general-purpose and\ndomain-specific legal models, offering a dynamic reasoning process and a\npromising direction for future LegalAI research.", "published": "2025-04-07 09:34:14", "link": "http://arxiv.org/abs/2504.05358v1", "categories": ["cs.MA", "cs.AI"], "primary_category": "cs.MA"}
{"title": "Simulating Persuasive Dialogues on Meat Reduction with Generative Agents", "abstract": "Meat reduction benefits human and planetary health, but social norms keep\nmeat central in shared meals. To date, the development of communication\nstrategies that promote meat reduction while minimizing social costs has\nrequired the costly involvement of human participants at each stage of the\nprocess. We present work in progress on simulating multi-round dialogues on\nmeat reduction between Generative Agents based on large language models (LLMs).\nWe measure our main outcome using established psychological questionnaires\nbased on the Theory of Planned Behavior and additionally investigate Social\nCosts. We find evidence that our preliminary simulations produce outcomes that\nare (i) consistent with theoretical expectations; and (ii) valid when compared\nto data from previous studies with human participants. Generative agent-based\nmodels are a promising tool for identifying novel communication strategies on\nmeat reduction-tailored to highly specific participant groups-to then be tested\nin subsequent studies with human participants.", "published": "2025-04-07 09:27:37", "link": "http://arxiv.org/abs/2504.04872v1", "categories": ["cs.CY", "cs.HC", "cs.MA"], "primary_category": "cs.CY"}
{"title": "Large-Scale Mixed-Traffic and Intersection Control using Multi-agent Reinforcement Learning", "abstract": "Traffic congestion remains a significant challenge in modern urban networks.\nAutonomous driving technologies have emerged as a potential solution. Among\ntraffic control methods, reinforcement learning has shown superior performance\nover traffic signals in various scenarios. However, prior research has largely\nfocused on small-scale networks or isolated intersections, leaving large-scale\nmixed traffic control largely unexplored. This study presents the first attempt\nto use decentralized multi-agent reinforcement learning for large-scale mixed\ntraffic control in which some intersections are managed by traffic signals and\nothers by robot vehicles. Evaluating a real-world network in Colorado Springs,\nCO, USA with 14 intersections, we measure traffic efficiency via average\nwaiting time of vehicles at intersections and the number of vehicles reaching\ntheir destinations within a time window (i.e., throughput). At 80% RV\npenetration rate, our method reduces waiting time from 6.17 s to 5.09 s and\nincreases throughput from 454 vehicles per 500 seconds to 493 vehicles per 500\nseconds, outperforming the baseline of fully signalized intersections. These\nfindings suggest that integrating reinforcement learning-based control\nlarge-scale traffic can improve overall efficiency and may inform future urban\nplanning strategies.", "published": "2025-04-07 02:52:39", "link": "http://arxiv.org/abs/2504.04691v1", "categories": ["cs.LG", "cs.MA"], "primary_category": "cs.LG"}
{"title": "Autono: A ReAct-Based Highly Robust Autonomous Agent Framework", "abstract": "This paper proposes a highly robust autonomous agent framework based on the\nReAct paradigm, designed to solve complex tasks through adaptive decision\nmaking and multi-agent collaboration. Unlike traditional frameworks that rely\non fixed workflows generated by LLM-based planners, this framework dynamically\ngenerates next actions during agent execution based on prior trajectories,\nthereby enhancing its robustness. To address potential termination issues\ncaused by adaptive execution paths, I propose a timely abandonment strategy\nincorporating a probabilistic penalty mechanism. For multi-agent collaboration,\nI introduce a memory transfer mechanism that enables shared and dynamically\nupdated memory among agents. The framework's innovative timely abandonment\nstrategy dynamically adjusts the probability of task abandonment via\nprobabilistic penalties, allowing developers to balance conservative and\nexploratory tendencies in agent execution strategies by tuning hyperparameters.\nThis significantly improves adaptability and task execution efficiency in\ncomplex environments. Additionally, agents can be extended through external\ntool integration, supported by modular design and MCP protocol compatibility,\nwhich enables flexible action space expansion. Through explicit division of\nlabor, the multi-agent collaboration mechanism enables agents to focus on\nspecific task components, thereby significantly improving execution efficiency\nand quality.", "published": "2025-04-07 00:45:10", "link": "http://arxiv.org/abs/2504.04650v2", "categories": ["cs.MA", "cs.HC", "I.2.9; I.2.8; I.2.1"], "primary_category": "cs.MA"}
{"title": "Deep Reinforcement Learning Algorithms for Option Hedging", "abstract": "Dynamic hedging is a financial strategy that consists in periodically\ntransacting one or multiple financial assets to offset the risk associated with\na correlated liability. Deep Reinforcement Learning (DRL) algorithms have been\nused to find optimal solutions to dynamic hedging problems by framing them as\nsequential decision-making problems. However, most previous work assesses the\nperformance of only one or two DRL algorithms, making an objective comparison\nacross algorithms difficult. In this paper, we compare the performance of eight\nDRL algorithms in the context of dynamic hedging; Monte Carlo Policy Gradient\n(MCPG), Proximal Policy Optimization (PPO), along with four variants of Deep\nQ-Learning (DQL) and two variants of Deep Deterministic Policy Gradient (DDPG).\nTwo of these variants represent a novel application to the task of dynamic\nhedging. In our experiments, we use the Black-Scholes delta hedge as a baseline\nand simulate the dataset using a GJR-GARCH(1,1) model. Results show that MCPG,\nfollowed by PPO, obtain the best performance in terms of the root\nsemi-quadratic penalty. Moreover, MCPG is the only algorithm to outperform the\nBlack-Scholes delta hedge baseline with the allotted computational budget,\npossibly due to the sparsity of rewards in our environment.", "published": "2025-04-07 21:32:14", "link": "http://arxiv.org/abs/2504.05521v2", "categories": ["q-fin.CP", "cs.AI", "cs.CE"], "primary_category": "q-fin.CP"}
{"title": "Error bound for the asymptotic expansion of the Hartman-Watson integral", "abstract": "This note gives a bound on the error of the leading term of the $t\\to 0$\nasymptotic expansion of the Hartman-Watson distribution $\\theta(r,t)$ in the\nregime $rt=\\rho$ constant. The leading order term has the form\n$\\theta(\\rho/t,t)=\\frac{1}{2\\pi t}e^{-\\frac{1}{t} (F(\\rho)-\\pi^2/2)} G(\\rho) (1\n+ \\vartheta(t,\\rho))$, where the error term is bounded uniformly over $\\rho$ as\n$|\\vartheta(t,\\rho)|\\leq \\frac{1}{70}t$.", "published": "2025-04-07 12:18:19", "link": "http://arxiv.org/abs/2504.04992v1", "categories": ["math.CA", "q-fin.CP"], "primary_category": "math.CA"}
{"title": "Exploring Local Interpretable Model-Agnostic Explanations for Speech Emotion Recognition with Distribution-Shift", "abstract": "We introduce EmoLIME, a version of local interpretable model-agnostic\nexplanations (LIME) for black-box Speech Emotion Recognition (SER) models. To\nthe best of our knowledge, this is the first attempt to apply LIME in SER.\nEmoLIME generates high-level interpretable explanations and identifies which\nspecific frequency ranges are most influential in determining emotional states.\nThe approach aids in interpreting complex, high-dimensional embeddings such as\nthose generated by end-to-end speech models. We evaluate EmoLIME,\nqualitatively, quantitatively, and statistically, across three emotional speech\ndatasets, using classifiers trained on both hand-crafted acoustic features and\nWav2Vec 2.0 embeddings. We find that EmoLIME exhibits stronger robustness\nacross different models than across datasets with distribution shifts,\nhighlighting its potential for more consistent explanations in SER tasks within\na dataset.", "published": "2025-04-07 17:38:21", "link": "http://arxiv.org/abs/2504.05368v1", "categories": ["cs.SD", "eess.AS"], "primary_category": "cs.SD"}
{"title": "Leveraging Label Potential for Enhanced Multimodal Emotion Recognition", "abstract": "Multimodal emotion recognition (MER) seeks to integrate various modalities to\npredict emotional states accurately. However, most current research focuses\nsolely on the fusion of audio and text features, overlooking the valuable\ninformation in emotion labels. This oversight could potentially hinder the\nperformance of existing methods, as emotion labels harbor rich, insightful\ninformation that could significantly aid MER. We introduce a novel model called\nLabel Signal-Guided Multimodal Emotion Recognition (LSGMER) to overcome this\nlimitation. This model aims to fully harness the power of emotion label\ninformation to boost the classification accuracy and stability of MER.\nSpecifically, LSGMER employs a Label Signal Enhancement module that optimizes\nthe representation of modality features by interacting with audio and text\nfeatures through label embeddings, enabling it to capture the nuances of\nemotions precisely. Furthermore, we propose a Joint Objective Optimization(JOO)\napproach to enhance classification accuracy by introducing the\nAttribution-Prediction Consistency Constraint (APC), which strengthens the\nalignment between fused features and emotion categories. Extensive experiments\nconducted on the IEMOCAP and MELD datasets have demonstrated the effectiveness\nof our proposed LSGMER model.", "published": "2025-04-07 15:00:34", "link": "http://arxiv.org/abs/2504.05158v1", "categories": ["cs.SD", "cs.AI", "eess.AS"], "primary_category": "cs.SD"}
{"title": "Deconstructing Jazz Piano Style Using Machine Learning", "abstract": "Artistic style has been studied for centuries, and recent advances in machine\nlearning create new possibilities for understanding it computationally.\nHowever, ensuring that machine-learning models produce insights aligned with\nthe interests of practitioners and critics remains a significant challenge.\nHere, we focus on musical style, which benefits from a rich theoretical and\nmathematical analysis tradition. We train a variety of supervised-learning\nmodels to identify 20 iconic jazz musicians across a carefully curated dataset\nof 84 hours of recordings, and interpret their decision-making processes. Our\nmodels include a novel multi-input architecture that enables four musical\ndomains (melody, harmony, rhythm, and dynamics) to be analysed separately.\nThese models enable us to address fundamental questions in music theory and\nalso advance the state-of-the-art in music performer identification (94%\naccuracy across 20 classes). We release open-source implementations of our\nmodels and an accompanying web application for exploring musical styles.", "published": "2025-04-07 12:37:39", "link": "http://arxiv.org/abs/2504.05009v1", "categories": ["cs.SD", "cs.IR", "cs.LG", "eess.AS"], "primary_category": "cs.SD"}
{"title": "Unsupervised Estimation of Nonlinear Audio Effects: Comparing Diffusion-Based and Adversarial approaches", "abstract": "Accurately estimating nonlinear audio effects without access to paired\ninput-output signals remains a challenging problem.This work studies\nunsupervised probabilistic approaches for solving this task. We introduce a\nmethod, novel for this application, based on diffusion generative models for\nblind system identification, enabling the estimation of unknown nonlinear\neffects using black- and gray-box models. This study compares this method with\na previously proposed adversarial approach, analyzing the performance of both\nmethods under different parameterizations of the effect operator and varying\nlengths of available effected recordings.Through experiments on guitar\ndistortion effects, we show that the diffusion-based approach provides more\nstable results and is less sensitive to data availability, while the\nadversarial approach is superior at estimating more pronounced distortion\neffects. Our findings contribute to the robust unsupervised blind estimation of\naudio effects, demonstrating the potential of diffusion models for system\nidentification in music technology.", "published": "2025-04-07 05:56:51", "link": "http://arxiv.org/abs/2504.04751v1", "categories": ["eess.AS", "cs.AI"], "primary_category": "eess.AS"}
{"title": "Bridging the Gap between Continuous and Informative Discrete Representations by Random Product Quantization", "abstract": "Self-supervised learning has become a core technique in speech processing,\nbut the high dimensionality of its representations makes discretization\nessential for improving efficiency. However, existing discretization methods\nstill suffer from significant information loss, resulting in a notable\nperformance gap compared to continuous representations. To overcome these\nlimitations, we propose two quantization-based discretization methods: Product\nQuantization (PQ) and Random Product Quantization (RPQ). PQ partitions the\noriginal feature space into multiple subspaces and independently quantizes each\nsub-vector, producing a fused set of discrete units that retain diverse\ninformation from different subspaces, thus mitigating the loss associated with\nsingle-cluster quantization. RPQ further enhances representation diversity by\nrandomly sampling a fixed proportion of feature dimensions multiple times to\nconstruct sub-vectors, thereby better capturing the variability in the data\ndistribution. Theoretical analysis shows that RPQ reduces the correlation\ncoefficient rho (where 0 <= rho <= 1) between sub-quantizers. Its quantization\nerror is lower-bounded by the product of rho and epsilon-kms, where epsilon-kms\ndenotes the quantization error of a single K-means quantizer. Experimental\nresults on a combined dataset built from LibriSpeech and ML-SUPERB show that PQ\nand RPQ outperform standard K-means discretization, achieving relative\nimprovements of 21.8 percent and 20.0 percent in WER on LibriSpeech, and 24.1\npercent and 19.6 percent in CER on ML-SUPERB, respectively. Moreover, their\nperformance is competitive with, and in some cases even surpasses, that of\ncontinuous SSL representations.", "published": "2025-04-07 04:18:11", "link": "http://arxiv.org/abs/2504.04721v1", "categories": ["eess.AS"], "primary_category": "eess.AS"}
