{"title": "Local Constant Approximation for Dominating Set on Graphs Excluding Large Minors", "abstract": "We show that graphs excluding $K_{2,t}$ as a minor admit a $f(t)$-round\n$50$-approximation deterministic distributed algorithm for Minimum Dominating\nSet. The result extends to Minimum Vertex Cover. Though fast and approximate\ndistributed algorithms for such problems were already known for $H$-minor-free\ngraphs, all of them have an approximation ratio depending on the size of $H$.\nTo the best of our knowledge, this is the first example of a large non-trivial\nexcluded minor leading to fast and constant-approximation distributed\nalgorithms, where the ratio is independent of the size of $H$. A new key\ningredient in the analysis of these distributed algorithms is the use of\nasymptotic dimension.", "published": "2025-04-01 18:08:38", "link": "http://arxiv.org/abs/2504.01091v2", "categories": ["cs.DC", "cs.DM"], "primary_category": "cs.DC"}
{"title": "Causal Models for Growing Networks", "abstract": "Real-world networks grow over time; statistical models based on node\nexchangeability are not appropriate. Instead of constraining the structure of\nthe \\textit{distribution} of edges, we propose that the relevant symmetries\nrefer to the \\textit{causal structure} between them. We first enumerate the 96\ncausal directed acyclic graph (DAG) models over pairs of nodes (dyad variables)\nin a growing network with finite ancestral sets that are invariant to node\ndeletion. We then partition them into 21 classes with ancestral sets that are\nclosed under node marginalization. Several of these classes are remarkably\namenable to distributed and asynchronous evaluation. As an example, we\nhighlight a simple model that exhibits flexible power-law degree distributions\nand emergent phase transitions in sparsity, which we characterize analytically.\nWith few parameters and much conditional independence, our proposed framework\nprovides natural baseline models for causal inference in relational data.", "published": "2025-04-01 17:52:24", "link": "http://arxiv.org/abs/2504.01012v1", "categories": ["cs.SI", "cs.DM", "math.CO", "math.ST", "stat.ML", "stat.TH"], "primary_category": "cs.SI"}
{"title": "Strongly sublinear separators and bounded asymptotic dimension for sphere intersection graphs", "abstract": "In this paper, we consider the class $\\mathcal{C}^d$ of sphere intersection\ngraphs in $\\mathbb{R}^d$ for $d \\geq 2$. We show that for each integer $t$, the\nclass of all graphs in $\\mathcal{C}^d$ that exclude $K_{t,t}$ as a subgraph has\nstrongly sublinear separators. We also prove that $\\mathcal{C}^d$ has\nasymptotic dimension at most $2d+2$.", "published": "2025-04-01 16:05:36", "link": "http://arxiv.org/abs/2504.00932v1", "categories": ["math.CO", "cs.CG", "cs.DM", "math.MG"], "primary_category": "math.CO"}
{"title": "A Tutte-type canonical decomposition of 4-connected graphs", "abstract": "We provide a unique decomposition of every 4-connected graph into parts that\nare either quasi-5-connected, cycles of triangle-torsos and 3-connected torsos\non $\\leq 5$ vertices, generalised double-wheels, or thickened $K_{4,m}$'s. The\ndecomposition can be described in terms of a tree-decomposition but with edges\nallowed in the adhesion-sets. Our construction is explicit, canonical, and\nexhibits a defining property of the Tutte-decomposition.\n  As a corollary, we obtain a new Tutte-type canonical decomposition of\n3-connected graphs into parts that are either quasi-4-connected, generalised\nwheels or thickened $K_{3,m}$'s. This decomposition is similar yet different\nfrom the tri-separation decomposition.\n  As an application of the decomposition for 4-connectivity, we obtain a new\ntheorem characterising all 4-connected vertex-transitive finite graphs as\nquasi-5-connected, the $K_4$-expansion of a quasi-5-connected graph, or on a\nshort explicit list of graphs.", "published": "2025-04-01 13:10:53", "link": "http://arxiv.org/abs/2504.00760v1", "categories": ["math.CO", "cs.DM", "05C40 (Primary) 05C75, 05C83, 05E18 (Secondary)"], "primary_category": "math.CO"}
{"title": "An Agent-based Model Simulation Approach to Demonstrate Effects of Aging Population and Social Service Policies on Pensions Fund and Its Long-term Socio-economic Consequences", "abstract": "Agent-based modeling (ABM) has emerged as a powerful tool in social\npolicy-making and socio-economics, offering a flexible and dynamic approach to\nunderstanding and simulating complex systems. While traditional analytic\nmethods may be less effective in unpredictable situations, ABM can provide\nvaluable support for policy-making by generating large ensembles of scenarios\nand evaluating adaptive policies. This approach has been applied in various\nfields, including economics, management, sociology, and politics, and has the\npotential to deepen our understanding of economic policy in the cooperative\nsector.", "published": "2025-04-01 23:14:29", "link": "http://arxiv.org/abs/2504.01242v1", "categories": ["cs.MA", "93A16, 92D25, 92D25 93A16", "I.6"], "primary_category": "cs.MA"}
{"title": "First Field-Trial Demonstration of L4 Autonomous Optical Network for Distributed AI Training Communication: An LLM-Powered Multi-AI-Agent Solution", "abstract": "We demonstrate the first cross-domain cross-layer level-4 autonomous optical\nnetwork via a multi-AI-agent system. Field trials show 98 percent task\ncompletion rate across the distributed AI training lifecycle-3.2x higher than\nsingle agents using state-of-the-art LLMs.", "published": "2025-04-01 22:48:22", "link": "http://arxiv.org/abs/2504.01234v1", "categories": ["cs.MA", "physics.optics"], "primary_category": "cs.MA"}
{"title": "Remember, but also, Forget: Bridging Myopic and Perfect Recall Fairness with Past-Discounting", "abstract": "Dynamic resource allocation in multi-agent settings often requires balancing\nefficiency with fairness over time--a challenge inadequately addressed by\nconventional, myopic fairness measures. Motivated by behavioral insights that\nhuman judgments of fairness evolve with temporal distance, we introduce a novel\nframework for temporal fairness that incorporates past-discounting mechanisms.\nBy applying a tunable discount factor to historical utilities, our approach\ninterpolates between instantaneous and perfect-recall fairness, thereby\ncapturing both immediate outcomes and long-term equity considerations. Beyond\naligning more closely with human perceptions of fairness, this past-discounting\nmethod ensures that the augmented state space remains bounded, significantly\nimproving computational tractability in sequential decision-making settings. We\ndetail the formulation of discounted-recall fairness in both additive and\naveraged utility contexts, illustrate its benefits through practical examples,\nand discuss its implications for designing balanced, scalable resource\nallocation strategies.", "published": "2025-04-01 19:42:17", "link": "http://arxiv.org/abs/2504.01154v1", "categories": ["cs.AI", "cs.GT", "cs.MA"], "primary_category": "cs.AI"}
{"title": "An Investigation into the Causal Mechanism of Political Opinion Dynamics: A Model of Hierarchical Coarse-Graining with Community-Bounded Social Influence", "abstract": "The increasing polarization in democratic societies is an emergent outcome of\npolitical opinion dynamics. Yet, the fundamental mechanisms behind the\nformation of political opinions, from individual beliefs to collective\nconsensus, remain unknown. Understanding that a causal mechanism must account\nfor both bottom-up and top-down influences, we conceptualize political opinion\ndynamics as hierarchical coarse-graining, where microscale opinions integrate\ninto a macro-scale state variable. Using the CODA (Continuous Opinions Discrete\nActions) model, we simulate Bayesian opinion updating, social identity-based\ninformation integration, and migration between social identity groups to\nrepresent higher-level connectivity. This results in coarse-graining across\nmicro, meso, and macro levels. Our findings show that higher-level connectivity\nshapes information integration, yielding three regimes: independent\n(disconnected, local convergence), parallel (fast, global convergence), and\niterative (slow, stepwise convergence). In the iterative regime, low\nconnectivity fosters transient diversity, indicating an informed consensus. In\nall regimes, time-scale separation leads to downward causation, where agents\nconverge on the aggregate majority choice, driving consensus. Critically, any\ndegree of coherent higher-level information integration can overcome\nmisalignment via global downward causation. The results highlight how emergent\nproperties of the causal mechanism, such as downward causation, are essential\nfor consensus and may inform more precise investigations into polarized\npolitical discourse.", "published": "2025-04-01 15:07:13", "link": "http://arxiv.org/abs/2504.00877v2", "categories": ["cs.SI", "cs.MA"], "primary_category": "cs.SI"}
{"title": "Provably Stable Multi-Agent Routing with Bounded-Delay Adversaries in the Decision Loop", "abstract": "In this work, we are interested in studying multi-agent routing settings,\nwhere adversarial agents are part of the assignment and decision loop,\ndegrading the performance of the fleet by incurring bounded delays while\nservicing pickup-and-delivery requests. Specifically, we are interested in\ncharacterizing conditions on the fleet size and the proportion of adversarial\nagents for which a routing policy remains stable, where stability for a routing\npolicy is achieved if the number of outstanding requests is uniformly bounded\nover time. To obtain this characterization, we first establish a threshold on\nthe proportion of adversarial agents above which previously stable routing\npolicies for fully cooperative fleets are provably unstable. We then derive a\nsufficient condition on the fleet size to recover stability given a maximum\nproportion of adversarial agents. We empirically validate our theoretical\nresults on a case study on autonomous taxi routing, where we consider\ntransportation requests from real San Francisco taxicab data.", "published": "2025-04-01 14:52:47", "link": "http://arxiv.org/abs/2504.00863v1", "categories": ["cs.MA", "cs.RO"], "primary_category": "cs.MA"}
{"title": "Personality-Driven Decision-Making in LLM-Based Autonomous Agents", "abstract": "The embedding of Large Language Models (LLMs) into autonomous agents is a\nrapidly developing field which enables dynamic, configurable behaviours without\nthe need for extensive domain-specific training. In our previous work, we\nintroduced SANDMAN, a Deceptive Agent architecture leveraging the Five-Factor\nOCEAN personality model, demonstrating that personality induction significantly\ninfluences agent task planning. Building on these findings, this study presents\na novel method for measuring and evaluating how induced personality traits\naffect task selection processes - specifically planning, scheduling, and\ndecision-making - in LLM-based agents. Our results reveal distinct\ntask-selection patterns aligned with induced OCEAN attributes, underscoring the\nfeasibility of designing highly plausible Deceptive Agents for proactive cyber\ndefense strategies.", "published": "2025-04-01 12:36:28", "link": "http://arxiv.org/abs/2504.00727v1", "categories": ["cs.AI", "cs.MA", "I.2.11; I.2.0"], "primary_category": "cs.AI"}
{"title": "Simulation of Autonomous Industrial Vehicle Fleet Using Fuzzy Agents: Application to Task Allocation and Battery Charge Management", "abstract": "The research introduces a multi-agent simulation that uses fuzzy inference to\ninvestigate the work distribution and battery charging control of mobile\nbaggage conveyor robots in an airport in a comprehensive manner. Thanks to a\ndistributed system, this simulation approach provides high adaptability,\nadjusting to changes in conveyor agent availability, battery capacity,\nawareness of the activities of the conveyor fleet, and knowledge of the context\nof infrastructure resource availability. Dynamic factors, such as workload\nvariations and communication between the conveyor agents and infrastructure are\nconsidered as heuristics, highlighting the importance of flexible and\ncollaborative approaches in autonomous systems. The results highlight the\neffectiveness of adaptive fuzzy multi-agent models to optimize dynamic task\nallocation, adapt to the variation of baggage arrival flows, improve the\noverall operational efficiency of conveyor agents, and reduce their energy\nconsumption.", "published": "2025-04-01 11:52:44", "link": "http://arxiv.org/abs/2504.00683v1", "categories": ["cs.MA"], "primary_category": "cs.MA"}
{"title": "Asynchronous Multi-Agent Systems with Petri nets", "abstract": "Modeling the interaction between components is crucial for many applications\nand serves as a fundamental step in analyzing and verifying properties in\nmulti-agent systems. In this paper, we propose a method based on 1-safe Petri\nnets to model Asynchronous Multi-Agent Systems (AMAS), starting from two\nsemantics defined on AMAS represented as transition systems. Specifically, we\nfocus on two types of synchronization: synchronization on transitions and\nsynchronization on data. For both, we define an operator that composes 1-safe\nPetri nets and demonstrate the relationships between the composed Petri net and\nthe global transition systems as defined in theliterature. Additionally, we\nanalyze the relationships between the two semantics on Petri nets, proposing\ntwo constructions that enable switching between them. These transformations are\nparticularly useful for system analysis, as they allow the selection of the\nmost suitable model based on the property that needs to be verified.", "published": "2025-04-01 10:02:19", "link": "http://arxiv.org/abs/2504.00602v1", "categories": ["cs.MA"], "primary_category": "cs.MA"}
{"title": "AgentNet: Decentralized Evolutionary Coordination for LLM-based Multi-Agent Systems", "abstract": "The rapid advancement of Large Language Models (LLMs) has catalyzed the\ndevelopment of multi-agent systems, where multiple LLM-based agents collaborate\nto solve complex tasks. However, existing systems predominantly rely on\ncentralized coordination, which introduces scalability bottlenecks, limits\nadaptability, and creates single points of failure. Additionally, concerns over\nprivacy and proprietary knowledge sharing hinder cross-organizational\ncollaboration, leading to siloed expertise. To address these challenges, we\npropose AgentNet, a decentralized, Retrieval-Augmented Generation (RAG)-based\nframework that enables LLM-based agents to autonomously evolve their\ncapabilities and collaborate efficiently in a Directed Acyclic Graph\n(DAG)-structured network. Unlike traditional multi-agent systems that depend on\nstatic role assignments or centralized control, AgentNet allows agents to\nspecialize dynamically, adjust their connectivity, and route tasks without\nrelying on predefined workflows. AgentNet's core design is built upon several\nkey innovations: (1) Fully Decentralized Paradigm: Removing the central\norchestrator, allowing agents to coordinate and specialize autonomously,\nfostering fault tolerance and emergent collective intelligence. (2) Dynamically\nEvolving Graph Topology: Real-time adaptation of agent connections based on\ntask demands, ensuring scalability and resilience.(3) Adaptive Learning for\nExpertise Refinement: A retrieval-based memory system that enables agents to\ncontinuously update and refine their specialized skills. By eliminating\ncentralized control, AgentNet enhances fault tolerance, promotes scalable\nspecialization, and enables privacy-preserving collaboration across\norganizations. Through decentralized coordination and minimal data exchange,\nagents can leverage diverse knowledge sources while safeguarding sensitive\ninformation.", "published": "2025-04-01 09:45:25", "link": "http://arxiv.org/abs/2504.00587v1", "categories": ["cs.MA", "cs.CL"], "primary_category": "cs.MA"}
{"title": "Agentic Multimodal AI for Hyperpersonalized B2B and B2C Advertising in Competitive Markets: An AI-Driven Competitive Advertising Framework", "abstract": "The growing use of foundation models (FMs) in real-world applications demands\nadaptive, reliable, and efficient strategies for dynamic markets. In the\nchemical industry, AI-discovered materials drive innovation, but commercial\nsuccess hinges on market adoption, requiring FM-driven advertising frameworks\nthat operate in-the-wild. We present a multilingual, multimodal AI framework\nfor autonomous, hyper-personalized advertising in B2B and B2C markets. By\nintegrating retrieval-augmented generation (RAG), multimodal reasoning, and\nadaptive persona-based targeting, our system generates culturally relevant,\nmarket-aware ads tailored to shifting consumer behaviors and competition.\nValidation combines real-world product experiments with a Simulated Humanistic\nColony of Agents to model consumer personas, optimize strategies at scale, and\nensure privacy compliance. Synthetic experiments mirror real-world scenarios,\nenabling cost-effective testing of ad strategies without risky A/B tests.\nCombining structured retrieval-augmented reasoning with in-context learning\n(ICL), the framework boosts engagement, prevents market cannibalization, and\nmaximizes ROAS. This work bridges AI-driven innovation and market adoption,\nadvancing multimodal FM deployment for high-stakes decision-making in\ncommercial marketing.", "published": "2025-04-01 01:37:02", "link": "http://arxiv.org/abs/2504.00338v1", "categories": ["cs.LG", "cs.AI", "cs.MA", "cs.SI"], "primary_category": "cs.LG"}
{"title": "The effect of latency on optimal order execution policy", "abstract": "Market participants regularly send bid and ask quotes to exchange-operated\nlimit order books. This creates an optimization challenge where their potential\nprofit is determined by their quoted price and how often their orders are\nsuccessfully executed. The expected profit from successful execution at a\nfavorable limit price needs to be balanced against two key risks: (1) the\npossibility that orders will remain unfilled, which hinders the trading agenda\nand leads to greater price uncertainty, and (2) the danger that limit orders\nwill be executed as market orders, particularly in the presence of order\nsubmission latency, which in turn results in higher transaction costs. In this\npaper, we consider a stochastic optimal control problem where a risk-averse\ntrader attempts to maximize profit while balancing risk. The market is modeled\nusing Brownian motion to represent the price uncertainty. We analyze the\nrelationship between fill probability, limit price, and order submission\nlatency. We derive closed-form approximations of these quantities that perform\nwell in the practical regime of interest. Then, we utilize a mean-variance\nmethod where our total reward function features a risk-tolerance parameter to\nquantify the combined risk and profit.", "published": "2025-04-01 14:33:23", "link": "http://arxiv.org/abs/2504.00846v2", "categories": ["q-fin.MF", "math.OC", "91G15 (Primary) 93E20, 60J28 (Secondary)"], "primary_category": "q-fin.MF"}
{"title": "Multilingual and Multi-Accent Jailbreaking of Audio LLMs", "abstract": "Large Audio Language Models (LALMs) have significantly advanced audio\nunderstanding but introduce critical security risks, particularly through audio\njailbreaks. While prior work has focused on English-centric attacks, we expose\na far more severe vulnerability: adversarial multilingual and multi-accent\naudio jailbreaks, where linguistic and acoustic variations dramatically amplify\nattack success. In this paper, we introduce Multi-AudioJail, the first\nsystematic framework to exploit these vulnerabilities through (1) a novel\ndataset of adversarially perturbed multilingual/multi-accent audio jailbreaking\nprompts, and (2) a hierarchical evaluation pipeline revealing that how acoustic\nperturbations (e.g., reverberation, echo, and whisper effects) interacts with\ncross-lingual phonetics to cause jailbreak success rates (JSRs) to surge by up\nto +57.25 percentage points (e.g., reverberated Kenyan-accented attack on\nMERaLiON). Crucially, our work further reveals that multimodal LLMs are\ninherently more vulnerable than unimodal systems: attackers need only exploit\nthe weakest link (e.g., non-English audio inputs) to compromise the entire\nmodel, which we empirically show by multilingual audio-only attacks achieving\n3.1x higher success rates than text-only attacks. We plan to release our\ndataset to spur research into cross-modal defenses, urging the community to\naddress this expanding attack surface in multimodality as LALMs evolve.", "published": "2025-04-01 18:12:23", "link": "http://arxiv.org/abs/2504.01094v1", "categories": ["cs.SD", "cs.AI", "cs.CL", "cs.CR", "eess.AS"], "primary_category": "cs.SD"}
{"title": "$C^2$AV-TSE: Context and Confidence-aware Audio Visual Target Speaker Extraction", "abstract": "Audio-Visual Target Speaker Extraction (AV-TSE) aims to mimic the human\nability to enhance auditory perception using visual cues. Although numerous\nmodels have been proposed recently, most of them estimate target signals by\nprimarily relying on local dependencies within acoustic features,\nunderutilizing the human-like capacity to infer unclear parts of speech through\ncontextual information. This limitation results in not only suboptimal\nperformance but also inconsistent extraction quality across the utterance, with\nsome segments exhibiting poor quality or inadequate suppression of interfering\nspeakers. To close this gap, we propose a model-agnostic strategy called the\nMask-And-Recover (MAR). It integrates both inter- and intra-modality contextual\ncorrelations to enable global inference within extraction modules.\nAdditionally, to better target challenging parts within each sample, we\nintroduce a Fine-grained Confidence Score (FCS) model to assess extraction\nquality and guide extraction modules to emphasize improvement on low-quality\nsegments. To validate the effectiveness of our proposed model-agnostic training\nparadigm, six popular AV-TSE backbones were adopted for evaluation on the\nVoxCeleb2 dataset, demonstrating consistent performance improvements across\nvarious metrics.", "published": "2025-04-01 13:01:30", "link": "http://arxiv.org/abs/2504.00750v1", "categories": ["cs.SD", "cs.LG", "cs.MM", "eess.AS"], "primary_category": "cs.SD"}
{"title": "Expanding and Analyzing ODAQ -- the Open Dataset of Audio Quality", "abstract": "The Open Dataset of Audio Quality (ODAQ) was recently introduced to address\nthe scarcity of openly available audio datasets with corresponding subjective\nquality scores. The dataset, released under permissive licenses, comprises\naudio material processed using six different signal processing methods\noperating at five quality levels, along with corresponding subjective test\nresults. To expand the dataset, we provided listener training to university\nstudents to conduct further subjective tests and obtained results consistent\nwith previous expert listeners. We also showed how different training\napproaches affect the use of absolute scales and anchors. The expanded dataset\nnow comprises results from three international laboratories providing a total\nof 42 listeners and 10080 subjective scores. This paper provides the details of\nthe expansion and an in-depth analysis. As part of this analysis, we initiate\nthe use of ODAQ as a benchmark to evaluate objective audio quality metrics in\ntheir ability to predict subjective scores", "published": "2025-04-01 12:51:12", "link": "http://arxiv.org/abs/2504.00742v1", "categories": ["eess.AS"], "primary_category": "eess.AS"}
{"title": "How Cyclic Acoustic Patterns Influence ASMR Perception: A Signal Processing Perspective", "abstract": "Autonomous Sensory Meridian Response (ASMR) has been remarkably popular in\nthe recent decade. While its effect has been validated through behavioral\nstudies and neuro-physiological measurements such as electroencephalography\n(EEG) and related bio-signal analyses, its development and triggers remain a\nsubject of debate. Previous studies suggest that its triggers are highly linked\nwith cyclic patterns: predictable patterns introduce relaxation while\nvariations maintain intrigue. To validate this and further understand the\nimpact of acoustic features on ASMR effects, we designed three distinct cyclic\npatterns with monophonic and stereophonic variations, while controlling their\npredictability and randomness, and collected ASMR triggering scores through\nonline surveys. Then, we extracted cyclic features and carried out regression\nanalysis, seeking an explainable mapping of cyclic features and ASMR triggers.\nWe found that relaxing effects accumulate progressively and are independent of\nspatial orientation. Cyclic patterns significantly influence psychological and\nphysical effects, which remain invariant with time. Regression analysis\nrevealed that smoothly spread and energy-dense cyclic patterns most effectively\ntrigger ASMR responses.", "published": "2025-04-01 10:18:39", "link": "http://arxiv.org/abs/2504.00621v2", "categories": ["eess.AS"], "primary_category": "eess.AS"}
