{"title": "Slant/Gokigen Naname is NP-complete, and Some Variations are in P", "abstract": "In this paper we show that a generalized version of the Nikoli puzzle Slant\nis NP-complete. We also give polynomial time algorithms for versions of the\npuzzle where some constraints are omitted. These problems correspond to\nsimultaneously satisfying connectivity and vertex degree constraints in a grid\ngraph and its dual.", "published": "2025-02-19 08:41:55", "link": "http://arxiv.org/abs/2502.13536v1", "categories": ["cs.DM", "cs.CG", "cs.DS"], "primary_category": "cs.DM"}
{"title": "Elementary Cellular Automata as Multiplicative Automata", "abstract": "Elementary cellular automata (ECA) are converted into multiplicative versions\nby using permuted n-dim Galois fields and octonion multiplication tables as\nbinary pointers to each rule's Wolfram code truth table. This enables an\nextension of the binary ECA to complex numbers, identity solutions are found,\nproduces a polynomial, and is implemented in Java.", "published": "2025-02-19 01:49:34", "link": "http://arxiv.org/abs/2502.13360v1", "categories": ["nlin.CG", "cs.DM"], "primary_category": "nlin.CG"}
{"title": "Gaining efficiency in deep policy gradient method for continuous-time optimal control problems", "abstract": "In this paper, we propose an efficient implementation of deep policy gradient\nmethod (PGM) for optimal control problems in continuous time. The proposed\nmethod has the ability to manage the allocation of computational resources,\nnumber of trajectories, and complexity of architecture of the neural network.\nThis is, in particular, important for continuous-time problems that require a\nfine time discretization. Each step of this method focuses on a different time\nscale and learns a policy, modeled by a neural network, for a discretized\noptimal control problem. The first step has the coarsest time discretization.\nAs we proceed to other steps, the time discretization becomes finer. The\noptimal trained policy in each step is also used to provide data for the next\nstep. We accompany the multi-scale deep PGM with a theoretical result on\nallocation of computational resources to obtain a targeted efficiency and test\nour methods on the linear-quadratic stochastic optimal control problem.", "published": "2025-02-19 22:56:44", "link": "http://arxiv.org/abs/2502.14141v2", "categories": ["math.OC", "q-fin.CP", "49M25, 90-08"], "primary_category": "math.OC"}
{"title": "The Risk-Neutral Equivalent Pricing of Model-Uncertainty", "abstract": "Existing approaches to asset-pricing under model-uncertainty adapt classical\nutility-maximisation frameworks and seek theoretical comprehensiveness. We move\ntoward practice by considering binary model-uncertainties and by switching\nattention from 'preference' to 'constraints'. Economic asset-pricing in this\nsetting is found to decompose into the viable pricing of model-risk and of\nnon-model risk separately such that the former has a unique and intuitive\nrisk-neutral equivalent formulation with convenient properties. Its parameter,\na dynamically conserved constant of model-risk inference, allows an integrated\nrepresentation of ex-ante risk-pricing and bias, such that their ex-post\nprice-effects can be disentangled, through well-known price anomalies such as\nMomentum and Low-Risk.", "published": "2025-02-19 14:07:37", "link": "http://arxiv.org/abs/2502.13744v3", "categories": ["q-fin.MF", "econ.EM"], "primary_category": "q-fin.MF"}
{"title": "Decentralized Annuity: A Quest for the Holy Grail of Lifetime Financial Security", "abstract": "This paper presents a novel framework for decentralized annuities, aiming to\naddress the limitations of traditional pension systems such as defined\ncontribution (DC) and defined benefit (DB) plans, while providing lifetime\nfinancial support. It sheds light on often ignored pitfalls within current\nretirement schemes and introduces individual rationality properties. The\nresearch delves into various fairness concepts that underpin existing plans,\nemphasizing that decentralized annuities, while meeting similar fairness\ncriteria, offer enhanced flexibility for individual rationality and improved\nsocial welfare for all participants. Using theoretical models and examples, we\ndemonstrate the potential of decentralized annuities to outperform self-managed\nplans (DC) and to produce effects comparable to defined benefit (DB) plans,\nparticularly within larger participant pools. The paper concludes by exploring\nthe managerial implications of decentralized annuities and laying the\ngroundwork for the further advancement of equitable and sustainable\ndecentralized annuity systems.", "published": "2025-02-19 14:06:29", "link": "http://arxiv.org/abs/2502.13742v1", "categories": ["q-fin.MF", "C61, D15, G11, G22"], "primary_category": "q-fin.MF"}
{"title": "Dual Formulation of the Optimal Consumption problem with Multiplicative Habit Formation", "abstract": "This paper provides a dual formulation of the optimal consumption problem\nwith internal multiplicative habit formation. In this problem, the agent\nderives utility from the ratio of consumption to the internal habit component.\nDue to this multiplicative specification of the habit model, the optimal\nconsumption problem is not strictly concave and incorporates irremovable\npath-dependency. As a consequence, standard Lagrangian techniques fail to\nsupply a candidate for the corresponding dual formulation. Using Fenchel's\nDuality Theorem, we manage to identify a candidate formulation and prove that\nit satisfies strong duality. On the basis of this strong duality result, we are\nable to derive duality relations that stipulate how the optimal primal controls\ndepend on the optimal dual controls and vice versa. {Moreover, using the dual\nformulation, we develop an analytical evaluation mechanism to bound the\naccuracy of approximations to the optimal solutions.", "published": "2025-02-19 12:37:26", "link": "http://arxiv.org/abs/2502.13678v1", "categories": ["q-fin.MF"], "primary_category": "q-fin.MF"}
{"title": "Stock Price Prediction Using a Hybrid LSTM-GNN Model: Integrating Time-Series and Graph-Based Analysis", "abstract": "This paper presents a novel hybrid model that integrates long-short-term\nmemory (LSTM) networks and Graph Neural Networks (GNNs) to significantly\nenhance the accuracy of stock market predictions. The LSTM component adeptly\ncaptures temporal patterns in stock price data, effectively modeling the time\nseries dynamics of financial markets. Concurrently, the GNN component leverages\nPearson correlation and association analysis to model inter-stock relational\ndata, capturing complex nonlinear polyadic dependencies influencing stock\nprices. The model is trained and evaluated using an expanding window validation\napproach, enabling continuous learning from increasing amounts of data and\nadaptation to evolving market conditions. Extensive experiments conducted on\nhistorical stock data demonstrate that our hybrid LSTM-GNN model achieves a\nmean square error (MSE) of 0.00144, representing a substantial reduction of\n10.6% compared to the MSE of the standalone LSTM model of 0.00161. Furthermore,\nthe hybrid model outperforms traditional and advanced benchmarks, including\nlinear regression, convolutional neural networks (CNN), and dense networks.\nThese compelling results underscore the significant potential of combining\ntemporal and relational data through a hybrid approach, offering a powerful\ntool for real-time trading and financial analysis.", "published": "2025-02-19 15:09:13", "link": "http://arxiv.org/abs/2502.15813v1", "categories": ["q-fin.ST", "cs.AI", "cs.LG"], "primary_category": "q-fin.ST"}
{"title": "Deep Learning for VWAP Execution in Crypto Markets: Beyond the Volume Curve", "abstract": "Volume-Weighted Average Price (VWAP) is arguably the most prevalent benchmark\nfor trade execution as it provides an unbiased standard for comparing\nperformance across market participants. However, achieving VWAP is inherently\nchallenging due to its dependence on two dynamic factors, volumes and prices.\nTraditional approaches typically focus on forecasting the market's volume\ncurve, an assumption that may hold true under steady conditions but becomes\nsuboptimal in more volatile environments or markets such as cryptocurrency\nwhere prediction error margins are higher. In this study, I propose a deep\nlearning framework that directly optimizes the VWAP execution objective by\nbypassing the intermediate step of volume curve prediction. Leveraging\nautomatic differentiation and custom loss functions, my method calibrates order\nallocation to minimize VWAP slippage, thereby fully addressing the complexities\nof the execution problem. My results demonstrate that this direct optimization\napproach consistently achieves lower VWAP slippage compared to conventional\nmethods, even when utilizing a naive linear model presented in\narXiv:2410.21448. They validate the observation that strategies optimized for\nVWAP performance tend to diverge from accurate volume curve predictions and\nthus underscore the advantage of directly modeling the execution objective.\nThis research contributes a more efficient and robust framework for VWAP\nexecution in volatile markets, illustrating the potential of deep learning in\ncomplex financial systems where direct objective optimization is crucial.\nAlthough my empirical analysis focuses on cryptocurrency markets, the\nunderlying principles of the framework are readily applicable to other asset\nclasses such as equities.", "published": "2025-02-19 13:49:51", "link": "http://arxiv.org/abs/2502.13722v2", "categories": ["q-fin.ST", "cs.LG"], "primary_category": "q-fin.ST"}
