{"title": "Finite Element Method for HJB in Option Pricing with Stock Borrowing Fees", "abstract": "In mathematical finance, many derivatives from markets with frictions can be\nformulated as optimal control problems in the HJB framework. Analytical optimal\ncontrol can result in highly nonlinear PDEs, which might yield unstable\nnumerical results. Accurate and convergent numerical schemes are essential to\nleverage the benefits of the hedging process. In this study, we apply a finite\nelement approach with a non-uniform mesh for the task of option pricing with\nstock borrowing fees, leading to an HJB equation that bypasses analytical\noptimal control in favor of direct PDE discretization. The time integration\nemploys the theta-scheme, with initial modifications following Rannacher`s\nprocedure. A Newton-type algorithm is applied to address the penalty-like term\nat each time step. Numerical experiments are conducted, demonstrating\nconsistency with a benchmark problem and showing a strong match. The CPU time\nneeded to reach the desired results favors P2-FEM over FDM and linear P1-FEM,\nwith P2-FEM displaying superior convergence. This paper presents an efficient\nalternative framework for the HJB problem and contributes to the literature by\nintroducing a finite element method (FEM)-based solution for HJB applications\nin mathematical finance.", "published": "2025-01-04 16:17:34", "link": "http://arxiv.org/abs/2501.02327v1", "categories": ["q-fin.CP"], "primary_category": "q-fin.CP"}
{"title": "On the entropy minimal martingale measure in the exponential Ornstein-Uhlenbeck stochastic volatility model", "abstract": "We consider a stochastic volatility model where the price evolution depend on\nthe exponential of the Ornstein--Uhlenbeck process. After a brief revision of\nthe related theory the entropy-minimal equivalent martingale measure. is\ncalculated.", "published": "2025-01-04 22:37:16", "link": "http://arxiv.org/abs/2501.02396v1", "categories": ["math.PR", "q-fin.MF", "60G44"], "primary_category": "math.PR"}
{"title": "Evaluating the resilience of ESG investments in European Markets during turmoil periods", "abstract": "This study investigates the resilience of Environmental, Social, and\nGovernance (ESG) investments during periods of financial instability, comparing\nthem with traditional equity indices across major European markets-Germany,\nFrance, and Italy. Using daily returns from October 2021 to February 2024, the\nanalysis explores the effects of key global disruptions such as the Covid-19\npandemic and the Russia-Ukraine conflict on market performance. A mixture of\ntwo generalised normal distributions (MGND) and EGARCH-in-mean models are used\nto identify periods of market turmoil and assess volatility dynamics. The\nfindings indicate that during crises, ESG investments present higher volatility\nin Germany and Italy than in France. Despite some regional variations, ESG\nportfolios demonstrate greater resilience compared to traditional ones,\noffering potential risk mitigation during market shocks. These results\nunderscore the importance of integrating ESG factors into long-term investment\nstrategies, particularly in the face of unpredictable financial turmoil.", "published": "2025-01-04 12:19:51", "link": "http://arxiv.org/abs/2501.03269v1", "categories": ["q-fin.ST"], "primary_category": "q-fin.ST"}
