{"title": "AUV-Fusion: Cross-Modal Adversarial Fusion of User Interactions and Visual Perturbations Against VARS", "abstract": "Modern Visual-Aware Recommender Systems (VARS) exploit the integration of\nuser interaction data and visual features to deliver personalized\nrecommendations with high precision. However, their robustness against\nadversarial attacks remains largely underexplored, posing significant risks to\nsystem reliability and security. Existing attack strategies suffer from notable\nlimitations: shilling attacks are costly and detectable, and visual-only\nperturbations often fail to align with user preferences. To address these\nchallenges, we propose AUV-Fusion, a cross-modal adversarial attack framework\nthat adopts high-order user preference modeling and cross-modal adversary\ngeneration. Specifically, we obtain robust user embeddings through multi-hop\nuser-item interactions and transform them via an MLP into semantically aligned\nperturbations. These perturbations are injected onto the latent space of a\npre-trained VAE within the diffusion model. By synergistically integrating\ngenuine user interaction data with visually plausible perturbations, AUV-Fusion\neliminates the need for injecting fake user profiles and effectively mitigates\nthe challenge of insufficient user preference extraction inherent in\ntraditional visual-only attacks. Comprehensive evaluations on diverse VARS\narchitectures and real-world datasets demonstrate that AUV-Fusion significantly\nenhances the exposure of target (cold-start) items compared to conventional\nbaseline methods. Moreover, AUV-Fusion maintains exceptional stealth under\nrigorous scrutiny.", "published": "2025-07-30 17:55:09", "link": "http://arxiv.org/abs/2507.22880v1", "categories": ["cs.IR"], "primary_category": "cs.IR"}
{"title": "RecGPT Technical Report", "abstract": "Recommender systems are among the most impactful applications of artificial\nintelligence, serving as critical infrastructure connecting users, merchants,\nand platforms. However, most current industrial systems remain heavily reliant\non historical co-occurrence patterns and log-fitting objectives, i.e.,\noptimizing for past user interactions without explicitly modeling user intent.\nThis log-fitting approach often leads to overfitting to narrow historical\npreferences, failing to capture users' evolving and latent interests. As a\nresult, it reinforces filter bubbles and long-tail phenomena, ultimately\nharming user experience and threatening the sustainability of the whole\nrecommendation ecosystem.\n  To address these challenges, we rethink the overall design paradigm of\nrecommender systems and propose RecGPT, a next-generation framework that places\nuser intent at the center of the recommendation pipeline. By integrating large\nlanguage models (LLMs) into key stages of user interest mining, item retrieval,\nand explanation generation, RecGPT transforms log-fitting recommendation into\nan intent-centric process. To effectively align general-purpose LLMs to the\nabove domain-specific recommendation tasks at scale, RecGPT incorporates a\nmulti-stage training paradigm, which integrates reasoning-enhanced\npre-alignment and self-training evolution, guided by a Human-LLM cooperative\njudge system. Currently, RecGPT has been fully deployed on the Taobao App.\nOnline experiments demonstrate that RecGPT achieves consistent performance\ngains across stakeholders: users benefit from increased content diversity and\nsatisfaction, merchants and the platform gain greater exposure and conversions.\nThese comprehensive improvement results across all stakeholders validates that\nLLM-driven, intent-centric design can foster a more sustainable and mutually\nbeneficial recommendation ecosystem.", "published": "2025-07-30 17:55:06", "link": "http://arxiv.org/abs/2507.22879v1", "categories": ["cs.IR", "cs.CL"], "primary_category": "cs.IR"}
{"title": "GeoOutageKG: A Multimodal Geospatiotemporal Knowledge Graph for Multiresolution Power Outage Analysis", "abstract": "Detecting, analyzing, and predicting power outages is crucial for grid risk\nassessment and disaster mitigation. Numerous outages occur each year,\nexacerbated by extreme weather events such as hurricanes. Existing outage data\nare typically reported at the county level, limiting their spatial resolution\nand making it difficult to capture localized patterns. However, it offers\nexcellent temporal granularity. In contrast, nighttime light satellite image\ndata provides significantly higher spatial resolution and enables a more\ncomprehensive spatial depiction of outages, enhancing the accuracy of assessing\nthe geographic extent and severity of power loss after disaster events.\nHowever, these satellite data are only available on a daily basis. Integrating\nspatiotemporal visual and time-series data sources into a unified knowledge\nrepresentation can substantially improve power outage detection, analysis, and\npredictive reasoning. In this paper, we propose GeoOutageKG, a multimodal\nknowledge graph that integrates diverse data sources, including nighttime light\nsatellite image data, high-resolution spatiotemporal power outage maps, and\ncounty-level timeseries outage reports in the U.S. We describe our method for\nconstructing GeoOutageKG by aligning source data with a developed ontology,\nGeoOutageOnto. Currently, GeoOutageKG includes over 10.6 million individual\noutage records spanning from 2014 to 2024, 300,000 NTL images spanning from\n2012 to 2024, and 15,000 outage maps. GeoOutageKG is a novel, modular and\nreusable semantic resource that enables robust multimodal data integration. We\ndemonstrate its use through multiresolution analysis of geospatiotemporal power\noutages.", "published": "2025-07-30 17:54:38", "link": "http://arxiv.org/abs/2507.22878v1", "categories": ["cs.IR", "cs.CL", "cs.CY"], "primary_category": "cs.IR"}
{"title": "Sustainability Evaluation Metrics for Recommender Systems", "abstract": "Sustainability-oriented evaluation metrics can help to assess the quality of\nrecommender systems beyond wide-spread metrics such as accuracy, precision,\nrecall, and satisfaction. Following the United Nations`s sustainable\ndevelopment goals (SDGs), such metrics can help to analyse the impact of\nrecommender systems on environmental, social, and economic aspects. We discuss\ndifferent basic sustainability evaluation metrics for recommender systems and\nanalyze their applications.", "published": "2025-07-30 09:46:56", "link": "http://arxiv.org/abs/2507.22520v1", "categories": ["cs.IR"], "primary_category": "cs.IR"}
{"title": "A Comprehensive Taxonomy of Negation for NLP and Neural Retrievers", "abstract": "Understanding and solving complex reasoning tasks is vital for addressing the\ninformation needs of a user. Although dense neural models learn contextualised\nembeddings, they still underperform on queries containing negation. To\nunderstand this phenomenon, we study negation in both traditional neural\ninformation retrieval and LLM-based models. We (1) introduce a taxonomy of\nnegation that derives from philosophical, linguistic, and logical definitions;\n(2) generate two benchmark datasets that can be used to evaluate the\nperformance of neural information retrieval models and to fine-tune models for\na more robust performance on negation; and (3) propose a logic-based\nclassification mechanism that can be used to analyze the performance of\nretrieval models on existing datasets. Our taxonomy produces a balanced data\ndistribution over negation types, providing a better training setup that leads\nto faster convergence on the NevIR dataset. Moreover, we propose a\nclassification schema that reveals the coverage of negation types in existing\ndatasets, offering insights into the factors that might affect the\ngeneralization of fine-tuned models on negation.", "published": "2025-07-30 02:44:20", "link": "http://arxiv.org/abs/2507.22337v1", "categories": ["cs.CL", "cs.IR"], "primary_category": "cs.CL"}
