{"title": "Arbitrage-free catastrophe reinsurance valuation for compound dynamic contagion claims", "abstract": "In this paper, we consider catastrophe stop-loss reinsurance valuation for a\nreinsurance company with dynamic contagion claims. To deal with conventional\nand emerging catastrophic events, we propose the use of a compound dynamic\ncontagion process for the catastrophic component of the liability. Under the\npremise that there is an absence of arbitrage opportunity in the market, we\nobtain arbitrage-free premiums for these contacts. To this end, the Esscher\ntransform is adopted to specify an equivalent martingale probability measure.\nWe show that reinsurers have various ways of levying the security loading on\nthe net premiums to quantify the catastrophic liability in light of the growing\nchallenges posed by emerging risks arising from climate change, cyberattacks,\nand pandemics. We numerically compare arbitrage-free catastrophe stop-loss\nreinsurance premiums via the Monte Carlo simulation method. Sensitivity\nanalyzes are performed by changing the Esscher parameters and the retention\nlevel.", "published": "2025-02-18 23:04:27", "link": "http://arxiv.org/abs/2502.13325v1", "categories": ["q-fin.RM", "math.PR", "math.ST", "q-fin.MF", "stat.TH"], "primary_category": "q-fin.RM"}
{"title": "A measure-valued HJB perspective on Bayesian optimal adaptive control", "abstract": "We consider a Bayesian adaptive optimal stochastic control problem where a\nhidden static signal has a non-separable influence on the drift of a noisy\nobservation. Being allowed to control the specific form of this dependence, we\naim at optimising a cost functional depending on the posterior distribution of\nthe hidden signal. Expressing the dynamics of this posterior distribution in\nthe observation filtration, we embed our problem into a genuinely\ninfinite-dimensional stochastic control problem featuring so-called\nmeasure-valued martingales. We address this problem by use of viscosity theory\nand approximation arguments. Specifically, we show equivalence to a\ncorresponding weak formulation, characterise the optimal value of the problem\nin terms of the unique continuous viscosity solution of an associated HJB\nequation, and construct a piecewise constant and arbitrarily-close-to-optimal\ncontrol to our main problem of study.", "published": "2025-02-18 15:42:05", "link": "http://arxiv.org/abs/2502.12957v1", "categories": ["math.OC", "math.PR", "q-fin.MF", "49L25, 60G35, 60H10, 62M20, 93E35, 93E10"], "primary_category": "math.OC"}
{"title": "When defaults cannot be hedged: an actuarial approach to xVA calculations via local risk-minimization", "abstract": "We consider the pricing and hedging of counterparty credit risk and funding\nwhen there is no possibility to hedge the jump to default of either the bank or\nthe counterparty. This represents the situation which is most often encountered\nin practice, due to the absence of quoted corporate bonds or CDS contracts\nwritten on the counterparty and the difficulty for the bank to buy/sell\nprotection on her own default. We apply local risk-minimization to find the\noptimal strategy and compute it via a BSDE.", "published": "2025-02-18 11:35:57", "link": "http://arxiv.org/abs/2502.12774v2", "categories": ["q-fin.MF", "math.PR", "q-fin.PR", "91G20, 91G30, 91G40"], "primary_category": "q-fin.MF"}
{"title": "Analysis of the Impact of the Union Budget Announcements on the Indian Stock Market: A Fractal Perspective", "abstract": "The stock market closely monitors macroeconomic policy announcements, such as\nannual budget events, due to their substantial influence on various economic\nparticipants. These events tend to impact the stock markets initially before\naffecting the real sector. Our study aims to analyze the effects of the budget\non the Indian stock market, specifically focusing on the announcement for the\nyear 2024. We will compare this with the years 2023, 2022, and 2020, assessing\nits impact on the NIFTY50 index using average abnormal return (AAR) and\ncumulative average abnormal return (CAAR) over a period of -15 and +15 days,\nincluding the budget day. This study utilizes an innovative approach involving\nthe fractal interpolation function, paired with fractal dimensional analysis,\nto study the fluctuations arising from budget announcements. The fractal\nperspective on the data offers an effective framework for understanding complex\nvariations.", "published": "2025-02-18 08:49:06", "link": "http://arxiv.org/abs/2502.15787v1", "categories": ["q-fin.ST"], "primary_category": "q-fin.ST"}
{"title": "LLM Trading: Analysis of LLM Agent Behavior in Experimental Asset Markets", "abstract": "This paper explores how Large Language Models (LLMs) behave in a classic\nexperimental finance paradigm widely known for eliciting bubbles and crashes in\nhuman participants. We adapt an established trading design, where traders buy\nand sell a risky asset with a known fundamental value, and introduce several\nLLM-based agents, both in single-model markets (all traders are instances of\nthe same LLM) and in mixed-model \"battle royale\" settings (multiple LLMs\ncompeting in the same market). Our findings reveal that LLMs generally exhibit\na \"textbook-rational\" approach, pricing the asset near its fundamental value,\nand show only a muted tendency toward bubble formation. Further analyses\nindicate that LLM-based agents display less trading strategy variance in\ncontrast to humans. Taken together, these results highlight the risk of relying\non LLM-only data to replicate human-driven market phenomena, as key behavioral\nfeatures, such as large emergent bubbles, were not robustly reproduced. While\nLLMs clearly possess the capacity for strategic decision-making, their relative\nconsistency and rationality suggest that they do not accurately mimic human\nmarket dynamics.", "published": "2025-02-18 23:05:32", "link": "http://arxiv.org/abs/2502.15800v1", "categories": ["q-fin.TR"], "primary_category": "q-fin.TR"}
{"title": "Advanced Digital Simulation for Financial Market Dynamics: A Case of Commodity Futures", "abstract": "After decades of evolution, the financial system has increasingly deviated\nfrom an idealized framework based on theorems. It necessitates accurate\nprojections of complex market dynamics and human behavioral patterns. With the\ndevelopment of data science and machine intelligence, researchers are trying to\ndigitalize and automate market prediction. However, existing methodologies\nstruggle to represent the diversity of individuals and are regardless of the\ndomino effects of interactions on market dynamics, leading to the poor\nperformance facing abnormal market conditions where non-quantitative\ninformation dominates the market. To alleviate these disadvantages requires the\nintroduction of knowledge about how non-quantitative information, like news and\npolicy, affects market dynamics. This study investigates overcoming these\nchallenges through rehearsing potential market trends based on the financial\nlarge language model agents whose behaviors are aligned with their cognition\nand analyses in markets. We propose a hierarchical knowledge architecture for\nfinancial large language model agents, integrating fine-tuned language models\nand specialized generators optimized for trading scenarios. For financial\nmarket, we develop an advanced interactive behavioral simulation system that\nenables users to configure agents and automate market simulations. In this\nwork, we take commodity futures as an example to research the effectiveness of\nour methodologies. Our real-world case simulation succeeds in rehearsing\nabnormal market dynamics under geopolitical events and reaches an average\naccuracy of 3.4% across various points in time after the event on predicting\nfutures price. Experimental results demonstrate our method effectively\nleverages diverse information to simulate behaviors and their impact on market\ndynamics through systematic interaction.", "published": "2025-02-18 12:40:04", "link": "http://arxiv.org/abs/2503.20787v1", "categories": ["q-fin.TR", "cs.LG"], "primary_category": "q-fin.TR"}
{"title": "LLM Trading: Analysis of LLM Agent Behavior in Experimental Asset Markets", "abstract": "This paper explores how Large Language Models (LLMs) behave in a classic\nexperimental finance paradigm widely known for eliciting bubbles and crashes in\nhuman participants. We adapt an established trading design, where traders buy\nand sell a risky asset with a known fundamental value, and introduce several\nLLM-based agents, both in single-model markets (all traders are instances of\nthe same LLM) and in mixed-model \"battle royale\" settings (multiple LLMs\ncompeting in the same market). Our findings reveal that LLMs generally exhibit\na \"textbook-rational\" approach, pricing the asset near its fundamental value,\nand show only a muted tendency toward bubble formation. Further analyses\nindicate that LLM-based agents display less trading strategy variance in\ncontrast to humans. Taken together, these results highlight the risk of relying\non LLM-only data to replicate human-driven market phenomena, as key behavioral\nfeatures, such as large emergent bubbles, were not robustly reproduced. While\nLLMs clearly possess the capacity for strategic decision-making, their relative\nconsistency and rationality suggest that they do not accurately mimic human\nmarket dynamics.", "published": "2025-02-18 23:05:32", "link": "http://arxiv.org/abs/2502.15800v2", "categories": ["q-fin.TR"], "primary_category": "q-fin.TR"}
