{"title": "(Non-Monotonic) Effects of Productivity and Credit Constraints on Equilibrium Aggregate Production in General Equilibrium Models with Heterogeneous Producers", "abstract": "In a market economy, the aggregate production level depends not only on the\naggregate variables but also on the distribution of individual characteristics\n(e.g., productivity, credit limit, ...). We point out that, due to financial\nfrictions, the equilibrium aggregate production may be non-monotonic in both\nindividual productivity and credit limit. We provide conditions under which\nthis phenomenon happens. By consequence, improving productivity or relaxing\ncredit limit of firms may not necessarily be beneficial to economic\ndevelopment.", "published": "2025-01-22 08:16:49", "link": "http://arxiv.org/abs/2501.12700v1", "categories": ["q-fin.CP"], "primary_category": "q-fin.CP"}
{"title": "Marketron games: Self-propelling stocks vs dumb money and metastable dynamics of the Good, Bad and Ugly markets", "abstract": "We present a model of price formation in an inelastic market whose dynamics\nare partially driven by both money flows and their impact on asset prices. The\nmoney flow to the market is viewed as an investment policy of outside\ninvestors. For the price impact effect, we use an impact function that\nincorporates the phenomena of market inelasticity and saturation from new money\n(the $dumb \\; money$ effect). Due to the dependence of market investors' flows\non market performance, the model implies a feedback mechanism that gives rise\nto nonlinear dynamics. Consequently, the market price dynamics are seen as a\nnonlinear diffusion of a particle (the $marketron$) in a two-dimensional space\nformed by the log-price $x$ and a memory variable $y$. The latter stores\ninformation about past money flows, so that the dynamics are non-Markovian in\nthe log price $x$ alone, but Markovian in the pair $(x,y)$, bearing a strong\nresemblance to spiking neuron models in neuroscience. In addition to market\nflows, the model dynamics are partially driven by return predictors, modeled as\nunobservable Ornstein-Uhlenbeck processes. By using a new interpretation of\npredictive signals as $self$-$propulsion$ components of the price dynamics, we\ntreat the marketron as an active particle, amenable to methods developed in the\nphysics of active matter. We show that, depending on the choice of parameters,\nour model can produce a rich variety of interesting dynamic scenarios. In\nparticular, it predicts three distinct regimes of the market, which we call the\n$Good$, the $Bad$, and the $Ugly$ markets. The latter regime describes a\nscenario of a total market collapse or, alternatively, a corporate default\nevent, depending on whether our model is applied to the whole market or an\nindividual stock.", "published": "2025-01-22 06:30:26", "link": "http://arxiv.org/abs/2501.12676v2", "categories": ["q-fin.MF", "q-fin.CP"], "primary_category": "q-fin.MF"}
{"title": "Forecasting of Bitcoin Prices Using Hashrate Features: Wavelet and Deep Stacking Approach", "abstract": "Digital currencies have become popular in the last decade due to their\nnon-dependency and decentralized nature. The price of these currencies has seen\na lot of fluctuations at times, which has increased the need for prediction. As\ntheir most popular, Bitcoin(BTC) has become a research hotspot. The main\nchallenge and trend of digital currencies, especially BTC, is price\nfluctuations, which require studying the basic price prediction model. This\nresearch presents a classification and regression model based on stack deep\nlearning that uses a wavelet to remove noise to predict movements and prices of\nBTC at different time intervals. The proposed model based on the stacking\ntechnique uses models based on deep learning, especially neural networks and\ntransformers, for one, seven, thirty and ninety-day forecasting. Three feature\nselection models, Chi2, RFE and Embedded, were also applied to the data in the\npre-processing stage. The classification model achieved 63\\% accuracy for\npredicting the next day and 64\\%, 67\\% and 82\\% for predicting the seventh,\nthirty and ninety days, respectively. For daily price forecasting, the\npercentage error was reduced to 0.58, while the error ranged from 2.72\\% to\n2.85\\% for seven- to ninety-day horizons. These results show that the proposed\nmodel performed better than other models in the literature.", "published": "2025-01-22 09:31:00", "link": "http://arxiv.org/abs/2501.13136v1", "categories": ["q-fin.ST", "cs.AI", "cs.LG"], "primary_category": "q-fin.ST"}
{"title": "Optimal Rebate Design: Incentives, Competition and Efficiency in Auction Markets", "abstract": "This study explores the design of an efficient rebate policy in auction\nmarkets, focusing on a continuous-time setting with competition among market\nparticipants. In this model, a stock exchange collects transaction fees from\nauction investors executing block trades to buy or sell a risky asset, then\nredistributes these fees as rebates to competing market makers submitting limit\norders. Market makers influence both the price at which the asset trades and\ntheir arrival intensity in the auction. We frame this problem as a\nprincipal-multi-agent problem and provide necessary and sufficient conditions\nto characterize the Nash equilibrium among market makers. The exchange's\noptimization problem is formulated as a high-dimensional\nHamilton-Jacobi-Bellman equation with Poisson jump processes, which is solved\nusing a verification result. To numerically compute the optimal rebate and\ntransaction fee policies, we apply the Deep BSDE method. Our results show that\noptimal transaction fees and rebate structures improve market efficiency by\nnarrowing the spread between the auction clearing price and the asset's\nfundamental value, while ensuring a minimal gain for both market makers indexed\non the price of the asset on a coexisting limit order book.", "published": "2025-01-22 02:34:43", "link": "http://arxiv.org/abs/2501.12591v1", "categories": ["q-fin.TR", "math.OC", "math.PR"], "primary_category": "q-fin.TR"}
