{"title": "Testing Juntas and Junta Subclasses with Relative Error", "abstract": "This papers considers the junta testing problem in a recently introduced\n``relative error'' variant of the standard Boolean function property testing\nmodel. In relative-error testing we measure the distance from $f$ to $g$, where\n$f,g: \\{0,1\\}^n \\to \\{0,1\\}$, by the ratio of $|f^{-1}(1) \\triangle g^{-1}(1)|$\n(the number of inputs on which $f$ and $g$ disagree) to $|f^{-1}(1)|$ (the\nnumber of satisfying assignments of $f$), and we give the testing algorithm\nboth black-box access to $f$ and also access to independent uniform samples\nfrom $f^{-1}(1)$.\n  Chen et al. (SODA 2025) observed that the class of $k$-juntas is\n$\\text{poly}(2^k,1/\\epsilon)$-query testable in the relative-error model, and\nasked whether $\\text{poly}(k,1/\\epsilon)$ queries is achievable. We answer this\nquestion affirmatively by giving a $\\tilde{O}(k/\\epsilon)$-query algorithm,\nmatching the optimal complexity achieved in the less challenging standard\nmodel. Moreover, as our main result, we show that any subclass of $k$-juntas\nthat is closed under permuting variables is relative-error testable with a\nsimilar complexity. This gives highly efficient relative-error testing\nalgorithms for a number of well-studied function classes, including size-$k$\ndecision trees, size-$k$ branching programs, and size-$k$ Boolean formulas.", "published": "2025-04-12 19:17:41", "link": "http://arxiv.org/abs/2504.09312v1", "categories": ["cs.CC", "cs.DM", "cs.DS"], "primary_category": "cs.CC"}
{"title": "Self-Orthogonal Cellular Automata", "abstract": "It is known that no-boundary Cellular Automata (CA) defined by bipermutive\nlocal rules give rise to Latin squares. In this paper, we study under which\nconditions the Latin square generated by a bipermutive CA is self-orthogonal,\ni.e. orthogonal to its transpose. We first enumerate all bipermutive CA over\nthe binary alphabet up to diameter $d=6$, remarking that only some linear rules\ngive rise to self-orthogonal Latin squares. We then give a full theoretical\ncharacterization of self-orthogonal linear CA, by considering the square matrix\nobtained by stacking the transition matrices of the CA and of its transpose,\nand determining when it is invertible. Interestingly, the stacked matrix turns\nout to have a circulant structure, for which there exists an extensive body of\nresults to characterize its invertibility. Further, for the case of the binary\nalphabet we prove that irreducibility is a sufficient condition for\nself-orthogonality, and we derive a simpler characterization which boils down\nto computing the parity of the central coefficients of the local rule.", "published": "2025-04-12 10:32:44", "link": "http://arxiv.org/abs/2504.09173v1", "categories": ["cs.DM", "math.CO"], "primary_category": "cs.DM"}
{"title": "Breaking the Lens of the Telescope: Online Relevance Estimation over Large Retrieval Sets", "abstract": "Advanced relevance models, such as those that use large language models\n(LLMs), provide highly accurate relevance estimations. However, their\ncomputational costs make them infeasible for processing large document corpora.\nTo address this, retrieval systems often employ a telescoping approach, where\ncomputationally efficient but less precise lexical and semantic retrievers\nfilter potential candidates for further ranking. However, this approach heavily\ndepends on the quality of early-stage retrieval, which can potentially exclude\nrelevant documents early in the process. In this work, we propose a novel\nparadigm for re-ranking called online relevance estimation that continuously\nupdates relevance estimates for a query throughout the ranking process. Instead\nof re-ranking a fixed set of top-k documents in a single step, online relevance\nestimation iteratively re-scores smaller subsets of the most promising\ndocuments while adjusting relevance scores for the remaining pool based on the\nestimations from the final model using an online bandit-based algorithm. This\ndynamic process mitigates the recall limitations of telescoping systems by\nre-prioritizing documents initially deemed less relevant by earlier stages --\nincluding those completely excluded by earlier-stage retrievers. We validate\nour approach on TREC benchmarks under two scenarios: hybrid retrieval and\nadaptive retrieval. Experimental results demonstrate that our method is\nsample-efficient and significantly improves recall, highlighting the\neffectiveness of our online relevance estimation framework for modern search\nsystems.", "published": "2025-04-12 22:05:50", "link": "http://arxiv.org/abs/2504.09353v1", "categories": ["cs.IR"], "primary_category": "cs.IR"}
{"title": "SynthTRIPs: A Knowledge-Grounded Framework for Benchmark Query Generation for Personalized Tourism Recommenders", "abstract": "Tourism Recommender Systems (TRS) are crucial in personalizing travel\nexperiences by tailoring recommendations to users' preferences, constraints,\nand contextual factors. However, publicly available travel datasets often lack\nsufficient breadth and depth, limiting their ability to support advanced\npersonalization strategies -- particularly for sustainable travel and off-peak\ntourism. In this work, we explore using Large Language Models (LLMs) to\ngenerate synthetic travel queries that emulate diverse user personas and\nincorporate structured filters such as budget constraints and sustainability\npreferences.\n  This paper introduces a novel SynthTRIPs framework for generating synthetic\ntravel queries using LLMs grounded in a curated knowledge base (KB). Our\napproach combines persona-based preferences (e.g., budget, travel style) with\nexplicit sustainability filters (e.g., walkability, air quality) to produce\nrealistic and diverse queries. We mitigate hallucination and ensure factual\ncorrectness by grounding the LLM responses in the KB. We formalize the query\ngeneration process and introduce evaluation metrics for assessing realism and\nalignment. Both human expert evaluations and automatic LLM-based assessments\ndemonstrate the effectiveness of our synthetic dataset in capturing complex\npersonalization aspects underrepresented in existing datasets. While our\nframework was developed and tested for personalized city trip recommendations,\nthe methodology applies to other recommender system domains.\n  Code and dataset are made public at https://bit.ly/synthTRIPs", "published": "2025-04-12 16:48:35", "link": "http://arxiv.org/abs/2504.09277v1", "categories": ["cs.IR", "cs.AI"], "primary_category": "cs.IR"}
{"title": "NoTeS-Bank: Benchmarking Neural Transcription and Search for Scientific Notes Understanding", "abstract": "Understanding and reasoning over academic handwritten notes remains a\nchallenge in document AI, particularly for mathematical equations, diagrams,\nand scientific notations. Existing visual question answering (VQA) benchmarks\nfocus on printed or structured handwritten text, limiting generalization to\nreal-world note-taking. To address this, we introduce NoTeS-Bank, an evaluation\nbenchmark for Neural Transcription and Search in note-based question answering.\nNoTeS-Bank comprises complex notes across multiple domains, requiring models to\nprocess unstructured and multimodal content. The benchmark defines two tasks:\n(1) Evidence-Based VQA, where models retrieve localized answers with\nbounding-box evidence, and (2) Open-Domain VQA, where models classify the\ndomain before retrieving relevant documents and answers. Unlike classical\nDocument VQA datasets relying on optical character recognition (OCR) and\nstructured data, NoTeS-BANK demands vision-language fusion, retrieval, and\nmultimodal reasoning. We benchmark state-of-the-art Vision-Language Models\n(VLMs) and retrieval frameworks, exposing structured transcription and\nreasoning limitations. NoTeS-Bank provides a rigorous evaluation with NDCG@5,\nMRR, Recall@K, IoU, and ANLS, establishing a new standard for visual document\nunderstanding and reasoning.", "published": "2025-04-12 15:11:32", "link": "http://arxiv.org/abs/2504.09249v1", "categories": ["cs.CV", "cs.IR", "cs.LG", "cs.MM"], "primary_category": "cs.CV"}
{"title": "Pneuma: Leveraging LLMs for Tabular Data Representation and Retrieval in an End-to-End System", "abstract": "Finding relevant tables among databases, lakes, and repositories is the first\nstep in extracting value from data. Such a task remains difficult because\nassessing whether a table is relevant to a problem does not always depend only\non its content but also on the context, which is usually tribal knowledge known\nto the individual or team. While tools like data catalogs and academic data\ndiscovery systems target this problem, they rely on keyword search or more\ncomplex interfaces, limiting non-technical users' ability to find relevant\ndata. The advent of large language models (LLMs) offers a unique opportunity\nfor users to ask questions directly in natural language, making dataset\ndiscovery more intuitive, accessible, and efficient.\n  In this paper, we introduce Pneuma, a retrieval-augmented generation (RAG)\nsystem designed to efficiently and effectively discover tabular data. Pneuma\nleverages large language models (LLMs) for both table representation and table\nretrieval. For table representation, Pneuma preserves schema and row-level\ninformation to ensure comprehensive data understanding. For table retrieval,\nPneuma augments LLMs with traditional information retrieval techniques, such as\nfull-text and vector search, harnessing the strengths of both to improve\nretrieval performance. To evaluate Pneuma, we generate comprehensive benchmarks\nthat simulate table discovery workload on six real-world datasets including\nenterprise data, scientific databases, warehousing data, and open data. Our\nresults demonstrate that Pneuma outperforms widely used table search systems\n(such as full-text search and state-of-the-art RAG systems) in accuracy and\nresource efficiency.", "published": "2025-04-12 13:20:50", "link": "http://arxiv.org/abs/2504.09207v1", "categories": ["cs.DB", "cs.IR"], "primary_category": "cs.DB"}
{"title": "Conformal Calibration: Ensuring the Reliability of Black-Box AI in Wireless Systems", "abstract": "AI is poised to revolutionize telecommunication networks by boosting\nefficiency, automation, and decision-making. However, the black-box nature of\nmost AI models introduces substantial risk, possibly deterring adoption by\nnetwork operators. These risks are not addressed by the current prevailing\ndeployment strategy, which typically follows a best-effort train-and-deploy\nparadigm. This paper reviews conformal calibration, a general framework that\nmoves beyond the state of the art by adopting computationally lightweight,\nadvanced statistical tools that offer formal reliability guarantees without\nrequiring further training or fine-tuning. Conformal calibration encompasses\npre-deployment calibration via uncertainty quantification or hyperparameter\nselection; online monitoring to detect and mitigate failures in real time; and\ncounterfactual post-deployment performance analysis to address \"what if\"\ndiagnostic questions after deployment. By weaving conformal calibration into\nthe AI model lifecycle, network operators can establish confidence in black-box\nAI models as a dependable enabling technology for wireless systems.", "published": "2025-04-12 19:05:00", "link": "http://arxiv.org/abs/2504.09310v1", "categories": ["cs.IT", "cs.LG", "eess.SP", "math.IT", "stat.AP"], "primary_category": "cs.IT"}
{"title": "Machine Learning-Based AP Selection in User-Centric Cell-free Multiple-Antenna Networks", "abstract": "User-centric cell-free (UCCF) massive multiple-input multiple-output (MIMO)\nsystems are considered a viable solution to realize the advantages offered by\ncell-free (CF) networks, including reduced interference and consistent quality\nof service while maintaining manageable complexity. In this paper, we propose\nnovel learning-based access point (AP) selection schemes tailored for UCCF\nmassive MIMO systems. The learning model exploits the dataset generated from\ntwo distinct AP selection schemes, based on large-scale fading (LSF)\ncoefficients and the sum-rate coefficients, respectively. The proposed\nlearning-based AP selection schemes could be implemented centralized or\ndistributed, with the aim of performing AP selection efficiently. We evaluate\nour model's performance against CF and two heuristic clustering schemes for\nUCCF networks. The results demonstrate that the learning-based approach\nachieves a comparable sum-rate performance to that of competing techniques for\nUCCF networks, while significantly reducing computational complexity.", "published": "2025-04-12 15:47:01", "link": "http://arxiv.org/abs/2504.09263v1", "categories": ["cs.IT", "math.IT"], "primary_category": "cs.IT"}
{"title": "White-Box AI Model: Next Frontier of Wireless Communications", "abstract": "White-box AI (WAI), or explainable AI (XAI) model, a novel tool to achieve\nthe reasoning behind decisions and predictions made by the AI algorithms, makes\nit more understandable and transparent. It offers a new approach to address key\nchallenges of interpretability and mathematical validation in traditional\nblack-box models. In this paper, WAI-aided wireless communication systems are\nproposed and investigated thoroughly to utilize the promising capabilities.\nFirst, we introduce the fundamental principles of WAI. Then, a detailed\ncomparison between WAI and traditional black-box model is conducted in terms of\noptimization objectives and architecture design, with a focus on deep neural\nnetworks (DNNs) and transformer networks. Furthermore, in contrast to the\ntraditional black-box methods, WAI leverages theory-driven causal modeling and\nverifiable optimization paths, thereby demonstrating potential advantages in\nareas such as signal processing and resource allocation. Finally, we outline\nfuture research directions for the integration of WAI in wireless communication\nsystems.", "published": "2025-04-12 08:57:17", "link": "http://arxiv.org/abs/2504.09138v1", "categories": ["cs.IT", "math.IT"], "primary_category": "cs.IT"}
{"title": "Linear complementary dual quasi-cyclic codes of index 2", "abstract": "We provide a polynomial approach to investigate linear complementary dual\n(LCD) quasi-cyclic codes over finite fields. We establish necessary and\nsufficient conditions for LCD quasi-cyclic codes of index 2 with respect to the\nEuclidean, Hermitian, and symplectic inner products. As a consequence of these\ncharacterizations, we derive necessary and sufficient conditions for LCD\none-generator quasi-cyclic codes.", "published": "2025-04-12 08:27:11", "link": "http://arxiv.org/abs/2504.09126v1", "categories": ["cs.IT", "math.IT", "94B05, 94B15, 94B60"], "primary_category": "cs.IT"}
{"title": "The trace dual of nonlinear skew cyclic codes", "abstract": "Codes which have a finite field $\\mathbb{F}_{q^m}$ as their alphabet but\nwhich are only linear over a subfield $\\mathbb{F}_q$ are a topic of much recent\ninterest due to their utility in constructing quantum error correcting codes.\nIn this article, we find generators for trace dual spaces of different families\nof $\\mathbb{F}_q$-linear codes over $\\mathbb{F}_{q^2}$. In particular, given\nthe field extension $\\mathbb{F}_q\\leq \\mathbb{F}_{q^2}$ with $q$ an odd prime\npower, we determine the trace Euclidean and trace Hermitian dual codes for the\ngeneral $\\mathbb{F}_q$-linear cyclic $\\mathbb{F}_{q^2}$-code. In addition, we\nalso determine the trace Euclidean and trace Hermitian duals for general\n$\\mathbb{F}_q$-linear skew cyclic $\\mathbb{F}_{q^2}$-codes, which are defined\nto be left $\\mathbb{F}_q[X]$-submodules of\n$\\mathbb{F}_{q^2}[X;\\sigma]/(X^n-1)$, where $\\sigma$ denotes the Frobenius\nautomorphism and $\\mathbb{F}_{q^2}[X;\\sigma]$ the induced skew polynomial ring.", "published": "2025-04-12 06:35:38", "link": "http://arxiv.org/abs/2504.09098v1", "categories": ["cs.IT", "math.IT", "math.RA", "94B05, 94B15, 11T71, 16S36"], "primary_category": "cs.IT"}
{"title": "A Hierarchical Decomposition of Kullback-Leibler Divergence: Disentangling Marginal Mismatches from Statistical Dependencies", "abstract": "The Kullback-Leibler (KL) divergence is a foundational measure for comparing\nprobability distributions. Yet in multivariate settings, its structure is often\nopaque, conflating marginal mismatches and statistical dependencies. We derive\nan algebraically exact, additive, and hierarchical decomposition of the KL\ndivergence between a joint distribution \\( P_k \\) and a product reference \\(\nQ^{\\otimes k} \\). The total divergence splits into the sum of marginal KLs, \\(\n\\sum_{i=1}^k \\mathrm{KL}(P_i \\| Q) \\), and the total correlation \\( C(P_k) \\),\nwhich we further decompose as \\( C(P_k) = \\sum_{r=2}^k I^{(r)}(P_k) \\), using\nMoebius inversion on the subset lattice. Each \\( I^{(r)} \\) quantifies the\ndistinct contribution of \\( r \\)-way statistical interactions to the total\ndivergence. This yields the first decomposition of this form that is both\nalgebraically complete and interpretable using only standard Shannon\nquantities, with no approximations or model assumptions. Numerical validation\nusing hypergeometric sampling confirms exactness to machine precision across\ndiverse system configurations. This framework enables precise diagnosis of\ndivergence origins, marginal versus interaction, across applications in machine\nlearning, econometrics, and complex systems.", "published": "2025-04-12 00:59:07", "link": "http://arxiv.org/abs/2504.09029v1", "categories": ["cs.IT", "math.IT", "math.ST", "stat.TH"], "primary_category": "cs.IT"}
{"title": "Universal Rate-Distortion-Classification Representations for Lossy Compression", "abstract": "In lossy compression, Wang et al. [1] recently introduced the\nrate-distortion-perception-classification function, which supports multi-task\nlearning by jointly optimizing perceptual quality, classification accuracy, and\nreconstruction fidelity. Building on the concept of a universal encoder\nintroduced in [2], we investigate the universal representations that enable a\nbroad range of distortion-classification tradeoffs through a single shared\nencoder coupled with multiple task-specific decoders. We establish, through\nboth theoretical analysis and numerical experiments, that for Gaussian source\nunder mean squared error (MSE) distortion, the entire distortion-classification\ntradeoff region can be achieved using a single universal encoder. For general\nsources, we characterize the achievable region and identify conditions under\nwhich encoder reuse results in negligible distortion penalty. The experimental\nresult on the MNIST dataset further supports our theoretical findings. We show\nthat universal encoders can obtain distortion performance comparable to\ntask-specific encoders. These results demonstrate the practicality and\neffectiveness of the proposed universal framework in multi-task compression\nscenarios.", "published": "2025-04-12 00:43:59", "link": "http://arxiv.org/abs/2504.09025v1", "categories": ["cs.IT", "math.IT"], "primary_category": "cs.IT"}
{"title": "Game-Theoretic Coordination For Time-Critical Missions of UAV Systems", "abstract": "Cooperative missions involving Unmanned Aerial Vehicles (UAVs) in dynamic\nenvironments pose significant challenges in ensuring both coordination and\nagility. In this paper, we introduce a novel game-theoretic approach for\ntime-critical missions, where each UAV optimizes a cost function that\nincorporates temporal and mission-specific constraints. The optimization is\nperformed within a one-dimensional domain, significantly reducing the\ncomputational cost and enabling real-time application to complex and dynamic\nscenarios. The framework is distributed in structure, allowing to achieve\nglobal, system-wide coordination (a Nash equilibrium) by using only local\ninformation. For ideal systems, we prove the existence and exponential\nstability of the Nash equilibrium. Furthermore, we invoke model predictive\ncontrol (MPC) for non-ideal scenarios. In particular, we propose a\ndiscrete-time optimization approach that tackles path-following errors and\ncommunication failures, ensuring reliable and agile performance in dynamic and\nuncertain environments. Simulation results demonstrate the effectiveness and\nagility of the approach in ensuring successful mission execution across diverse\nscenarios. Experiments using a motion capture system provide further validation\nunder realistic conditions.", "published": "2025-04-12 00:21:11", "link": "http://arxiv.org/abs/2504.09022v1", "categories": ["cs.MA"], "primary_category": "cs.MA"}
{"title": "Essentially Non-oscillatory Spectral Volume Methods", "abstract": "A new Essentially Non-oscillatory (ENO) recovery algorithm is developed and\ntested in a Finite Volume method. The construction is hinged on a reformulation\nof the reconstruction as the solution to a variational problem. The sign\nproperty of the classical ENO algorithm is expressed as restrictions on the\nadmissible set of solutions to this variational problem. In conjunction with an\neducated guessing algorithm for possible locations of discontinuities an ENO\nreconstruction algorithm without divided differences or smoothness indicators\nis constructed. No tunable parameters exist apart from the desired order and\nstencil width. The desired order is in principle arbitrary, but growing\nstencils are needed. While classical ENO methods consider all connected\nstencils that surround a cell under consideration the proposed recovery method\nuses a fixed stencil, simplifying efficient high order implementations.", "published": "2025-04-12 20:36:54", "link": "http://arxiv.org/abs/2504.09336v1", "categories": ["math.NA", "cs.NA", "math.AP"], "primary_category": "math.NA"}
{"title": "Arnold diffusion in the full three-body problem", "abstract": "We show the existence of Arnold diffusion in the planar full three-body\nproblem, which is expressed as a perturbation of a Kepler problem and a planar\ncircular restricted three-body problem, with the perturbation parameter being\nthe mass of the smallest body. In this context, we obtain Arnold diffusion in\nterms of a transfer of energy, in an amount independent of the perturbation\nparameter, between the Kepler problem and the restricted three-body problem.\nOur argument is based on a topological method based on correctly aligned\nwindows which is implemented into a computer assisted proof. This approach can\nbe applied to physically relevant masses of the bodies, such as those in a\nNeptune-Triton-asteroid system. In this case, we obtain explicit estimates for\nthe range of the perturbation parameter and for the diffusion time.", "published": "2025-04-12 16:35:19", "link": "http://arxiv.org/abs/2504.09273v1", "categories": ["math.DS", "cs.NA", "math-ph", "math.MP", "math.NA"], "primary_category": "math.DS"}
{"title": "A $P$-Adaptive Hermite Method for Nonlinear Dispersive Maxwell's Equations", "abstract": "In this work, we introduce a novel Hermite method to handle Maxwell's\nequations for nonlinear dispersive media. The proposed method achieves\nhigh-order accuracy and is free of any nonlinear algebraic solver, requiring\nsolving instead small local linear systems for which the dimension is\nindependent of the order. The implementation of order adaptive algorithms is\nstraightforward in this setting, making the resulting p-adaptive Hermite method\nappealing for the simulations of soliton-like wave propagation.", "published": "2025-04-12 16:09:07", "link": "http://arxiv.org/abs/2504.09269v1", "categories": ["math.NA", "cs.NA", "35Q61, 65M70, 78M22"], "primary_category": "math.NA"}
{"title": "Ensemble Score Filter for Data Assimilation of Two-Phase Flow Models in Porous Media", "abstract": "Numerical modeling and simulation of two-phase flow in porous media is\nchallenging due to the uncertainties in key parameters, such as permeability.\nTo address these challenges, we propose a computational framework by utilizing\nthe novel Ensemble Score Filter (EnSF) to enhance the accuracy of state\nestimation for two-phase flow systems in porous media. The forward simulation\nof the two-phase flow model is implemented using a mixed finite element method,\nwhich ensures accurate approximation of the pressure, the velocity, and the\nsaturation. The EnSF leverages score-based diffusion models to approximate\nfiltering distributions efficiently, avoiding the computational expense of\nneural network-based methods. By incorporating a closed-form score\napproximation and an analytical update mechanism, the EnSF overcomes degeneracy\nissues and handles high-dimensional nonlinear filtering with minimal\ncomputational overhead. Numerical experiments demonstrate the capabilities of\nEnSF in scenarios with uncertain permeability and incomplete observational\ndata.", "published": "2025-04-12 14:52:12", "link": "http://arxiv.org/abs/2504.09245v1", "categories": ["math.NA", "cs.NA"], "primary_category": "math.NA"}
{"title": "Stable Determination and Reconstruction of a Quasilinear Term in an Elliptic Equation", "abstract": "In this work, we investigate the inverse problem of determining a quasilinear\nterm appearing in a nonlinear elliptic equation from the measurement of the\nconormal derivative on the boundary. This problem arises in several practical\napplications, e.g., heat conduction. We derive novel H\\\"older stability\nestimates for both multi- and one-dimensional cases: in the multi-dimensional\ncase, the stability estimates are stated with one single boundary measurement,\nwhereas in the one-dimensional case, due to dimensionality limitation, the\nstability results are stated for the Dirichlet boundary condition varying in a\nspace of dimension one. We derive these estimates using different properties of\nsolution representations. We complement the theoretical results with numerical\nreconstructions of the quasilinear term, which illustrate the stable recovery\nof the quasilinear term in the presence of data noise.", "published": "2025-04-12 10:05:46", "link": "http://arxiv.org/abs/2504.09167v1", "categories": ["math.AP", "cs.NA", "math.NA"], "primary_category": "math.AP"}
{"title": "Exact inequalities and optimal recovery by inaccurate information", "abstract": "The paper considers a multidimensional problem of optimal recovery of an\noperator whose action is represented by multiplying the original function by a\nweight function of a special type, based on inaccurately specified information\nabout the values of operators of a similar type. An exact inequality for the\nnorms of such operators is obtained. The problem under consideration is a\ngeneralization of the problem of optimal recovery of a derivative based on\nother inaccurately specified derivatives in the space $\\mathbb R^d$ and the\nproblem of an exact inequality, which is an analogue of the\nHardy-Littlewood-Polya inequality.", "published": "2025-04-12 09:03:29", "link": "http://arxiv.org/abs/2504.09139v1", "categories": ["math.NA", "cs.NA", "26DD15, 41A65, 41A46, 49N30"], "primary_category": "math.NA"}
{"title": "On the rate of convergence of estimating the Hurst parameter of rough stochastic volatility models", "abstract": "In [8], easily computable scale-invariant estimator\n$\\widehat{\\mathscr{R}}^s_n$ was constructed to estimate the Hurst parameter of\nthe drifted fractional Brownian motion $X$ from its antiderivative. This paper\nextends this convergence result by proving that $\\widehat{\\mathscr{R}}^s_n$\nalso consistently estimates the Hurst parameter when applied to the\nantiderivative of $g \\circ X$ for a general nonlinear function $g$. We also\nestablish an almost sure rate of convergence in this general setting. Our\nresult applies, in particular, to the estimation of the Hurst parameter of a\nwide class of rough stochastic volatility models from discrete observations of\nthe integrated variance, including the fractional stochastic volatility model.", "published": "2025-04-12 16:48:26", "link": "http://arxiv.org/abs/2504.09276v1", "categories": ["q-fin.ST", "math.PR", "math.ST", "q-fin.MF", "stat.TH", "62P05, 60F15, 60G22, 91G70"], "primary_category": "q-fin.ST"}
{"title": "Neural Posterior Estimation on Exponential Random Graph Models: Evaluating Bias and Implementation Challenges", "abstract": "Exponential random graph models (ERGMs) are flexible probabilistic frameworks\nto model statistical networks through a variety of network summary statistics.\nConventional Bayesian estimation for ERGMs involves iteratively exchanging with\nan auxiliary variable due to the intractability of ERGMs, however, this\napproach lacks scalability to large-scale implementations. Neural posterior\nestimation (NPE) is a recent advancement in simulation-based inference, using a\nneural network based density estimator to infer the posterior for models with\ndoubly intractable likelihoods for which simulations can be generated. While\nNPE has been successfully adopted in various fields such as cosmology, little\nresearch has investigated its use for ERGMs. Performing NPE on ERGM not only\nprovides a differing angle of resolving estimation for the intractable ERGM\nlikelihoods but also allows more efficient and scalable inference using the\namortisation properties of NPE, and therefore, we investigate how NPE can be\neffectively implemented in ERGMs.\n  In this study, we present the first systematic implementation of NPE for\nERGMs, rigorously evaluating potential biases, interpreting the biases\nmagnitudes, and comparing NPE fittings against conventional Bayesian ERGM\nfittings. More importantly, our work highlights ERGM-specific areas that may\nimpose particular challenges for the adoption of NPE.", "published": "2025-04-12 21:37:11", "link": "http://arxiv.org/abs/2504.09349v1", "categories": ["stat.ME", "stat.ML"], "primary_category": "stat.ME"}
{"title": "Inferring Outcome Means of Exponential Family Distributions Estimated by Deep Neural Networks", "abstract": "Despite the widespread use of deep neural networks (DNNs) for prediction,\ninference on estimated means for categorical or exponential family outcomes\nremains underexplored. We address this gap by framing the problem within the\ngeneralized linear models (GLMs) framework and developing a rigorous\nstatistical approach for inference on DNN-estimated means. To address a key\nlimitation of assuming independence between prediction errors and input\nvariables in the literature, which often fails in GLMs, we introduce a\ntruncation technique that partitions the problem into regimes with distinct\nnoise behaviors, enabling refined analysis and robust theoretical guarantees\nunder general GLM frameworks. To implement inference, we consider an Ensemble\nSubsampling Method (ESM) that leverages U-statistics and the Hoeffding\ndecomposition to construct reliable confidence intervals. This method enables\nmodel-free variance estimation and accounts for heterogeneity among individuals\nin the population. Through extensive simulations across Binary, Poisson and\nBinomial models, we demonstrate the effectiveness and efficiency of our method.\nWe further apply the method to real-world data from the eICU dataset to predict\npatient readmission risks, providing actionable insights for clinical\ndecision-making.", "published": "2025-04-12 21:32:42", "link": "http://arxiv.org/abs/2504.09347v1", "categories": ["stat.ML", "cs.LG", "math.ST", "stat.TH"], "primary_category": "stat.ML"}
{"title": "Towards Optimal Differentially Private Regret Bounds in Linear MDPs", "abstract": "We study regret minimization under privacy constraints in episodic\ninhomogeneous linear Markov Decision Processes (MDPs), motivated by the growing\nuse of reinforcement learning (RL) in personalized decision-making systems that\nrely on sensitive user data. In this setting, both transition probabilities and\nreward functions are assumed to be linear in a feature mapping $\\phi(s, a)$,\nand we aim to ensure privacy through joint differential privacy (JDP), a\nrelaxation of differential privacy suited to online learning. Prior work has\nestablished suboptimal regret bounds by privatizing the LSVI-UCB algorithm,\nwhich achieves $\\widetilde{O}(\\sqrt{d^3 H^4 K})$ regret in the non-private\nsetting. Building on recent advances that improve this to minimax optimal\nregret $\\widetilde{O}(HD\\sqrt{K})$ via LSVI-UCB++ with Bernstein-style bonuses,\nwe design a new differentially private algorithm by privatizing LSVI-UCB++ and\nadapting techniques for variance-aware analysis from offline RL. Our algorithm\nachieves a regret bound of $\\widetilde{O}(d \\sqrt{H^3 K} + H^{4.5} d^{7/6}\nK^{1/2} / \\epsilon)$, improving over previous private methods. Empirical\nresults show that our algorithm retains near-optimal utility compared to\nnon-private baselines, indicating that privacy can be achieved with minimal\nperformance degradation in this setting.", "published": "2025-04-12 20:51:51", "link": "http://arxiv.org/abs/2504.09339v1", "categories": ["cs.LG", "cs.DS", "stat.ML"], "primary_category": "cs.LG"}
{"title": "Regretful Decisions under Label Noise", "abstract": "Machine learning models are routinely used to support decisions that affect\nindividuals -- be it to screen a patient for a serious illness or to gauge\ntheir response to treatment. In these tasks, we are limited to learning models\nfrom datasets with noisy labels. In this paper, we study the instance-level\nimpact of learning under label noise. We introduce a notion of regret for this\nregime which measures the number of unforeseen mistakes due to noisy labels. We\nshow that standard approaches to learning under label noise can return models\nthat perform well at a population level while subjecting individuals to a\nlottery of mistakes. We present a versatile approach to estimate the likelihood\nof mistakes at the individual level from a noisy dataset by training models\nover plausible realizations of datasets without label noise. This is supported\nby a comprehensive empirical study of label noise in clinical prediction tasks.\nOur results reveal how failure to anticipate mistakes can compromise model\nreliability and adoption, and demonstrate how we can address these challenges\nby anticipating and avoiding regretful decisions.", "published": "2025-04-12 20:21:24", "link": "http://arxiv.org/abs/2504.09330v1", "categories": ["cs.LG", "stat.ML"], "primary_category": "cs.LG"}
{"title": "No-Regret Generative Modeling via Parabolic Monge-Ampère PDE", "abstract": "We introduce a novel generative modeling framework based on a discretized\nparabolic Monge-Amp\\`ere PDE, which emerges as a continuous limit of the\nSinkhorn algorithm commonly used in optimal transport. Our method performs\niterative refinement in the space of Brenier maps using a mirror gradient\ndescent step. We establish theoretical guarantees for generative modeling\nthrough the lens of no-regret analysis, demonstrating that the iterates\nconverge to the optimal Brenier map under a variety of step-size schedules. As\na technical contribution, we derive a new Evolution Variational Inequality\ntailored to the parabolic Monge-Amp\\`ere PDE, connecting geometry,\ntransportation cost, and regret. Our framework accommodates non-log-concave\ntarget distributions, constructs an optimal sampling process via the Brenier\nmap, and integrates favorable learning techniques from generative adversarial\nnetworks and score-based diffusion models. As direct applications, we\nillustrate how our theory paves new pathways for generative modeling and\nvariational inference.", "published": "2025-04-12 16:51:02", "link": "http://arxiv.org/abs/2504.09279v1", "categories": ["stat.ML", "cs.LG", "math.OC", "math.ST", "stat.TH"], "primary_category": "stat.ML"}
{"title": "FairACE: Achieving Degree Fairness in Graph Neural Networks via Contrastive and Adversarial Group-Balanced Training", "abstract": "Fairness has been a significant challenge in graph neural networks (GNNs)\nsince degree biases often result in un-equal prediction performance among nodes\nwith varying degrees. Existing GNN models focus on prediction accuracy,\nfrequently overlooking fairness across different degree groups. To addressthis\nissue, we propose a novel GNN framework, namely Fairness- Aware Asymmetric\nContrastive Ensemble (FairACE), which inte-grates asymmetric contrastive\nlearning with adversarial training to improve degree fairness. FairACE captures\none-hop local neighborhood information and two-hop monophily similarity to\ncreate fairer node representations and employs a degree fairness regulator to\nbalance performance between high-degree and low-degree nodes. During model\ntraining, a novel group-balanced fairness loss is proposed to minimize\nclassification disparities across degree groups. In addition, we also propose a\nnovel fairness metric, the Accuracy Distribution Gap (ADG), which can\nquantitatively assess and ensure equitable performance across different\ndegree-based node groups. Experimental results on both synthetic and real-world\ndatasets demonstrate that FairACE significantly improves degree fairness\nmetrics while maintaining competitive accuracy in comparison to the\nstate-of-the-art GNN models.", "published": "2025-04-12 13:32:11", "link": "http://arxiv.org/abs/2504.09210v1", "categories": ["cs.LG", "cs.AI", "cs.SI", "stat.ML"], "primary_category": "cs.LG"}
{"title": "Rethinking Remaining Useful Life Prediction with Scarce Time Series Data: Regression under Indirect Supervision", "abstract": "Supervised time series prediction relies on directly measured target\nvariables, but real-world use cases such as predicting remaining useful life\n(RUL) involve indirect supervision, where the target variable is labeled as a\nfunction of another dependent variable. Trending temporal regression techniques\nrely on sequential time series inputs to capture temporal patterns, requiring\ninterpolation when dealing with sparsely and irregularly sampled covariates\nalong the timeline. However, interpolation can introduce significant biases,\nparticularly with highly scarce data. In this paper, we address the RUL\nprediction problem with data scarcity as time series regression under indirect\nsupervision. We introduce a unified framework called parameterized static\nregression, which takes single data points as inputs for regression of target\nvalues, inherently handling data scarcity without requiring interpolation. The\ntime dependency under indirect supervision is captured via a parametrical\nrectification (PR) process, approximating a parametric function during\ninference with historical posteriori estimates, following the same underlying\ndistribution used for labeling during training. Additionally, we propose a\nnovel batch training technique for tasks in indirect supervision to prevent\noverfitting and enhance efficiency. We evaluate our model on public benchmarks\nfor RUL prediction with simulated data scarcity. Our method demonstrates\ncompetitive performance in prediction accuracy when dealing with highly scarce\ntime series data.", "published": "2025-04-12 13:14:35", "link": "http://arxiv.org/abs/2504.09206v1", "categories": ["cs.LG", "stat.ML"], "primary_category": "cs.LG"}
{"title": "Dose-finding design based on level set estimation in phase I cancer clinical trials", "abstract": "The primary objective of phase I cancer clinical trials is to evaluate the\nsafety of a new experimental treatment and to find the maximum tolerated dose\n(MTD). We show that the MTD estimation problem can be regarded as a level set\nestimation (LSE) problem whose objective is to determine the regions where an\nunknown function value is above or below a given threshold. Then, we propose a\nnovel dose-finding design in the framework of LSE. The proposed design\ndetermines the next dose on the basis of an acquisition function incorporating\nuncertainty in the posterior distribution of the dose-toxicity curve as well as\noverdose control. Simulation experiments show that the proposed LSE design\nachieves a higher accuracy in estimating the MTD and involves a lower risk of\noverdosing allocation compared to existing designs, thereby indicating that it\nprovides an effective methodology for phase I cancer clinical trial design.", "published": "2025-04-12 09:44:20", "link": "http://arxiv.org/abs/2504.09157v1", "categories": ["stat.ML", "cs.LG"], "primary_category": "stat.ML"}
{"title": "High dimensional online calibration in polynomial time", "abstract": "In online (sequential) calibration, a forecaster predicts probability\ndistributions over a finite outcome space $[d]$ over a sequence of $T$ days,\nwith the goal of being calibrated. While asymptotically calibrated strategies\nare known to exist, they suffer from the curse of dimensionality: the best\nknown algorithms require $\\exp(d)$ days to achieve non-trivial calibration.\n  In this work, we present the first asymptotically calibrated strategy that\nguarantees non-trivial calibration after a polynomial number of rounds.\nSpecifically, for any desired accuracy $\\epsilon > 0$, our forecaster becomes\n$\\epsilon$-calibrated after $T = d^{O(1/\\epsilon^2)}$ days. We complement this\nresult with a lower bound, proving that at least $T =\nd^{\\Omega(\\log(1/\\epsilon))}$ rounds are necessary to achieve\n$\\epsilon$-calibration. Our results resolve the open questions posed by\n[Abernethy-Mannor'11, Hazan-Kakade'12].\n  Our algorithm is inspired by recent breakthroughs in swap regret minimization\n[Peng-Rubinstein'24, Dagan et al.'24]. Despite its strong theoretical\nguarantees, the approach is remarkably simple and intuitive: it randomly\nselects among a set of sub-forecasters, each of which predicts the empirical\noutcome frequency over recent time windows.", "published": "2025-04-12 06:28:05", "link": "http://arxiv.org/abs/2504.09096v1", "categories": ["cs.LG", "cs.DS", "cs.GT", "stat.ML"], "primary_category": "cs.LG"}
{"title": "An Incremental Non-Linear Manifold Approximation Method", "abstract": "Analyzing high-dimensional data presents challenges due to the \"curse of\ndimensionality'', making computations intensive. Dimension reduction\ntechniques, categorized as linear or non-linear, simplify such data. Non-linear\nmethods are particularly essential for efficiently visualizing and processing\ncomplex data structures in interactive and graphical applications. This\nresearch develops an incremental non-linear dimension reduction method using\nthe Geometric Multi-Resolution Analysis (GMRA) framework for streaming data.\nThe proposed method enables real-time data analysis and visualization by\nincrementally updating the cluster map, PCA basis vectors, and wavelet\ncoefficients. Numerical experiments show that the incremental GMRA accurately\nrepresents non-linear manifolds even with small initial samples and aligns\nclosely with batch GMRA, demonstrating efficient updates and maintaining the\nmultiscale structure. The findings highlight the potential of Incremental GMRA\nfor real-time visualization and interactive graphics applications that require\nadaptive high-dimensional data representations.", "published": "2025-04-12 03:54:05", "link": "http://arxiv.org/abs/2504.09068v1", "categories": ["stat.ML", "cs.GR", "cs.LG"], "primary_category": "stat.ML"}
{"title": "AMNet: An Acoustic Model Network for Enhanced Mandarin Speech Synthesis", "abstract": "This paper presents AMNet, an Acoustic Model Network designed to improve the\nperformance of Mandarin speech synthesis by incorporating phrase structure\nannotation and local convolution modules. AMNet builds upon the FastSpeech 2\narchitecture while addressing the challenge of local context modeling, which is\ncrucial for capturing intricate speech features such as pauses, stress, and\nintonation. By embedding a phrase structure parser into the model and\nintroducing a local convolution module, AMNet enhances the model's sensitivity\nto local information. Additionally, AMNet decouples tonal characteristics from\nphonemes, providing explicit guidance for tone modeling, which improves tone\naccuracy and pronunciation. Experimental results demonstrate that AMNet\noutperforms baseline models in subjective and objective evaluations. The\nproposed model achieves superior Mean Opinion Scores (MOS), lower Mel Cepstral\nDistortion (MCD), and improved fundamental frequency fitting $F0 (R^2)$,\nconfirming its ability to generate high-quality, natural, and expressive\nMandarin speech.", "published": "2025-04-12 14:02:31", "link": "http://arxiv.org/abs/2504.09225v1", "categories": ["cs.SD", "cs.AI", "eess.AS"], "primary_category": "cs.SD"}
{"title": "Generation of Musical Timbres using a Text-Guided Diffusion Model", "abstract": "In recent years, text-to-audio systems have achieved remarkable success,\nenabling the generation of complete audio segments directly from text\ndescriptions. While these systems also facilitate music creation, the element\nof human creativity and deliberate expression is often limited. In contrast,\nthe present work allows composers, arrangers, and performers to create the\nbasic building blocks for music creation: audio of individual musical notes for\nuse in electronic instruments and DAWs. Through text prompts, the user can\nspecify the timbre characteristics of the audio. We introduce a system that\ncombines a latent diffusion model and multi-modal contrastive learning to\ngenerate musical timbres conditioned on text descriptions. By jointly\ngenerating the magnitude and phase of the spectrogram, our method eliminates\nthe need for subsequently running a phase retrieval algorithm, as related\nmethods do.\n  Audio examples, source code, and a web app are available at\nhttps://wxuanyuan.github.io/Musical-Note-Generation/", "published": "2025-04-12 13:55:07", "link": "http://arxiv.org/abs/2504.09219v1", "categories": ["cs.SD", "eess.AS", "H.5.5; I.2.7"], "primary_category": "cs.SD"}
{"title": "SIFT-50M: A Large-Scale Multilingual Dataset for Speech Instruction Fine-Tuning", "abstract": "We introduce SIFT (Speech Instruction Fine-Tuning), a 50M-example dataset\ndesigned for instruction fine-tuning and pre-training of speech-text large\nlanguage models (LLMs). SIFT-50M is built from publicly available speech\ncorpora, which collectively contain 14K hours of speech, and leverages LLMs\nalong with off-the-shelf expert models. The dataset spans five languages,\nencompassing a diverse range of speech understanding as well as controllable\nspeech generation instructions. Using SIFT-50M, we train SIFT-LLM, which\noutperforms existing speech-text LLMs on instruction-following benchmarks while\nachieving competitive performance on foundational speech tasks. To support\nfurther research, we also introduce EvalSIFT, a benchmark dataset specifically\ndesigned to evaluate the instruction-following capabilities of speech-text\nLLMs.", "published": "2025-04-12 04:45:48", "link": "http://arxiv.org/abs/2504.09081v1", "categories": ["eess.AS", "cs.AI", "cs.CL"], "primary_category": "eess.AS"}
{"title": "Orthogonal Time-Frequency Space (OTFS) Aided Media-Based Modulation System For 6G and Beyond Wireless Communications Networks", "abstract": "This paper proposes a new orthogonal time frequency space (OTFS)-based index\nmodulation system called OTFS-aided media-based modulation (MBM) scheme\n(OTFS-MBM), which is a promising technique for high-mobility wireless\ncommunication systems. The OTFS technique transforms information into the\ndelay-Doppler domain, providing robustness against channel variations, while\nthe MBM system utilizes controllable radio frequency (RF) mirrors to enhance\nspectral efficiency. The combination of these two techniques offers improved\nbit error rate (BER) performance compared to conventional OTFS and OTFS-based\nspatial modulation (OTFS-SM) systems. The proposed system is evaluated through\nMonte Carlo simulations over high-mobility Rayleigh channels for various system\nparameters. Comparative throughput, spectral efficiency, and energy efficiency\nanalyses are presented, and it is shown that OTFS-MBM outperforms traditional\nOTFS and OTFS-SM techniques. The proposed OTFS-MBM scheme stands out as a\nviable solution for sixth generation (6G) and next-generation wireless\nnetworks, enabling reliable communication in dynamic wireless environments.", "published": "2025-04-12 23:43:28", "link": "http://arxiv.org/abs/2504.09371v1", "categories": ["eess.SP"], "primary_category": "eess.SP"}
{"title": "A New OTFS-Based Index Modulation System for 6G and Beyond: OTFS-Based Code Index Modulation", "abstract": "This paper proposes the orthogonal time frequency space-based code index\nmodulation (OTFS-CIM) scheme, a novel wireless communication system that\ncombines OTFS modulation, which enhances error performance in high-mobility\nRayleigh channels, with CIM technique, which improves spectral and energy\nefficiency, within a single-input multiple-output (SIMO) architecture. The\nproposed system is evaluated through Monte Carlo simulations for various system\nparameters. Results show that increasing the modulation order degrades\nperformance, while more receive antennas enhance it. Comparative analyses of\nerror performance, throughput, spectral efficiency, and energy saving\ndemonstrate that OTFS-CIM outperforms traditional OTFS and OTFS-based spatial\nmodulation (OTFS-SM) systems. Also, the proposed OTFS-CIM system outperforms\nbenchmark systems in many performance metrics under high-mobility scenarios,\nmaking it a strong candidate for sixth generation (6G) and beyond.", "published": "2025-04-12 23:10:41", "link": "http://arxiv.org/abs/2504.09364v1", "categories": ["eess.SP"], "primary_category": "eess.SP"}
{"title": "Graph-Based Prediction Models for Data Debiasing", "abstract": "Bias in data collection, arising from both under-reporting and\nover-reporting, poses significant challenges in critical applications such as\nhealthcare and public safety. In this work, we introduce Graph-based Over- and\nUnder-reporting Debiasing (GROUD), a novel graph-based optimization framework\nthat debiases reported data by jointly estimating the true incident counts and\nthe associated reporting bias probabilities. By modeling the bias as a smooth\nsignal over a graph constructed from geophysical or feature-based similarities,\nour convex formulation not only ensures a unique solution but also comes with\ntheoretical recovery guarantees under certain assumptions. We validate GROUD on\nboth challenging simulated experiments and real-world datasets -- including\nAtlanta emergency calls and COVID-19 vaccine adverse event reports --\ndemonstrating its robustness and superior performance in accurately recovering\ndebiased counts. This approach paves the way for more reliable downstream\ndecision-making in systems affected by reporting irregularities.", "published": "2025-04-12 21:34:49", "link": "http://arxiv.org/abs/2504.09348v1", "categories": ["stat.ME", "cs.LG", "eess.SP"], "primary_category": "stat.ME"}
{"title": "Computationally Efficient Signal Detection with Unknown Bandwidths", "abstract": "Signal detection in environments with unknown signal bandwidth and time\nintervals is a basic problem in adversarial and spectrum-sharing scenarios.\nThis paper addresses the problem of detecting signals occupying unknown degrees\nof freedom from non-coherent power measurements where the signal is constrained\nto an interval in one dimension or hypercube in multiple dimensions. A\nGeneralized Likelihood Ratio Test (GLRT) is derived, resulting in a\nstraightforward metric involving normalized average signal energy on each\ncandidate signal set. We present bounds on false alarm and missed detection\nprobabilities, demonstrating their dependence on signal-to-noise ratios (SNR)\nand signal set sizes. To overcome the inherent computational complexity of\nexhaustive searches, we propose a computationally efficient binary search\nmethod, reducing the complexity from O(N2) to O(N) for one-dimensional cases.\nSimulations indicate that the method maintains performance near exhaustive\nsearches and achieves asymptotic consistency, with interval-of-overlap\nconverging to one under constant SNR as measurement size increases. The\nsimulation studies also demonstrate superior performance and reduced complexity\ncompared to contemporary neural network-based approaches, specifically\noutperforming custom-trained U-Net models in spectrum detection tasks.", "published": "2025-04-12 21:06:56", "link": "http://arxiv.org/abs/2504.09342v1", "categories": ["eess.SP", "cs.SY", "eess.SY"], "primary_category": "eess.SP"}
{"title": "Macroscale Molecular Communication in IoT-based Pipeline Inspection and Monitoring Applications: Preliminary Experiment and Mathematical Model", "abstract": "Today, pipeline networks serve as critical infrastructure for transporting\nmaterials such as water, gas, and oil. Modern technologies such as the Internet\nof Things (IoT), sensor nodes, and inspection robots enable efficient pipeline\nmonitoring and inspection. They can help detect and monitor various conditions\nand defects in pipelines such as cracks, corrosion, leakage, pressure, flow,\nand temperature. Since most pipelines are buried underground, wireless\ncommunication links suffer from significant attenuation and noise due to harsh\nenvironmental conditions. In such systems, communication links are required\nbetween the sensor nodes as well as between the external control/monitoring\nunit or sensor node and the inspection robot inside the pipeline. In this\npaper, we propose a macroscale molecular communication (MC) system in the\nIoT-based pipeline inspection and monitoring networks to address this\nchallenge. We develop a mathematical model and implement a preliminary\nexperimental testbed to validate the system and demonstrate its feasibility by\ntransmitting and reconstructing binary sequences using volatile organic\ncompound (VOC) as an information signal. We examined the impact of various\nsystem parameters including airflow carrier velocity, released VOC velocity,\nemission duration, and bit duration. Results indicate that these parameters\nsignificantly influence the received molecular signal, emphasizing the need for\noptimal configuration. This work serves as a preliminary step for further\nresearch on the application of MC in IoT-based pipeline inspection and\nmonitoring systems.", "published": "2025-04-12 20:00:12", "link": "http://arxiv.org/abs/2504.09325v1", "categories": ["eess.SP"], "primary_category": "eess.SP"}
{"title": "Channel Estimation for mmWave Pinching-Antenna Systems", "abstract": "The full potential of pinching-antenna systems (PAS) can be unblocked if\npinching antennas can be accurately activated at positions tailored for the\nserving users', which means that acquiring accurate channel state information\n(CSI) at arbitrary positions along the waveguide is essential for the precise\nplacement of antennas. In this work, we propose an innovative channel\nestimation scheme for millimeter-wave (mmWave) PAS. The proposed approach\nrequires activating only a small number of pinching antennas, thereby limiting\nantenna switching and pilot overhead. Specifically, a base station (BS)\nequipped with a waveguide selectively activates subarrays located near and far\nfrom the feed point, each comprising a small number of pinching antennas. This\nconfiguration effectively emulates a large-aperture array, enabling\nhigh-accuracy estimation of multipath propagation parameters, including angles,\ndelays, and path gains. Simulation results demonstrate that the proposed method\nachieves accurate CSI estimation and data rates while effectively reducing\nhardware switching and pilot overhead.", "published": "2025-04-12 19:34:15", "link": "http://arxiv.org/abs/2504.09317v1", "categories": ["eess.SP"], "primary_category": "eess.SP"}
{"title": "Complexity-Scalable Near-Optimal Transceiver Design for Massive MIMO-BICM Systems", "abstract": "Future wireless networks are envisioned to employ multiple-input\nmultiple-output (MIMO) transmissions with large array sizes, and therefore, the\nadoption of complexity-scalable transceiver becomes important. In this paper,\nwe propose a novel complexity-scalable transceiver design for MIMO systems\nexploiting bit-interleaved coded modulation (termed MIMO-BICM systems). The\nproposed scheme leverages the channel bidiagonalization decomposition (CBD),\nbased on which an optimization framework for the precoder and post-processor is\ndeveloped for maximizing the mutual information (MI) with finite-alphabet\ninputs. Particularly, we unveil that the desired precoder and post-processor\nbehave distinctively with respect to the operating signal-to-noise ratio (SNR),\nwhere the equivalent channel condition number (ECCN) serves as an effective\nindicator for the overall achievable rate performance. Specifically, at low\nSNRs, diagonal transmission with a large ECCN is advantageous, while at high\nSNRs, uniform subchannel gains with a small ECCN are preferred. This allows us\nto further propose a low-complexity generalized parallel CBD design (GP-CBD)\nbased on Givens rotation according to a well-approximated closed-form\nperformance metric on the achievable rates that takes into account the insights\nfrom the ECCN. Numerical results validate the superior performance of the\nproposed scheme in terms of achievable rate and bit error rate (BER), compared\nto state-of-the-art designs across various modulation and coding schemes\n(MCSs).", "published": "2025-04-12 14:16:47", "link": "http://arxiv.org/abs/2504.09233v1", "categories": ["eess.SP"], "primary_category": "eess.SP"}
{"title": "Accurate Diagnosis of Respiratory Viruses Using an Explainable Machine Learning with Mid-Infrared Biomolecular Fingerprinting of Nasopharyngeal Secretions", "abstract": "Accurate identification of respiratory viruses (RVs) is critical for outbreak\ncontrol and public health. This study presents a diagnostic system that\ncombines Attenuated Total Reflectance Fourier Transform Infrared Spectroscopy\n(ATR-FTIR) from nasopharyngeal secretions with an explainable Rotary Position\nEmbedding-Sparse Attention Transformer (RoPE-SAT) model to accurately identify\nmultiple RVs within 10 minutes. Spectral data (4000-00 cm-1) were collected,\nand the bio-fingerprint region (1800-900 cm-1) was employed for analysis.\nStandard normal variate (SNV) normalization and second-order derivation were\napplied to reduce scattering and baseline drift. Gradient-weighted class\nactivation mapping (Grad-CAM) was employed to generate saliency maps,\nhighlighting spectral regions most relevant to classification and enhancing the\ninterpretability of model outputs. Two independent cohorts from Beijing Youan\nHospital, processed with different viral transport media (VTMs) and drying\nmethods, were evaluated, with one including influenza B, SARS-CoV-2, and\nhealthy controls, and the other including mycoplasma, SARS-CoV-2, and healthy\ncontrols. The model achieved sensitivity and specificity above 94.40% across\nboth cohorts. By correlating model-selected infrared regions with known\nbiomolecular signatures, we verified that the system effectively recognizes\nvirus-specific spectral fingerprints, including lipids, Amide I, Amide II,\nAmide III, nucleic acids, and carbohydrates, and leverages their weighted\ncontributions for accurate classification.", "published": "2025-04-12 13:33:01", "link": "http://arxiv.org/abs/2504.09211v1", "categories": ["cs.LG", "eess.SP"], "primary_category": "cs.LG"}
{"title": "Hybrid Beamforming for RIS-Assisted Multiuser Fluid Antenna Systems", "abstract": "Recent advances in reconfigurable antennas have led to the new concept of the\nfluid antenna system (FAS) for shape and position flexibility, as another\ndegree of freedom for wireless communication enhancement. This paper explores\nthe integration of a transmit FAS array for hybrid beamforming (HBF) into a\nreconfigurable intelligent surface (RIS)-assisted communication architecture\nfor multiuser communications in the downlink, corresponding to the downlink\nRIS-assisted multiuser multiple-input single-output (MISO) FAS model (Tx\nRIS-assisted-MISO-FAS). By considering Rician channel fading, we formulate a\nsum-rate maximization optimization problem to alternately optimize the HBF\nmatrix, the RIS phase-shift matrix, and the FAS position. Due to the strong\ncoupling of multiple optimization variables, the multi-fractional summation in\nthe sum-rate expression, the modulus-1 limitation of analog phase shifters and\nRIS, and the antenna position variables appearing in the exponent, this problem\nis highly non-convex, which is addressed through the block coordinate descent\n(BCD) framework in conjunction with semidefinite relaxation (SDR) and\nmajorization-minimization (MM) methods. To reduce the computational complexity,\nwe then propose a low-complexity grating-lobe (GL)-based telescopic-FAS (TFA)\nwith multiple delicately deployed RISs under the sub-connected HBF architecture\nand the line-of-sight (LoS)-dominant channel condition, to allow closed-form\nsolutions for the HBF and TFA position. Our simulation results illustrate that\nthe former optimization scheme significantly enhances the achievable rate of\nthe proposed system, while the GL-based TFA scheme also provides a considerable\ngain over conventional fixed-position antenna (FPA) systems, requiring\nstatistical channel state information (CSI) only and with low computational\ncomplexity.", "published": "2025-04-12 10:55:53", "link": "http://arxiv.org/abs/2504.09178v1", "categories": ["eess.SP"], "primary_category": "eess.SP"}
{"title": "Self-Supervised Autoencoder Network for Robust Heart Rate Extraction from Noisy Photoplethysmogram: Applying Blind Source Separation to Biosignal Analysis", "abstract": "Biosignals can be viewed as mixtures measuring particular physiological\nevents, and blind source separation (BSS) aims to extract underlying source\nsignals from mixtures. This paper proposes a self-supervised multi-encoder\nautoencoder (MEAE) to separate heartbeat-related source signals from\nphotoplethysmogram (PPG), enhancing heart rate (HR) detection in noisy PPG\ndata. The MEAE is trained on PPG signals from a large open polysomnography\ndatabase without any pre-processing or data selection. The trained network is\nthen applied to a noisy PPG dataset collected during the daily activities of\nnine subjects. The extracted heartbeat-related source signal significantly\nimproves HR detection as compared to the original PPG. The absence of\npre-processing and the self-supervised nature of the proposed method, combined\nwith its strong performance, highlight the potential of BSS in biosignal\nanalysis.", "published": "2025-04-12 08:47:53", "link": "http://arxiv.org/abs/2504.09132v1", "categories": ["cs.LG", "eess.SP", "I.2.6"], "primary_category": "cs.LG"}
{"title": "Ray-Based Characterization of the AMPLE Model from 0.85 to 5 GHz", "abstract": "In this paper, we characterize the adaptive multiple path loss exponent\n(AMPLE) radio propagation model under urban macrocell (UMa) and urban microcell\n(UMi) scenarios from 0.85-5 GHz using Ranplan Professional. We first enhance\nthe original AMPLE model by introducing an additional frequency coefficient to\nsupport path loss prediction across multiple carrier frequencies. By using\nmeasurement-validated Ranplan Professional simulator, we simulate four cities\nand validate the simulations for further path loss model characterization.\nSpecifically, we extract the close-in (CI) model parameters from the\nsimulations and compare them with parameters extracted from measurements in\nother works. Under the ray-based model characterization, we compare the AMPLE\nmodel with the 3rd Generation Partnership Project (3GPP) path loss model, the\nCI model, the alpha-beta-gamma (ABG) model, and those with simulation\ncalibrations. In addition to standard performance metrics, we introduce the\nprediction-measurement difference error (PMDE) to assess overall prediction\nalignment with measurement, and mean simulation time per data point to evaluate\nmodel complexity. The results show that the AMPLE model outperforms existing\nmodels while maintaining similar model complexity.", "published": "2025-04-12 08:05:28", "link": "http://arxiv.org/abs/2504.09116v1", "categories": ["eess.SP"], "primary_category": "eess.SP"}
{"title": "Leveraging Large Self-Supervised Time-Series Models for Transferable Diagnosis in Cross-Aircraft Type Bleed Air System", "abstract": "Bleed Air System (BAS) is critical for maintaining flight safety and\noperational efficiency, supporting functions such as cabin pressurization, air\nconditioning, and engine anti-icing. However, BAS malfunctions, including\noverpressure, low pressure, and overheating, pose significant risks such as\ncabin depressurization, equipment failure, or engine damage. Current diagnostic\napproaches face notable limitations when applied across different aircraft\ntypes, particularly for newer models that lack sufficient operational data. To\naddress these challenges, this paper presents a self-supervised learning-based\nfoundation model that enables the transfer of diagnostic knowledge from mature\naircraft (e.g., A320, A330) to newer ones (e.g., C919). Leveraging\nself-supervised pretraining, the model learns universal feature representations\nfrom flight signals without requiring labeled data, making it effective in\ndata-scarce scenarios. This model enhances both anomaly detection and baseline\nsignal prediction, thereby improving system reliability. The paper introduces a\ncross-model dataset, a self-supervised learning framework for BAS diagnostics,\nand a novel Joint Baseline and Anomaly Detection Loss Function tailored to\nreal-world flight data. These innovations facilitate efficient transfer of\ndiagnostic knowledge across aircraft types, ensuring robust support for early\noperational stages of new models. Additionally, the paper explores the\nrelationship between model capacity and transferability, providing a foundation\nfor future research on large-scale flight signal models.", "published": "2025-04-12 06:06:50", "link": "http://arxiv.org/abs/2504.09090v1", "categories": ["eess.SP"], "primary_category": "eess.SP"}
{"title": "Towards On-Device Learning and Reconfigurable Hardware Implementation for Encoded Single-Photon Signal Processing", "abstract": "Deep neural networks (DNNs) enhance the accuracy and efficiency of\nreconstructing key parameters from time-resolved photon arrival signals\nrecorded by single-photon detectors. However, the performance of conventional\nbackpropagation-based DNNs is highly dependent on various parameters of the\noptical setup and biological samples under examination, necessitating frequent\nnetwork retraining, either through transfer learning or from scratch. Newly\ncollected data must also be stored and transferred to a high-performance GPU\nserver for retraining, introducing latency and storage overhead. To address\nthese challenges, we propose an online training algorithm based on a One-Sided\nJacobi rotation-based Online Sequential Extreme Learning Machine (OSOS-ELM). We\nfully exploit parallelism in executing OSOS-ELM on a heterogeneous FPGA with\nintegrated ARM cores. Extensive evaluations of OSOS-ELM and OSELM demonstrate\nthat both achieve comparable accuracy across different network dimensions\n(i.e., input, hidden, and output layers), while OSOS-ELM proves to be more\nhardware-efficient. By leveraging the parallelism of OSOS-ELM, we implement a\nholistic computing prototype on a Xilinx ZCU104 FPGA, which integrates a\nmulti-core CPU and programmable logic fabric. We validate our approach through\nthree case studies involving single-photon signal analysis: sensing through fog\nusing commercial single-photon LiDAR, fluorescence lifetime estimation in FLIM,\nand blood flow index reconstruction in DCS, all utilizing one-dimensional data\nencoded from photonic signals. From a hardware perspective, we optimize the\nOSOS-ELM workload by employing multi-tasked processing on ARM CPU cores and\npipelined execution on the FPGA's logic fabric. We also implement our OSOS-ELM\non the NVIDIA Jetson Xavier NX GPU to comprehensively investigate its computing\nperformance on another type of heterogeneous computing platform.", "published": "2025-04-12 00:58:52", "link": "http://arxiv.org/abs/2504.09028v1", "categories": ["cs.LG", "eess.SP"], "primary_category": "cs.LG"}
{"title": "Arnold Diffusion in the Full Three-Body Problem", "abstract": "We show the existence of Arnold diffusion in the planar full three-body\nproblem, which is expressed as a perturbation of a Kepler problem and a planar\ncircular restricted three-body problem, with the perturbation parameter being\nthe mass of the smallest body. In this context, we obtain Arnold diffusion in\nterms of a transfer of energy, in an amount independent of the perturbation\nparameter, between the Kepler problem and the restricted three-body problem.\nOur argument is based on a topological method based on correctly aligned\nwindows which is implemented into a computer assisted proof. This approach can\nbe applied to physically relevant masses of the bodies, such as those in a\nNeptune-Triton-asteroid system. In this case, we obtain explicit estimates for\nthe range of the perturbation parameter and for the diffusion time.", "published": "2025-04-12 16:35:19", "link": "http://arxiv.org/abs/2504.09273v2", "categories": ["math.DS", "cs.NA", "math-ph", "math.MP", "math.NA", "37J25, 37J40, 65G40, 70F07, 70F15, 70K44"], "primary_category": "math.DS"}
{"title": "Inferring Outcome Means of Exponential Family Distributions Estimated by Deep Neural Networks", "abstract": "While deep neural networks (DNNs) are widely used for prediction, inference\non DNN-estimated subject-specific means for categorical or exponential family\noutcomes remains underexplored. We address this by proposing a DNN estimator\nunder generalized nonparametric regression models (GNRMs) and developing a\nrigorous inference framework. Unlike existing approaches that assume\nindependence between prediction errors and inputs to establish the error bound,\na condition often violated in GNRMs, we allow for dependence and our\ntheoretical analysis demonstrates the feasibility of drawing inference under\nGNRMs. To implement inference, we consider an Ensemble Subsampling Method (ESM)\nthat leverages U-statistics and the Hoeffding decomposition to construct\nreliable confidence intervals for DNN estimates. We show that, under GNRM\nsettings, ESM enables model-free variance estimation and accounts for\nheterogeneity among individuals in the population. Through simulations under\nnonparametric logistic, Poisson, and binomial regression models, we demonstrate\nthe effectiveness and efficiency of our method. We further apply the method to\nthe electronic Intensive Care Unit (eICU) dataset, a large-scale collection of\nanonymized health records from ICU patients, to predict ICU readmission risk\nand offer patient-centric insights for clinical decision-making.", "published": "2025-04-12 21:32:42", "link": "http://arxiv.org/abs/2504.09347v2", "categories": ["stat.ML", "cs.LG", "math.ST", "stat.TH"], "primary_category": "stat.ML"}
{"title": "FairACE: Achieving Degree Fairness in Graph Neural Networks via Contrastive and Adversarial Group-Balanced Training", "abstract": "Fairness has been a significant challenge in graph neural networks (GNNs)\nsince degree biases often result in un-equal prediction performance among nodes\nwith varying degrees. Existing GNN models focus on prediction accuracy,\nfrequently overlooking fairness across different degree groups. To addressthis\nissue, we propose a novel GNN framework, namely Fairness- Aware Asymmetric\nContrastive Ensemble (FairACE), which inte-grates asymmetric contrastive\nlearning with adversarial training to improve degree fairness. FairACE captures\none-hop local neighborhood information and two-hop monophily similarity to\ncreate fairer node representations and employs a degree fairness regulator to\nbalance performance between high-degree and low-degree nodes. During model\ntraining, a novel group-balanced fairness loss is proposed to minimize\nclassification disparities across degree groups. In addition, we also propose a\nnovel fairness metric, the Accuracy Distribution Gap (ADG), which can\nquantitatively assess and ensure equitable performance across different\ndegree-based node groups. Experimental results on both synthetic and real-world\ndatasets demonstrate that FairACE significantly improves degree fairness\nmetrics while maintaining competitive accuracy in comparison to the\nstate-of-the-art GNN models.", "published": "2025-04-12 13:32:11", "link": "http://arxiv.org/abs/2504.09210v2", "categories": ["cs.LG", "cs.AI", "cs.SI", "stat.ML"], "primary_category": "cs.LG"}
{"title": "HeteRAG: A Heterogeneous Retrieval-augmented Generation Framework with Decoupled Knowledge Representations", "abstract": "Retrieval-augmented generation (RAG) methods can enhance the performance of\nLLMs by incorporating retrieved knowledge chunks into the generation process.\nIn general, the retrieval and generation steps usually have different\nrequirements for these knowledge chunks. The retrieval step benefits from\ncomprehensive information to improve retrieval accuracy, whereas excessively\nlong chunks may introduce redundant contextual information, thereby diminishing\nboth the effectiveness and efficiency of the generation process. However,\nexisting RAG methods typically employ identical representations of knowledge\nchunks for both retrieval and generation, resulting in suboptimal performance.\nIn this paper, we propose a heterogeneous RAG framework (\\myname) that\ndecouples the representations of knowledge chunks for retrieval and generation,\nthereby enhancing the LLMs in both effectiveness and efficiency. Specifically,\nwe utilize short chunks to represent knowledge to adapt the generation step and\nutilize the corresponding chunk with its contextual information from\nmulti-granular views to enhance retrieval accuracy. We further introduce an\nadaptive prompt tuning method for the retrieval model to adapt the\nheterogeneous retrieval augmented generation process. Extensive experiments\ndemonstrate that \\myname achieves significant improvements compared to\nbaselines.", "published": "2025-04-12 13:12:54", "link": "http://arxiv.org/abs/2504.10529v1", "categories": ["cs.IR", "cs.AI"], "primary_category": "cs.IR"}
{"title": "BioChemInsight: An Open-Source Toolkit for Automated Identification and Recognition of Optical Chemical Structures and Activity Data in Scientific Publications", "abstract": "Automated extraction of chemical structures and their bioactivity data is\ncrucial for accelerating drug discovery and enabling data-driven pharmaceutical\nresearch. Existing optical chemical structure recognition (OCSR) tools fail to\nautonomously associate molecular structures with their bioactivity profiles,\ncreating a critical bottleneck in structure-activity relationship (SAR)\nanalysis. Here, we present BioChemInsight, an open-source pipeline that\nintegrates: (1) DECIMER Segmentation and MolVec for chemical structure\nrecognition, (2) Qwen2.5-VL-32B for compound identifier association, and (3)\nPaddleOCR with Gemini-2.0-flash for bioactivity extraction and unit\nnormalization. We evaluated the performance of BioChemInsight on 25 patents and\n17 articles. BioChemInsight achieved 95% accuracy for tabular patent data\n(structure/identifier recognition), with lower accuracy in non-tabular patents\n(~80% structures, ~75% identifiers), plus 92.2 % bioactivity extraction\naccuracy. For articles, it attained >99% identifiers and 78-80% structure\naccuracy in non-tabular formats, plus 97.4% bioactivity extraction accuracy.\nThe system generates ready-to-use SAR datasets, reducing data preprocessing\ntime from weeks to hours while enabling applications in high-throughput\nscreening and ML-driven drug design\n(https://github.com/dahuilangda/BioChemInsight).", "published": "2025-04-12 04:56:44", "link": "http://arxiv.org/abs/2504.10525v1", "categories": ["q-bio.QM", "cs.CL", "cs.IR"], "primary_category": "q-bio.QM"}
