{"title": "The commutativity problem for effective varieties of formal series, and applications", "abstract": "A formal series in noncommuting variables $\\Sigma$ over the rationals is a\nmapping $\\Sigma^* \\to \\mathbb Q$. We say that a series is commutative if the\nvalue in the output does not depend on the order of the symbols in the input.\nThe commutativity problem for a class of series takes as input a (finite\npresentation of) a series from the class and amounts to establishing whether it\nis commutative. This is a very natural, albeit nontrivial problem, which has\nnot been considered before from an algorithmic perspective.\n  We show that commutativity is decidable for all classes of series that\nconstitute a so-called effective prevariety, a notion generalising Reutenauer's\nvarieties of formal series. For example, the class of rational series,\nintroduced by Sch\\\"utzenberger in the 1960's, is well-known to be an effective\n(pre)variety, and thus commutativity is decidable for it.\n  In order to showcase the applicability of our result, we consider classes of\nformal series generalising the rational ones. We consider polynomial automata,\nshuffle automata, and infiltration automata, and we show that each of these\nmodels recognises an effective prevariety of formal series. Consequently, their\ncommutativity problem is decidable, which is a novel result. We find it\nremarkable that commutativity can be decided in a uniform way for such\ndisparate computation models.\n  Finally, we present applications of commutativity outside the theory of\nformal series. We show that we can decide solvability in sequences and in power\nseries for restricted classes of algebraic difference and differential\nequations, for which such problems are undecidable in full generality. Thanks\nto this, we can prove that the syntaxes of multivariate polynomial recursive\nsequences and of constructible differentially algebraic power series are\neffective, which are new results which were left open in previous work.", "published": "2025-03-27 17:01:19", "link": "http://arxiv.org/abs/2503.21697v1", "categories": ["cs.FL", "cs.DM", "cs.LO"], "primary_category": "cs.FL"}
{"title": "The Avoider-Enforcer game on hypergraphs of rank 3", "abstract": "In the Avoider-Enforcer convention of positional games, two players, Avoider\nand Enforcer, take turns selecting vertices from a hypergraph H. Enforcer wins\nif, by the time all vertices of H have been selected, Avoider has completely\nfilled an edge of H with her vertices; otherwise, Avoider wins. In this paper,\nwe first give some general results, in particular regarding the outcome of the\ngame and disjoint unions of hypergraphs. We then determine which player has a\nwinning strategy for all hypergraphs of rank 2, and for linear hypergraphs of\nrank 3 when Avoider plays the last move. The structural characterisations we\nobtain yield polynomial-time algorithms.", "published": "2025-03-27 16:40:37", "link": "http://arxiv.org/abs/2503.21672v1", "categories": ["math.CO", "cs.DM"], "primary_category": "math.CO"}
{"title": "On the Maiorana-McFarland Class Extensions", "abstract": "The closure $\\mathcal{M}_{m}^{\\#}$ and the extension\n$\\widehat{\\mathcal{M}}_{m}$ of the Maiorana--McFarland class $\\mathcal{M}_{m}$\nin $m = 2n$ variables relative to the extended-affine equivalence and the bent\nfunction construction $f \\oplus \\mathrm{Ind}_{U}$ are considered, where $U$ is\nan affine subspace of $\\mathbb{F}_{2}^{m}$ of dimension $m/2$. We obtain an\nexplicit formula for $|\\widehat{\\mathcal{M}}_{m}|$ and an upper bound for\n$|\\widehat{\\mathcal{M}}_{m}^{\\#}|$. Asymptotically tight bounds for\n$|\\mathcal{M}_{m}^{\\#}|$ are proved as well, for instance,\n$|\\mathcal{M}_{8}^{\\#}| \\approx 2^{77.865}$. Metric properties of\n$\\mathcal{M}_{m}$ and $\\mathcal{M}_{m}^{\\#}$ are also investigated. We find the\nnumber of all closest bent functions to the set $\\mathcal{M}_{m}$ and provide\nan upper bound of the same number for $\\mathcal{M}_{m}^{\\#}$. The average\nnumber $E(\\mathcal{M}_{m})$ of $m/2$-dimensional affine subspaces of\n$\\mathbb{F}_{2}^{m}$ such that a function from $\\mathcal{M}_{m}$ is affine on\neach of them is calculated. We obtain that similarly defined\n$E(\\mathcal{M}_{m}^{\\#})$ satisfies $E(\\mathcal{M}_{m}^{\\#}) <\nE(\\mathcal{M}_{m})$ and $E(\\mathcal{M}_{m}^{\\#}) = E(\\mathcal{M}_{m}) - o(1)$.", "published": "2025-03-27 12:34:05", "link": "http://arxiv.org/abs/2503.21440v1", "categories": ["cs.CR", "cs.DM", "math.CO", "06E30, 94A60"], "primary_category": "cs.CR"}
{"title": "Efficient Algorithms for Minimizing the Kirchhoff Index via Adding Edges", "abstract": "The Kirchhoff index, which is the sum of the resistance distance between\nevery pair of nodes in a network, is a key metric for gauging network\nperformance, where lower values signify enhanced performance. In this paper, we\nstudy the problem of minimizing the Kirchhoff index by adding edges. We first\nprovide a greedy algorithm for solving this problem and give an analysis of its\nquality based on the bounds of the submodularity ratio and the curvature. Then,\nwe introduce a gradient-based greedy algorithm as a new paradigm to solve this\nproblem. To accelerate the computation cost, we leverage geometric properties,\nconvex hull approximation, and approximation of the projected coordinate of\neach point. To further improve this algorithm, we use pre-pruning and fast\nupdate techniques, making it particularly suitable for large networks. Our\nproposed algorithms have nearly-linear time complexity. We provide extensive\nexperiments on ten real networks to evaluate the quality of our algorithms. The\nresults demonstrate that our proposed algorithms outperform the\nstate-of-the-art methods in terms of efficiency and effectiveness. Moreover,\nour algorithms are scalable to large graphs with over 5 million nodes and 12\nmillion edges.", "published": "2025-03-27 11:52:24", "link": "http://arxiv.org/abs/2503.21409v1", "categories": ["cs.DM"], "primary_category": "cs.DM"}
{"title": "On Supports for graphs of bounded genus", "abstract": "Let $(X,\\mathcal{E})$ be a hypergraph. A support is a graph $Q$ on $X$ such\nthat for each $E\\in\\mathcal{E}$, the subgraph of $Q$ induced on the elements in\n$E$ is connected. We consider the problem of constructing a support for\nhypergraphs defined by connected subgraphs of a host graph. For a graph\n$G=(V,E)$, let $\\mathcal{H}$ be a set of connected subgraphs of $G$. Let the\nvertices of $G$ be partitioned into two sets the \\emph{terminals}\n$\\mathbf{b}(V)$ and the \\emph{non-terminals} $\\mathbf{r}(V)$. We define a\nhypergraph on $\\mathbf{b}(V)$, where each $H\\in\\mathcal{H}$ defines a hyperedge\nconsisting of the vertices of $\\mathbf{b}(V)$ in $H$.\n  We also consider the problem of constructing a support for the \\emph{dual\nhypergraph} - a hypergraph on $\\mathcal{H}$ where each $v\\in \\mathbf{b}(V)$\ndefines a hyperedge consisting of the subgraphs in $\\mathcal{H}$ containing\n$v$. In fact, we construct supports for a common generalization of the primal\nand dual settings called the \\emph{intersection hypergraph}.\n  As our main result, we show that if the host graph $G$ has bounded genus and\nthe subgraphs in $\\mathcal{H}$ satisfy a condition of being \\emph{cross-free},\nthen there exists a support that also has bounded genus. Our results are a\ngeneralization of the results of Raman and Ray (Rajiv Raman, Saurabh Ray:\nConstructing Planar Support for Non-Piercing Regions. Discret. Comput. Geom.\n64(3): 1098-1122 (2020)).\n  Our techniques imply a unified analysis for packing and covering problems for\nhypergraphs defined on surfaces of bounded genus. We also describe applications\nof our results for hypergraph colorings.", "published": "2025-03-27 09:11:24", "link": "http://arxiv.org/abs/2503.21287v1", "categories": ["math.CO", "cs.DM", "05C65, 05C10"], "primary_category": "math.CO"}
{"title": "From Deep Learning to LLMs: A survey of AI in Quantitative Investment", "abstract": "Quantitative investment (quant) is an emerging, technology-driven approach in\nasset management, increasingy shaped by advancements in artificial\nintelligence. Recent advances in deep learning and large language models (LLMs)\nfor quant finance have improved predictive modeling and enabled agent-based\nautomation, suggesting a potential paradigm shift in this field. In this\nsurvey, taking alpha strategy as a representative example, we explore how AI\ncontributes to the quantitative investment pipeline. We first examine the early\nstage of quant research, centered on human-crafted features and traditional\nstatistical models with an established alpha pipeline. We then discuss the rise\nof deep learning, which enabled scalable modeling across the entire pipeline\nfrom data processing to order execution. Building on this, we highlight the\nemerging role of LLMs in extending AI beyond prediction, empowering autonomous\nagents to process unstructured data, generate alphas, and support\nself-iterative workflows.", "published": "2025-03-27 12:10:15", "link": "http://arxiv.org/abs/2503.21422v1", "categories": ["q-fin.CP", "cs.AI", "cs.LG", "q-fin.ST", "q-fin.TR"], "primary_category": "q-fin.CP"}
{"title": "Pool Value Replication (CPM) and Impermanent Loss Hedging", "abstract": "This work analytically characterizes impermanent loss for automated market\nmakers (AMMs) in decentralized markets such as Uniswap or Balancer (CPMM). We\nderive a static replication formula for the pool's value using a combination of\nEuropean calls and puts. Furthermore, we establish a result guaranteeing\nhedging coverage for all final prices within a predefined interval. These\ntheoretical results motivate a numerical example where we illustrate the\nstrangle strategy using real cryptocurrency options data from Deribit, one of\nthe most liquid markets available.", "published": "2025-03-27 20:31:33", "link": "http://arxiv.org/abs/2503.21967v1", "categories": ["q-fin.RM", "q-fin.MF"], "primary_category": "q-fin.RM"}
{"title": "Dynamic Asset Pricing Theory for Life Contingent Risks", "abstract": "Although the valuation of life contingent assets has been thoroughly\ninvestigated under the framework of mathematical statistics, little financial\neconomics research pays attention to the pricing of these assets in a\nnon-arbitrage, complete market. In this paper, we first revisit the Fundamental\nTheorem of Asset Pricing (FTAP) and the short proof of it. Then we point out\nthat discounted asset price is a martingale only when dividends are zero under\nall random states of the world, using a simple proof based on pricing kernel.\nNext, we apply Fundamental Theorem of Asset Pricing (FTAP) to find valuation\nformula for life contingent assets including life insurance policies and life\ncontingent annuities. Last but not least, we state the assumption of static\nportfolio in a dynamic economy, and clarify the FTAP that accommodates the\nvaluation of a portfolio of life contingent policies.", "published": "2025-03-27 08:24:05", "link": "http://arxiv.org/abs/2503.21256v1", "categories": ["q-fin.PR", "math.PR", "q-fin.MF", "q-fin.ST"], "primary_category": "q-fin.PR"}
